{
  "israel": [
    {
      "title": "Live updates: Israeli strikes could cause regime change in Iran, Netanyahu says; Iran fires more missiles at Israel - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 20:42:15 GMT"
    },
    {
      "title": "Israel-Iran live news: Missile hits Haifa, Trump calls for a deal - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 00:02:36 GMT"
    },
    {
      "title": "Israel and Iran trade attacks for a fourth day - Financial Times",
      "pubDate": "Mon, 16 Jun 2025 06:26:51 GMT"
    },
    {
      "title": "Israel Takes Control of Iran’s Skies—a Feat That Still Eludes Russia in Ukraine - WSJ",
      "pubDate": "Mon, 16 Jun 2025 03:00:00 GMT"
    },
    {
      "title": "With no clear exit strategy in Iran, Israel risks another war with no end - CNN",
      "pubDate": "Mon, 16 Jun 2025 10:30:00 GMT"
    },
    {
      "title": "Israel attacks Gaza aid again: 38 Palestinians killed; deadliest toll in near-daily shootings - Times of India",
      "pubDate": "Mon, 16 Jun 2025 11:42:00 GMT"
    },
    {
      "title": "Live updates: Israel-Iran attacks, missile strikes on Tehran, Tel Aviv, Haifa, rising death tolls - CNN",
      "pubDate": "Tue, 17 Jun 2025 00:36:00 GMT"
    },
    {
      "title": "Israel-Iran live updates: Trump heads to Situation Room as Middle East tensions escalate, sources say - ABC News",
      "pubDate": "Tue, 17 Jun 2025 01:04:00 GMT"
    },
    {
      "title": "Israel's war with Iran could spiral out of control — and draw the U.S. in - MSNBC News",
      "pubDate": "Mon, 16 Jun 2025 22:29:15 GMT"
    },
    {
      "title": "Israel Vows to Strike ‘Everywhere’ Against Iranian Regime - Foreign Policy",
      "pubDate": "Mon, 16 Jun 2025 22:10:01 GMT"
    },
    {
      "title": "LIVE: Israel and Iran trade attacks; new Gaza ‘massacre’ of aid-seekers - Al Jazeera",
      "pubDate": "Tue, 17 Jun 2025 10:25:58 GMT"
    },
    {
      "title": "Israel-Iran Live Updates: Trump Says He's Working on 'Something Much Bigger' Than Cease-Fire - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 11:14:57 GMT"
    },
    {
      "title": "Israel-Iran live updates: IDF says it killed Iran's new wartime chief of staff - NBC News",
      "pubDate": "Tue, 17 Jun 2025 13:49:31 GMT"
    },
    {
      "title": "Israel-Iran live updates: President Trump spoke with Netanyahu, White House official says - ABC News",
      "pubDate": "Tue, 17 Jun 2025 23:30:00 GMT"
    },
    {
      "title": "Israel-Iran latest: Israel launches new attacks on Tehran - Financial Times",
      "pubDate": "Wed, 18 Jun 2025 06:25:26 GMT"
    },
    {
      "title": "Israel airstrikes target Iranian missile facilities, Trump calls for Tehran's 'unconditional surrender' - Reuters",
      "pubDate": "Wed, 18 Jun 2025 07:05:40 GMT"
    },
    {
      "title": "Thousands flee Tehran, source says Trump's options include joining Israel in strikes - Reuters",
      "pubDate": "Wed, 18 Jun 2025 08:34:44 GMT"
    },
    {
      "title": "Israel-Iran live updates: 'War will be met with war' Khamenei warns US - ABC News",
      "pubDate": "Wed, 18 Jun 2025 11:17:00 GMT"
    },
    {
      "title": "Israel’s assumption US would get drawn into Iran war is being put to the test - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 15:22:00 GMT"
    },
    {
      "title": "Israel-Iran live updates: Iranian missile strikes Israeli hospital, officials say - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Thu, 19 Jun 2025 05:30:00 GMT"
    },
    {
      "title": "Live updates: Israel says it targeted Iran's Arak nuclear reactor, reports 'direct hit' on hospital by Iranian missile - NBC News",
      "pubDate": "Thu, 19 Jun 2025 07:29:38 GMT"
    },
    {
      "title": "Israel attacks Iranian nuclear sites, missile damages Israeli hospital - Reuters",
      "pubDate": "Thu, 19 Jun 2025 08:10:33 GMT"
    },
    {
      "title": "Heavy damage, injuries as Iranian missile hits Beersheba hospital; dozens hurt in central cities - The Times of Israel",
      "pubDate": "Thu, 19 Jun 2025 09:04:05 GMT"
    },
    {
      "title": "Israel says Iran will pay for hospital airstrike; world awaits Trump decision: Live - USA Today",
      "pubDate": "Thu, 19 Jun 2025 11:48:29 GMT"
    }
  ],
  "iran": [
    {
      "title": "Gasoline Prices Likely to Rise as Israel Targets Iran’s Energy Infrastructure - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 20:13:13 GMT"
    },
    {
      "title": "Israel attacked three key Iranian nuclear facilities. Did it strike a decisive blow? - CNN",
      "pubDate": "Sun, 15 Jun 2025 16:05:00 GMT"
    },
    {
      "title": "Iran’s Leaders Face a Reckoning as Israeli Strikes Intensify - Bloomberg",
      "pubDate": "Sun, 15 Jun 2025 21:00:29 GMT"
    },
    {
      "title": "Reports of 'massive blast,' 2.5 magnitude earthquake in vicinity of Iran's Fordow nuclear plant - i24NEWS",
      "pubDate": "Sun, 15 Jun 2025 23:13:12 GMT"
    },
    {
      "title": "LIVE: Iran launches more attacks on Israel; 8 killed and dozens wounded - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 07:41:15 GMT"
    },
    {
      "title": "Explosions and Buzzing Drones Heard as Israel and Iran Exchange New Wave of Attacks - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 09:46:43 GMT"
    },
    {
      "title": "With No Clear Off-Ramp, Israel’s War With Iran May Last Weeks, Not Days - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 09:30:59 GMT"
    },
    {
      "title": "Iran missile attacks on Israel kill 8. Israel warns some Tehran residents to evacuate before strikes - AP News",
      "pubDate": "Mon, 16 Jun 2025 14:08:00 GMT"
    },
    {
      "title": "Exclusive | A Battered Iran Signals It Wants to De-Escalate Hostilities With Israel and Negotiate - WSJ",
      "pubDate": "Mon, 16 Jun 2025 17:28:00 GMT"
    },
    {
      "title": "Israel issues Tehran evacuation order as Iran threatens to leave nuclear weapons treaty - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 10:34:00 GMT"
    },
    {
      "title": "Israel strikes state-run Iranian TV during live broadcast after Iranian missiles kill 8 in Israel - AP News",
      "pubDate": "Mon, 16 Jun 2025 20:42:00 GMT"
    },
    {
      "title": "Israel Attacks Iran’s State Television, Live On The Air - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 03:04:54 GMT"
    },
    {
      "title": "Live updates: Israel claims aerial superiority over Tehran as Iran launches more missiles - NBC News",
      "pubDate": "Tue, 17 Jun 2025 05:21:00 GMT"
    },
    {
      "title": "Missiles pound Iran and Israel as dozens ‘massacred’ in Gaza - Al Jazeera",
      "pubDate": "Tue, 17 Jun 2025 09:11:15 GMT"
    },
    {
      "title": "Israel-Iran live updates: Trump seeking 'real end' to Tehran nuclear program - ABC News",
      "pubDate": "Tue, 17 Jun 2025 10:17:00 GMT"
    },
    {
      "title": "Israeli strikes damage Iran's underground nuclear site, agency says, as Trump issues ominous warning - AP News",
      "pubDate": "Tue, 17 Jun 2025 12:28:00 GMT"
    },
    {
      "title": "Israel says it killed a top Iranian general as Trump warns people to flee Iranian capital - AP News",
      "pubDate": "Tue, 17 Jun 2025 16:35:00 GMT"
    },
    {
      "title": "Live updates: Trump says the US knows where Iran's leader is hiding but won't kill him — 'for now' - AP News",
      "pubDate": "Tue, 17 Jun 2025 18:38:00 GMT"
    },
    {
      "title": "Iran Is Preparing Missiles for Possible Retaliatory Strikes on U.S. Bases - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 20:10:44 GMT"
    },
    {
      "title": "US spies said Iran wasn't building a nuclear weapon. Trump dismisses that assessment - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 02:05:19 GMT"
    },
    {
      "title": "Israel’s gamble on force could push Iran to accelerate nuclear plans - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "LIVE: Khamenei warns US against attacks, Israel claims 40 sites hit - Al Jazeera",
      "pubDate": "Wed, 18 Jun 2025 07:49:28 GMT"
    },
    {
      "title": "Israel-Iran Live Updates: Trump Considering U.S. Strike; Supreme Leader Khamenei Says Iran Won’t Surrender - WSJ",
      "pubDate": "Wed, 18 Jun 2025 14:36:00 GMT"
    },
    {
      "title": "Experts warn that Iran could target US with cyberattacks over Middle East involvement - The Independent",
      "pubDate": "Wed, 18 Jun 2025 15:28:00 GMT"
    },
    {
      "title": "Israel-Iran live updates: Iran warns U.S. military intervention would bring ‘irreparable damage’ - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 16:46:08 GMT"
    },
    {
      "title": "Israel-Iran Live Updates: Trump Meets With Advisors in Situation Room to Weigh Options - WSJ",
      "pubDate": "Wed, 18 Jun 2025 21:21:00 GMT"
    },
    {
      "title": "7 Experts on What Happens If the United States Bombs Iran - Politico",
      "pubDate": "Wed, 18 Jun 2025 22:51:50 GMT"
    },
    {
      "title": "Israel, Iran Trade New Strikes As US Prepares For Possible Attack On Tehran: 10 Points - NDTV",
      "pubDate": "Thu, 19 Jun 2025 02:25:43 GMT"
    },
    {
      "title": "Why Israel wants US bunker busters to hit Iran’s Fordow nuclear site - Al Jazeera",
      "pubDate": "Thu, 19 Jun 2025 07:09:01 GMT"
    },
    {
      "title": "Israel Moves To ‘Intensify Strikes’ After Iranian Missile Damages Hospital (Live Updates) - Forbes",
      "pubDate": "Thu, 19 Jun 2025 10:04:00 GMT"
    },
    {
      "title": "Israel threatens to kill Iran’s supreme leader after missile strikes - Al Jazeera",
      "pubDate": "Thu, 19 Jun 2025 12:52:01 GMT"
    },
    {
      "title": "Israel strikes Iranian nuclear sites, Iran retaliates against military targets - SHINE - BEYOND A SINGLE STORY",
      "pubDate": "Thu, 19 Jun 2025 11:54:00 GMT"
    }
  ],
  "donald_trump": [
    {
      "title": "Trump rejects Israeli plan to kill Iranian supreme leader, US officials say - CNN",
      "pubDate": "Sun, 15 Jun 2025 18:25:00 GMT"
    },
    {
      "title": "Trump vetoed Israeli proposal to assassinate Iran’s supreme leader - NBC News",
      "pubDate": "Sun, 15 Jun 2025 20:40:13 GMT"
    },
    {
      "title": "Live Updates: Israel and Iran Launch New Attacks; Trump Nixed Israeli Plan to Kill Iran’s Khamenei - WSJ",
      "pubDate": "Sun, 15 Jun 2025 23:21:00 GMT"
    },
    {
      "title": "Trump directs ICE to expand deportations in Democratic-run cities, undeterred by protests - AP News",
      "pubDate": "Mon, 16 Jun 2025 01:21:00 GMT"
    },
    {
      "title": "Live Updates: Israel Launches New Strikes on Iran as Trump Calls for Resolution - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 03:45:00 GMT"
    },
    {
      "title": "Trump administration weighs adding 36 countries to travel ban, memo says - Reuters",
      "pubDate": "Sun, 15 Jun 2025 21:00:47 GMT"
    },
    {
      "title": "Trump says he 'may' call Walz after Minnesota shootings, calls him 'grossly incompetent' - ABC News",
      "pubDate": "Sun, 15 Jun 2025 18:33:45 GMT"
    },
    {
      "title": "Trump says must expand efforts to deport people illegally in US - Reuters",
      "pubDate": "Mon, 16 Jun 2025 01:27:18 GMT"
    },
    {
      "title": "As Trump Returns to G7, Rift With Allies Is Even Deeper - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 21:06:15 GMT"
    },
    {
      "title": "Trump orders ICE to ramp up deportations in Democratic stronghold cities - France 24",
      "pubDate": "Mon, 16 Jun 2025 02:22:38 GMT"
    },
    {
      "title": "Trump orders Ice to expand deportation of migrants - BBC",
      "pubDate": "Mon, 16 Jun 2025 05:18:14 GMT"
    },
    {
      "title": "Ivanka Trump's Father's Day Message Goes Viral - Newsweek",
      "pubDate": "Mon, 16 Jun 2025 09:33:01 GMT"
    },
    {
      "title": "As G7 leaders meet, allies ask: Is Trump with us or against us? - CNBC",
      "pubDate": "Mon, 16 Jun 2025 10:33:46 GMT"
    },
    {
      "title": "Trump accelerates push to reward loyalty in federal workforce - The Washington Post",
      "pubDate": "Mon, 16 Jun 2025 12:30:33 GMT"
    },
    {
      "title": "Why Senate Republicans might not let Trump give back $9.3 billion - MSNBC News",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Trump Halts ICE Arrests at Farms, Hotels Amid Industry Concerns: Live Updates - Newsweek",
      "pubDate": "Mon, 16 Jun 2025 14:15:02 GMT"
    },
    {
      "title": "The Trumps Promote a New Crypto Venture: Bitcoin Mining - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 15:03:52 GMT"
    },
    {
      "title": "Trump Organization announces mobile plan, $499 smartphone - CNBC",
      "pubDate": "Mon, 16 Jun 2025 12:31:43 GMT"
    },
    {
      "title": "Trump Is Planning Semiconductor Tariffs to Fight China. They Will Be Costly. - Barron's",
      "pubDate": "Mon, 16 Jun 2025 17:21:00 GMT"
    },
    {
      "title": "Trump says expelling Russia from G7 was a 'mistake' as he meets Carney - BBC",
      "pubDate": "Mon, 16 Jun 2025 14:51:39 GMT"
    },
    {
      "title": "Trump Media seeks SEC approval for bitcoin and ethereum ETF - Reuters",
      "pubDate": "Mon, 16 Jun 2025 16:29:08 GMT"
    },
    {
      "title": "Live updates: Trump attends G7 summit in Canada amid trade tensions - NBC News",
      "pubDate": "Mon, 16 Jun 2025 20:03:04 GMT"
    },
    {
      "title": "Trump Will Not Sign G7 Statement on Iran and Israel, Official Says - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 20:53:54 GMT"
    },
    {
      "title": "Trump Live Updates: At G7 Summit in Canada, President Laments Russia’s Absence - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 21:45:17 GMT"
    },
    {
      "title": "Trump says everyone should immediately evacuate Tehran - Reuters",
      "pubDate": "Mon, 16 Jun 2025 22:40:00 GMT"
    },
    {
      "title": "LIVE: Israel, Iran trade attacks; Trump orders Tehran residents to flee - Al Jazeera",
      "pubDate": "Tue, 17 Jun 2025 00:00:35 GMT"
    },
    {
      "title": "Fact check: At G7, Trump makes false claims about Trudeau, Ukraine and immigration - CNN",
      "pubDate": "Mon, 16 Jun 2025 22:11:00 GMT"
    },
    {
      "title": "Trump urges everyone in Tehran to evacuate 'before it is too late' - USA Today",
      "pubDate": "Tue, 17 Jun 2025 03:24:22 GMT"
    },
    {
      "title": "Trump is facing heat from all sides, but his fateful Iran decision is one only he can make - CNN",
      "pubDate": "Tue, 17 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Trump to leave G7 summit early to monitor tensions in the Middle East - CNN",
      "pubDate": "Tue, 17 Jun 2025 04:05:22 GMT"
    },
    {
      "title": "Israel warns 300,000 people in Tehran to evacuate as Trump issues ominous message - AP News",
      "pubDate": "Tue, 17 Jun 2025 03:09:00 GMT"
    },
    {
      "title": "Republican hawks vs Maga isolationists: the internal war that could decide Trump’s Iran response - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 06:06:00 GMT"
    },
    {
      "title": "Trump says early G7 exit 'nothing to do' with ceasefire as Iran and Israel exchange strikes - live updates - BBC",
      "pubDate": "Tue, 17 Jun 2025 07:40:01 GMT"
    },
    {
      "title": "Israel-Iran latest: Trump exits G7 summit and warns of intensification - Financial Times",
      "pubDate": "Tue, 17 Jun 2025 08:53:00 GMT"
    },
    {
      "title": "Lawmakers Seek to Limit Trump From Dragging U.S. Into Israel-Iran War - Time Magazine",
      "pubDate": "Tue, 17 Jun 2025 09:51:16 GMT"
    },
    {
      "title": "Trump Calls on Tehran to ‘Evacuate’ as U.S. Deploys ‘Defensive’ Forces to Middle East - Time Magazine",
      "pubDate": "Tue, 17 Jun 2025 07:11:37 GMT"
    },
    {
      "title": "Trump mobile: Experts question claim gold phone can be made in US - BBC",
      "pubDate": "Tue, 17 Jun 2025 10:34:12 GMT"
    },
    {
      "title": "Israel-Iran latest: Trump calls on Iran to ‘give up’ and denies pursuing ceasefire - Financial Times",
      "pubDate": "Tue, 17 Jun 2025 12:44:50 GMT"
    },
    {
      "title": "Live updates: Trump weighs U.S. involvement as Iran and Israel trade strikes - The Washington Post",
      "pubDate": "Tue, 17 Jun 2025 16:16:02 GMT"
    },
    {
      "title": "Companies ask Supreme Court to quickly hear Trump tariffs challenge - NBC News",
      "pubDate": "Tue, 17 Jun 2025 17:31:00 GMT"
    },
    {
      "title": "Trump or AOC? Who do Americans prefer? A new poll tells the tale - MassLive",
      "pubDate": "Tue, 17 Jun 2025 14:54:00 GMT"
    },
    {
      "title": "Donald Trump’s abrupt G7 exit causes disquiet among other leaders - Financial Times",
      "pubDate": "Tue, 17 Jun 2025 19:12:11 GMT"
    },
    {
      "title": "Israel-Iran live updates: Trump calls for Iran's 'UNCONDITIONAL SURRENDER' and calls Khamenei 'easy target' - ABC News",
      "pubDate": "Tue, 17 Jun 2025 20:49:00 GMT"
    },
    {
      "title": "Trump weighs potential U.S. military strike on Iran, demands ‘unconditional surrender’ - CNBC",
      "pubDate": "Tue, 17 Jun 2025 16:36:10 GMT"
    },
    {
      "title": "Appeals court seems poised to side with Trump on National Guard deployment in L.A. - Politico",
      "pubDate": "Tue, 17 Jun 2025 22:33:57 GMT"
    },
    {
      "title": "Intense Israeli strikes hit Tehran after Trump demands ‘unconditional surrender’ - AP News",
      "pubDate": "Wed, 18 Jun 2025 02:20:00 GMT"
    },
    {
      "title": "Trump administration demands action from 36 countries to avoid travel ban - AP News",
      "pubDate": "Tue, 17 Jun 2025 21:52:00 GMT"
    },
    {
      "title": "Trump speaks with Netanyahu after crucial meeting on Israel-Iran war - Axios",
      "pubDate": "Tue, 17 Jun 2025 22:50:28 GMT"
    },
    {
      "title": "Trump brushes off US intel reports on Iran to align himself with Israel - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 19:22:00 GMT"
    },
    {
      "title": "NAACP won't invite Trump to its national convention, breaking a 116-year tradition - NPR",
      "pubDate": "Tue, 17 Jun 2025 22:33:04 GMT"
    },
    {
      "title": "Trump considers joining Israel on Iran strikes as IDF targets nuclear sites - BBC",
      "pubDate": "Wed, 18 Jun 2025 08:49:54 GMT"
    },
    {
      "title": "Trump confronts rare MAGA purity tests on Iran and immigration - Axios",
      "pubDate": "Wed, 18 Jun 2025 09:21:46 GMT"
    },
    {
      "title": "Trump says 'we now have complete and total control of the skies over Iran' - NBC News",
      "pubDate": "Wed, 18 Jun 2025 05:31:00 GMT"
    },
    {
      "title": "Trump intensifies rhetoric toward Iran. And, U.S. street drug deaths rise - NPR",
      "pubDate": "Wed, 18 Jun 2025 11:09:11 GMT"
    },
    {
      "title": "Trump teases possible US strike as Iran supreme leader warns America: Live updates - USA Today",
      "pubDate": "Wed, 18 Jun 2025 14:37:30 GMT"
    },
    {
      "title": "Trump says 'stupid' Powell 'probably won't cut' rates when Fed meeting ends Wednesday - CNBC",
      "pubDate": "Wed, 18 Jun 2025 14:04:25 GMT"
    },
    {
      "title": "Trump administration live updates: Pete Hegseth faces Senate questions; Supreme Court upholds transgender care ban - NBC News",
      "pubDate": "Wed, 18 Jun 2025 16:30:54 GMT"
    },
    {
      "title": "Iran leader rejects Trump's demand for surrender; Trump says patience has run out - Reuters",
      "pubDate": "Wed, 18 Jun 2025 17:19:59 GMT"
    },
    {
      "title": "Trump says 'nobody knows' what he'll do as Iran warns the U.S. not to strike - NPR",
      "pubDate": "Wed, 18 Jun 2025 18:01:27 GMT"
    },
    {
      "title": "Watch: Trump installs enormous US flags at the White House - BBC",
      "pubDate": "Wed, 18 Jun 2025 18:42:28 GMT"
    },
    {
      "title": "Donald Trump edges closer to Iran strike as military assets move into position - Financial Times",
      "pubDate": "Wed, 18 Jun 2025 20:40:38 GMT"
    },
    {
      "title": "Trump and India's Modi split over U.S. role in Pakistan ceasefire - CNBC",
      "pubDate": "Wed, 18 Jun 2025 22:06:27 GMT"
    },
    {
      "title": "Appeals court says DOJ cannot represent Trump in appeal of E. Jean Carroll case - ABC News",
      "pubDate": "Wed, 18 Jun 2025 22:36:10 GMT"
    },
    {
      "title": "Trump privately approved attack plans for Iran pending final order, WSJ reports - Reuters",
      "pubDate": "Wed, 18 Jun 2025 21:22:42 GMT"
    },
    {
      "title": "Trump keeps world guessing about US military action against Iran - Reuters",
      "pubDate": "Thu, 19 Jun 2025 00:00:00 GMT"
    },
    {
      "title": "Tulsi Gabbard sidelined in Trump administration discussions on Israel and Iran - NBC News",
      "pubDate": "Thu, 19 Jun 2025 01:59:00 GMT"
    },
    {
      "title": "Trump faces uproar from MAGA base over possible Iran strike - Reuters",
      "pubDate": "Thu, 19 Jun 2025 01:09:00 GMT"
    },
    {
      "title": "Trump caution on Iran strike linked to doubts over ‘bunker buster’ bomb, officials say - The Guardian",
      "pubDate": "Thu, 19 Jun 2025 03:24:00 GMT"
    },
    {
      "title": "Trump approves Iran attack plan but has not made final decision, US media says - BBC",
      "pubDate": "Thu, 19 Jun 2025 04:02:42 GMT"
    },
    {
      "title": "Israel-Iran live updates: Iranian strike hits key hospital in southern Israel, IDF says - The Washington Post",
      "pubDate": "Thu, 19 Jun 2025 06:16:08 GMT"
    },
    {
      "title": "Trump weighs U.S. strike as Iran's supreme leader says the 'battle begins' - NBC News",
      "pubDate": "Thu, 19 Jun 2025 04:56:00 GMT"
    },
    {
      "title": "As Trump Considers Striking Iran, Russia Warns World Is ‘Millimeters’ Away From Nuclear Catastrophe - Time Magazine",
      "pubDate": "Thu, 19 Jun 2025 07:49:30 GMT"
    },
    {
      "title": "Trump hosts Pakistani army chief, disagrees with India over India-Pakistan war mediation - Reuters",
      "pubDate": "Thu, 19 Jun 2025 05:30:00 GMT"
    },
    {
      "title": "Trump embraces Pakistan: ‘Tactical romance’ or a new ‘inner circle’? - Al Jazeera",
      "pubDate": "Thu, 19 Jun 2025 09:54:11 GMT"
    },
    {
      "title": "Nato cuts back leaders’ summit to avoid Donald Trump walkout - Financial Times",
      "pubDate": "Thu, 19 Jun 2025 11:27:36 GMT"
    },
    {
      "title": "Lawrence: Donald Trump proves he’s the stupidest man in the Situation Room - MSNBC News",
      "pubDate": "Thu, 19 Jun 2025 03:24:24 GMT"
    },
    {
      "title": "Donald Trump Moves Closer to Bombing Iran - Newsweek",
      "pubDate": "Thu, 19 Jun 2025 09:08:19 GMT"
    },
    {
      "title": "Trump rips into 'too late' Jerome Powell after Fed holds rates steady - CNBC",
      "pubDate": "Thu, 19 Jun 2025 15:04:14 GMT"
    },
    {
      "title": "Trump gives TikTok 90 more days to avoid a US ban - Business Insider",
      "pubDate": "Thu, 19 Jun 2025 16:07:00 GMT"
    },
    {
      "title": "Trump faces mounting pressure at home and abroad as he weighs options on Iran - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Thu, 19 Jun 2025 16:41:10 GMT"
    }
  ],
  "russia": [
    {
      "title": "Ukraine drone attack on Russia’s Tatarstan region leaves at least 1 dead, 13 injured - ABC News",
      "pubDate": "Sun, 15 Jun 2025 16:09:51 GMT"
    },
    {
      "title": "Russia reports Ukrainian drone attack on drone factory in Tatarstan - The Kyiv Independent",
      "pubDate": "Sun, 15 Jun 2025 16:25:27 GMT"
    },
    {
      "title": "Russia attacks Kyiv Oblast with drones, injuring 1 - The Kyiv Independent",
      "pubDate": "Mon, 16 Jun 2025 00:10:01 GMT"
    },
    {
      "title": "Russia slowly restarts gas flows to Europe via TurkStream as maintenance nears completion - Reuters",
      "pubDate": "Mon, 16 Jun 2025 10:54:49 GMT"
    },
    {
      "title": "Russia Is Churning Out Attack Drones. Ukraine Is Feeling the Impact. - WSJ",
      "pubDate": "Mon, 16 Jun 2025 17:00:00 GMT"
    },
    {
      "title": "Russia gives North Korea plans for kamikaze drone being used by Iran - The Mirror US",
      "pubDate": "Mon, 16 Jun 2025 10:46:00 GMT"
    },
    {
      "title": "Trump hints at no more US sanctions on Russia at G7 summit - politico.eu",
      "pubDate": "Mon, 16 Jun 2025 22:07:29 GMT"
    },
    {
      "title": "Russia attacks Kyiv with waves of drones, missiles - Reuters",
      "pubDate": "Tue, 17 Jun 2025 02:36:00 GMT"
    },
    {
      "title": "Russian Drone and Missile Strikes on Kyiv Kill at Least 14 - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 05:18:21 GMT"
    },
    {
      "title": "Russia pummels Kyiv with drones and missiles, killing at least 15 - NPR",
      "pubDate": "Tue, 17 Jun 2025 09:31:32 GMT"
    },
    {
      "title": "Russia says Israeli attacks on Iran are illegal, notes Iran's commitment to NPT - Reuters",
      "pubDate": "Tue, 17 Jun 2025 19:40:41 GMT"
    },
    {
      "title": "North Korea will help Russia rebuild Kursk after Ukrainian incursion, Kim tells Putin ally - Reuters",
      "pubDate": "Tue, 17 Jun 2025 13:04:05 GMT"
    },
    {
      "title": "Oil Options More Bullish Than After Russia’s Invasion of Ukraine - Bloomberg.com",
      "pubDate": "Wed, 18 Jun 2025 02:07:00 GMT"
    },
    {
      "title": "North Korea Will Send 5,000 Workers to Russia, Kremlin Says - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 04:46:00 GMT"
    },
    {
      "title": "Israel Says It Hit Iranian Helicopters, Missile Infrastructure - WSJ",
      "pubDate": "Wed, 18 Jun 2025 15:13:00 GMT"
    },
    {
      "title": "Ukraine war briefing: Russia can defend itself, says Putin, as North Korea sends more soldiers - The Guardian",
      "pubDate": "Thu, 19 Jun 2025 00:19:00 GMT"
    },
    {
      "title": "Putin says Russia could help broker a deal between Iran and Israel - AP News",
      "pubDate": "Thu, 19 Jun 2025 03:24:00 GMT"
    }
  ],
  "ai_safety": [
    {
      "title": "New York State passes RAISE Act for frontier AI models - The Economic Times",
      "pubDate": "Sun, 15 Jun 2025 11:47:22 GMT"
    },
    {
      "title": "NY Senate Passes RAISE Act for AI Safety Safeguards - WebProNews",
      "pubDate": "Sun, 15 Jun 2025 22:30:09 GMT"
    },
    {
      "title": "New York passes AI safety bill to prevent \"catastrophic risks to humanity\" - The Daily Star",
      "pubDate": "Mon, 16 Jun 2025 08:18:04 GMT"
    },
    {
      "title": "What is 'red teaming' and how can it lead to safer AI? - The World Economic Forum",
      "pubDate": "Mon, 16 Jun 2025 11:49:07 GMT"
    },
    {
      "title": "Shaping AI Standards to Protect America’s Most Vulnerable: Tech Innovators - Tech Policy Press",
      "pubDate": "Mon, 16 Jun 2025 14:53:48 GMT"
    },
    {
      "title": "New York may soon require AI giants to publish safety protocols before releasing LLMs - the-decoder.com",
      "pubDate": "Mon, 16 Jun 2025 15:27:49 GMT"
    },
    {
      "title": "AI Accountability Takes Center Stage as New York Approves RAISE Act - eWEEK",
      "pubDate": "Mon, 16 Jun 2025 19:26:24 GMT"
    },
    {
      "title": "AI safety bills await Hochul’s signature - NEWS10 ABC",
      "pubDate": "Mon, 16 Jun 2025 20:59:49 GMT"
    },
    {
      "title": "G7 skirts touchy AI safety discussion - politico.eu",
      "pubDate": "Mon, 16 Jun 2025 22:41:00 GMT"
    },
    {
      "title": "AI Nuclear Risk Alert: SIPRI Warns Against Automating Nuclear Weapons with AI - Deccan Herald",
      "pubDate": "Tue, 17 Jun 2025 09:53:32 GMT"
    },
    {
      "title": "New York takes first steps to regulate large AI developers - Times Union",
      "pubDate": "Tue, 17 Jun 2025 21:21:36 GMT"
    },
    {
      "title": "AI in Safety: From Hype to Real-World Impact - ohsonline.com",
      "pubDate": "Tue, 17 Jun 2025 13:21:36 GMT"
    },
    {
      "title": "Experts warn AI bias could undermine safety and security - Adomonline.com",
      "pubDate": "Wed, 18 Jun 2025 17:16:23 GMT"
    },
    {
      "title": "OpenAI warns models with higher bioweapons risk are imminent - Axios",
      "pubDate": "Wed, 18 Jun 2025 17:03:34 GMT"
    },
    {
      "title": "Pope Leo delivers grim warning about AI's threat to 'human dignity' - New York Post",
      "pubDate": "Wed, 18 Jun 2025 18:56:00 GMT"
    },
    {
      "title": "Google Opens Cybersecurity and AI Safety Hub in Hyderabad - Equitypandit",
      "pubDate": "Wed, 18 Jun 2025 13:33:31 GMT"
    },
    {
      "title": "VivaTech 2025: Quantum safety, robotic hands and AI beauty - TechInformed",
      "pubDate": "Wed, 18 Jun 2025 19:32:23 GMT"
    },
    {
      "title": "The OpenAI Files: Ex-staff claim profit greed betraying AI safety - AI News",
      "pubDate": "Thu, 19 Jun 2025 11:13:44 GMT"
    }
  ],
  "financial_markets": [
    {
      "title": "Oil prices jump more than 3%, adding to last week's surge, as Israel strikes Iran energy facilities - CNBC",
      "pubDate": "Sun, 15 Jun 2025 22:10:10 GMT"
    },
    {
      "title": "Federal Reserve Likely to Maintain Interest Rates Amid Economic Uncertainty - Binance",
      "pubDate": "Mon, 16 Jun 2025 00:13:41 GMT"
    },
    {
      "title": "Stock markets are ignoring the war as they wait for the Fed - Fortune",
      "pubDate": "Mon, 16 Jun 2025 10:50:00 GMT"
    },
    {
      "title": "Investors Brace for Oil Market Fallout From Israel and Iran’s Fight - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 12:08:37 GMT"
    },
    {
      "title": "Oil Turns Lower With Iran-Israel Attacks Sparing Flows So Far - Yahoo Finance",
      "pubDate": "Mon, 16 Jun 2025 12:26:30 GMT"
    },
    {
      "title": "Stocks Rise as Fear of All-Out Mideast War Eases: Markets Wrap - Yahoo Finance",
      "pubDate": "Mon, 16 Jun 2025 19:15:53 GMT"
    },
    {
      "title": "Global markets recover on Iran ceasefire reports, central banks in focus - Reuters",
      "pubDate": "Mon, 16 Jun 2025 19:25:01 GMT"
    },
    {
      "title": "Bitcoin production costs up 9% on higher hashrate, energy prices - Cointelegraph",
      "pubDate": "Tue, 17 Jun 2025 01:57:46 GMT"
    },
    {
      "title": "Banks boosted fossil fuel finance by more than a fifth in 2024, report says - Financial Times",
      "pubDate": "Tue, 17 Jun 2025 04:00:37 GMT"
    },
    {
      "title": "Middle East tensions unnerve investors, boost oil prices - Reuters",
      "pubDate": "Tue, 17 Jun 2025 14:47:00 GMT"
    },
    {
      "title": "Federal Reserve is poised to hold interest rates steady despite pressure from Trump - USA Today",
      "pubDate": "Tue, 17 Jun 2025 19:45:14 GMT"
    },
    {
      "title": "Stock futures are little changed ahead of the Federal Reserve’s rate decision: Live updates - CNBC",
      "pubDate": "Wed, 18 Jun 2025 00:21:00 GMT"
    },
    {
      "title": "Looming decisions about interest rates from the Federal Reserve - WRTV",
      "pubDate": "Wed, 18 Jun 2025 03:00:40 GMT"
    },
    {
      "title": "Senate Stablecoin Win Fails to Boost Cryptos. Why Bitcoin Price Is Down Today. - Barron's",
      "pubDate": "Wed, 18 Jun 2025 09:27:00 GMT"
    },
    {
      "title": "Dow posts narrow loss after Fed signals it’s in no hurry to cut rates: Live updates - CNBC",
      "pubDate": "Wed, 18 Jun 2025 20:14:55 GMT"
    },
    {
      "title": "M&A market 'back to global financial crisis levels,' UN trade arm warns in downbeat economic outlook - CNBC",
      "pubDate": "Thu, 19 Jun 2025 10:30:01 GMT"
    }
  ],
  "artificial_intelligence": [
    {
      "title": "AI race between US and China resembles Cold War — Marc Andreessen - TradingView",
      "pubDate": "Sun, 15 Jun 2025 21:49:31 GMT"
    },
    {
      "title": "Sam Altman: We've reached the 'singularity' moment in artificial intelligence - PANews",
      "pubDate": "Mon, 16 Jun 2025 01:39:13 GMT"
    },
    {
      "title": "EU’s waffle on artificial intelligence law creates huge headache - politico.eu",
      "pubDate": "Mon, 16 Jun 2025 02:34:46 GMT"
    },
    {
      "title": "Alabama educators to learn all about artificial intelligence during ‘Day of AI’ - WKRG",
      "pubDate": "Mon, 16 Jun 2025 00:03:55 GMT"
    },
    {
      "title": "Even smart manufacturing needs agentic AI - ET CIO",
      "pubDate": "Mon, 16 Jun 2025 03:53:08 GMT"
    },
    {
      "title": "Artificial Intelligence Systems Spending Market to Reach US$ 1,600.4 Bn by 2031 Driven by Rapid Enterprise Adoption - openPR.com",
      "pubDate": "Mon, 16 Jun 2025 06:09:15 GMT"
    },
    {
      "title": "Workplace Artificial Intelligence Use Has Doubled in Two Years - Bloomberg Law News",
      "pubDate": "Mon, 16 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Everyone Is Using A.I. for Everything. Is That Bad? - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 09:01:08 GMT"
    },
    {
      "title": "Artificial intelligence and legislation: The latest in Minnesota - MPR News",
      "pubDate": "Mon, 16 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Truly Intelligent AI Could Play by the Rules, No Matter How Strange - Scientific American",
      "pubDate": "Mon, 16 Jun 2025 11:30:00 GMT"
    },
    {
      "title": "AI Stocks Face 'Show Me' Moment: Meta, Nvidia, CoreWeave Flex Muscles - Investor's Business Daily",
      "pubDate": "Mon, 16 Jun 2025 11:25:00 GMT"
    },
    {
      "title": "Why AI has a big branding problem - Fast Company",
      "pubDate": "Mon, 16 Jun 2025 11:09:02 GMT"
    },
    {
      "title": "California’s ‘No Robo Bosses Act’ advances, taking aim at artificial intelligence in the workplace - The Mercury News",
      "pubDate": "Mon, 16 Jun 2025 11:00:47 GMT"
    },
    {
      "title": "Artificial Intelligence Helps Make Titanium More Useful - Assembly Magazine",
      "pubDate": "Mon, 16 Jun 2025 15:30:00 GMT"
    },
    {
      "title": "OpenAI CFO Says ‘Secret’ Device to Usher in New Computing Era - PYMNTS.com",
      "pubDate": "Mon, 16 Jun 2025 11:01:20 GMT"
    },
    {
      "title": "OpenAI wins $200 million US defense contract - Reuters",
      "pubDate": "Mon, 16 Jun 2025 22:39:42 GMT"
    },
    {
      "title": "Generative AI in universities: Grades up, signals down, skills in flux - CEPR",
      "pubDate": "Mon, 16 Jun 2025 23:04:34 GMT"
    },
    {
      "title": "Physicists crack key puzzle in pursuit of limitless energy device: 'We've achieved sustained reactions' - The Cool Down",
      "pubDate": "Mon, 16 Jun 2025 23:15:00 GMT"
    },
    {
      "title": "Engaging Wimbledon fans in real time with IBM watsonx - IBM",
      "pubDate": "Tue, 17 Jun 2025 04:26:43 GMT"
    },
    {
      "title": "Optimized Artificial Intelligence Explains ChatGPT’s Shopping Shift - FinancialContent",
      "pubDate": "Mon, 16 Jun 2025 23:43:00 GMT"
    },
    {
      "title": "Artificial intelligence-derived retinal age gap as a marker for reproductive aging in women - Nature",
      "pubDate": "Mon, 16 Jun 2025 23:01:01 GMT"
    },
    {
      "title": "AI Chip Stocks Advance Amid Higher Market Estimates - Investor's Business Daily",
      "pubDate": "Mon, 16 Jun 2025 20:54:00 GMT"
    },
    {
      "title": "Dueling Billionaires: Artificial Intelligence (AI) Stock Nvidia Is Israel Englander's Largest Stock Holding, but Philippe Laffont Has Sold Shares for 8 Consecutive Quarters - Yahoo Finance",
      "pubDate": "Tue, 17 Jun 2025 07:51:00 GMT"
    },
    {
      "title": "Nvidia Stock Slips. How Big Its AI Chip Market Could Get. - Barron's",
      "pubDate": "Tue, 17 Jun 2025 09:40:00 GMT"
    },
    {
      "title": "Hurricanes and sandstorms can be forecast 5,000 times faster thanks to new Microsoft AI model - Live Science",
      "pubDate": "Tue, 17 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Oracle’s $116 Billion Surge Leaves Little Room for Error on AI - Bloomberg",
      "pubDate": "Tue, 17 Jun 2025 12:05:58 GMT"
    },
    {
      "title": "How Israel used spies, smuggled drones and AI to stun and hobble Iran - The Washington Post",
      "pubDate": "Tue, 17 Jun 2025 13:12:21 GMT"
    },
    {
      "title": "Artificial intelligence may cause mass unemployment, says Geoffrey Hinton; 'Godfather of AI' reveals 'safe' jobs - Mint",
      "pubDate": "Tue, 17 Jun 2025 14:04:12 GMT"
    },
    {
      "title": "NAACP files intent to sue Elon Musk’s xAI company over supercomputer air pollution - AP News",
      "pubDate": "Tue, 17 Jun 2025 15:29:00 GMT"
    },
    {
      "title": "California is trying to regulate its AI giants — again - The Verge",
      "pubDate": "Tue, 17 Jun 2025 16:07:48 GMT"
    },
    {
      "title": "AI Reveals Key Predictors of Lifelong Brain Health - Neuroscience News",
      "pubDate": "Tue, 17 Jun 2025 13:51:24 GMT"
    },
    {
      "title": "Amazon CEO says AI will mean fewer jobs at the company. Here’s his advice on how people can keep theirs. - MarketWatch",
      "pubDate": "Tue, 17 Jun 2025 22:23:00 GMT"
    },
    {
      "title": "Amazon CEO says AI agents will soon reduce company's corporate workforce - CBS News",
      "pubDate": "Tue, 17 Jun 2025 21:28:45 GMT"
    },
    {
      "title": "OpenAI wins $200m contract with US military for ‘warfighting’ - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 16:29:00 GMT"
    },
    {
      "title": "Cloud Security Alliance launches pledge for responsible AI use - SecurityBrief Australia",
      "pubDate": "Wed, 18 Jun 2025 01:26:00 GMT"
    },
    {
      "title": "Amazon expects to cut corporate jobs as it relies more on AI - NBC News",
      "pubDate": "Tue, 17 Jun 2025 18:32:28 GMT"
    },
    {
      "title": "Amazon CEO tells employees that AI will shrink its workforce - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 04:12:15 GMT"
    },
    {
      "title": "Big Tech pushes for 10-year ban on US states regulating AI - Financial Times",
      "pubDate": "Wed, 18 Jun 2025 04:00:43 GMT"
    },
    {
      "title": "Amazon CEO Says AI Will Lead to Smaller Workforce - WSJ",
      "pubDate": "Tue, 17 Jun 2025 20:53:00 GMT"
    },
    {
      "title": "Google launches production-ready Gemini 2.5 AI models to challenge OpenAI's enterprise dominance - VentureBeat",
      "pubDate": "Tue, 17 Jun 2025 21:55:56 GMT"
    },
    {
      "title": "Sam Altman Says Meta Offered OpenAI Staffers $100 Million Bonuses - Bloomberg.com",
      "pubDate": "Tue, 17 Jun 2025 23:14:12 GMT"
    },
    {
      "title": "OpenAI boss: Meta offering $100m plus to poach my staff - BBC",
      "pubDate": "Wed, 18 Jun 2025 10:33:04 GMT"
    },
    {
      "title": "Amazon boss tells staff AI means their jobs are at risk in coming years - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 08:12:00 GMT"
    },
    {
      "title": "Students aren't cheating because they have AI, but because colleges are broken | Opinion - Cincinnati Enquirer",
      "pubDate": "Wed, 18 Jun 2025 14:45:24 GMT"
    },
    {
      "title": "Scientists make mind-blowing discovery after studying material that only exists exists for billionths of a second: 'Previously unimaginable' - The Cool Down",
      "pubDate": "Wed, 18 Jun 2025 11:00:02 GMT"
    },
    {
      "title": "China Now Sells Half of the World’s EVs—Here’s Why It Matters - MSN",
      "pubDate": "Wed, 18 Jun 2025 12:20:10 GMT"
    },
    {
      "title": "Trend Micro Teams Up With Dell and NVIDIA to Transform Enterprise Security with New AI Factory - Stock Titan",
      "pubDate": "Wed, 18 Jun 2025 12:00:00 GMT"
    },
    {
      "title": "Preparing for future AI capabilities in biology - OpenAI",
      "pubDate": "Wed, 18 Jun 2025 17:16:03 GMT"
    },
    {
      "title": "MS partnering with NVIDIA to spread AI to classrooms throughout state - The Clarion-Ledger",
      "pubDate": "Wed, 18 Jun 2025 22:11:17 GMT"
    },
    {
      "title": "Amazon CEO Andy Jassy says company will cut jobs amid AI boom. It's already happening at Microsoft. - Yahoo Finance",
      "pubDate": "Wed, 18 Jun 2025 22:23:04 GMT"
    },
    {
      "title": "Apple eyes using AI to design its chips, technology executive says - Reuters",
      "pubDate": "Wed, 18 Jun 2025 23:16:23 GMT"
    },
    {
      "title": "Artificial intelligence: TD survey reveals confidence gap - TD Bank",
      "pubDate": "Wed, 18 Jun 2025 18:49:20 GMT"
    },
    {
      "title": "OpenAI's Sam Altman Discusses Upcoming Innovations and AGI Goals - Binance",
      "pubDate": "Thu, 19 Jun 2025 01:33:49 GMT"
    },
    {
      "title": "Margaret Mitchell: artificial general intelligence is ‘just vibes and snake oil’ - Financial Times",
      "pubDate": "Thu, 19 Jun 2025 04:00:09 GMT"
    },
    {
      "title": "Why Big Tech cannot agree on artificial general intelligence - Financial Times",
      "pubDate": "Thu, 19 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "US Seizes $225.3 Million in Cryptocurrency Tied to Investment Fraud Schemes - PYMNTS.com",
      "pubDate": "Thu, 19 Jun 2025 01:07:30 GMT"
    },
    {
      "title": "Recent college graduates face challenging job market due to artificial intelligence - kark.com",
      "pubDate": "Wed, 18 Jun 2025 23:36:17 GMT"
    },
    {
      "title": "Can A.I. Quicken the Pace of Math Discoveries? - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 09:02:06 GMT"
    },
    {
      "title": "Decoding the interactions and functions of non-coding RNA with artificial intelligence - Nature",
      "pubDate": "Thu, 19 Jun 2025 09:37:20 GMT"
    },
    {
      "title": "He’s the godfather of AI. Now, he has a bold new plan to keep us safe from it. - vox.com",
      "pubDate": "Thu, 19 Jun 2025 11:30:00 GMT"
    },
    {
      "title": "OpenAI warns its future models will have a higher risk of aiding bioweapons development - Fortune",
      "pubDate": "Thu, 19 Jun 2025 11:35:00 GMT"
    },
    {
      "title": "Artificial Intelligence Market Size Worth USD 3,680.47 Bn By 2034 - Yahoo",
      "pubDate": "Thu, 19 Jun 2025 15:41:00 GMT"
    }
  ],
  "climate": [
    {
      "title": "Ukraine war pumps 180M tons of CO2 into atmosphere, causing $33B in damage - Ukrainian climatologist - RBC-Ukraine",
      "pubDate": "Sun, 15 Jun 2025 17:40:00 GMT"
    },
    {
      "title": "How Trump’s assault on science is blinding America to climate change - E&E News by POLITICO",
      "pubDate": "Mon, 16 Jun 2025 10:22:00 GMT"
    },
    {
      "title": "Global warming may increase the burden of obstructive sleep apnea - Nature",
      "pubDate": "Mon, 16 Jun 2025 09:58:16 GMT"
    },
    {
      "title": "Senate Proposal Ends Tax Cuts for Clean Energy, Disappointing Climate Advocates - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 02:54:32 GMT"
    },
    {
      "title": "Scientists looked back in time to find the first signs of human-caused global warming. It’s far earlier than previously thought - CNN",
      "pubDate": "Mon, 16 Jun 2025 19:01:00 GMT"
    },
    {
      "title": "Climate crisis could hit yields of key crops even if farmers adapt, study finds - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 16:20:00 GMT"
    },
    {
      "title": "Scientists warn that greenhouse gas accumulation is accelerating and more extreme weather will come - AP News",
      "pubDate": "Wed, 18 Jun 2025 22:04:00 GMT"
    },
    {
      "title": "Impacts of climate change on global agriculture accounting for adaptation - Nature",
      "pubDate": "Wed, 18 Jun 2025 15:24:47 GMT"
    },
    {
      "title": "The $1 Trillion Climate Problem​ Republicans Are Ignoring - The New Republic",
      "pubDate": "Thu, 19 Jun 2025 09:55:00 GMT"
    }
  ],
  "ukraine": [
    {
      "title": "Russia says it struck oil refinery that supplies Ukrainian army with fuel - Reuters",
      "pubDate": "Sun, 15 Jun 2025 20:14:36 GMT"
    },
    {
      "title": "Russian Offensive Campaign Assessment, June 15, 2025 - Institute for the Study of War",
      "pubDate": "Sun, 15 Jun 2025 20:31:08 GMT"
    },
    {
      "title": "Ukraine war briefing: Russian drone factory attacked, 1,000km away in Tatarstan - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 01:02:00 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Kyiv attacks Russian drone factory while EU calls for tougher sanctions on Moscow - The Independent",
      "pubDate": "Mon, 16 Jun 2025 06:07:00 GMT"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,208 - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 07:22:35 GMT"
    },
    {
      "title": "Ukrainian drones destroy Russian air defense systems in occupied Zaporizhzhia Oblast, military intelligence says - The Kyiv Independent",
      "pubDate": "Mon, 16 Jun 2025 17:49:38 GMT"
    },
    {
      "title": "Russia and Ukraine fulfil deal to repatriate dead soldiers - BBC",
      "pubDate": "Mon, 16 Jun 2025 17:54:49 GMT"
    },
    {
      "title": "At least 14 die in Russian strikes on Kyiv in ‘one of most horrific attacks’ of Ukraine war – Europe live - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 07:26:29 GMT"
    },
    {
      "title": "Russia's deadliest attack on Kyiv for months flattens part of apartment block - BBC",
      "pubDate": "Tue, 17 Jun 2025 15:14:36 GMT"
    },
    {
      "title": "Ukraine war live: Putin accused of ‘pure terrorism’ after devastating attack on Kyiv - The Independent",
      "pubDate": "Tue, 17 Jun 2025 15:52:02 GMT"
    },
    {
      "title": "Overnight Russian attack on Ukraine kills 15 and injures 156 - AP News",
      "pubDate": "Tue, 17 Jun 2025 16:26:00 GMT"
    },
    {
      "title": "16 killed in deadliest Russian strikes on Kyiv in almost a year - CNN",
      "pubDate": "Tue, 17 Jun 2025 20:55:00 GMT"
    },
    {
      "title": "Russia hits Kyiv with deadliest attack of the year, G-7 avoids talk of Ukraine - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 08:14:48 GMT"
    },
    {
      "title": "Putin says he's ready to meet Zelensky if West 'stops pushing' Ukraine to fight - The Kyiv Independent",
      "pubDate": "Wed, 18 Jun 2025 22:27:26 GMT"
    },
    {
      "title": "Russia just accidentally admitted to its staggering troop losses in Ukraine - The Kyiv Independent",
      "pubDate": "Thu, 19 Jun 2025 10:26:35 GMT"
    }
  ],
  "us_economy": [
    {
      "title": "Fed on Hold Leaves Wall Street Asking What It Will Take to Cut Interest Rates - Bloomberg",
      "pubDate": "Sun, 15 Jun 2025 19:00:00 GMT"
    },
    {
      "title": "Fed interest rate decision looms as battle over cuts takes surprising turn - TheStreet",
      "pubDate": "Sun, 15 Jun 2025 14:51:38 GMT"
    },
    {
      "title": "Trump's investment claims - are tariffs boosting the US economy? - BBC",
      "pubDate": "Mon, 16 Jun 2025 00:44:27 GMT"
    },
    {
      "title": "U.S. could lose more immigrants than it gains for first time in 50 years - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 23:51:57 GMT"
    },
    {
      "title": "Oil price rise risks ‘adverse shock’ to global economy – business live - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 06:27:00 GMT"
    },
    {
      "title": "US Economy To Face 'Pretty Limited' Impact From Israel-Iran Airstrikes, With Only A 'Tiny Bit' Recession Risk, Say Economists - Benzinga",
      "pubDate": "Mon, 16 Jun 2025 08:32:41 GMT"
    },
    {
      "title": "Investors shun long-term US bonds as hopes for aggressive Fed rate cuts fade - Reuters",
      "pubDate": "Mon, 16 Jun 2025 10:14:35 GMT"
    },
    {
      "title": "Economic anxiety: How sectors of Wisconsin's economy that affect everyday lives are faring - Milwaukee Journal Sentinel",
      "pubDate": "Mon, 16 Jun 2025 10:07:25 GMT"
    },
    {
      "title": "The economic outlook is back to square one, despite months of upheaval - Axios",
      "pubDate": "Mon, 16 Jun 2025 16:20:55 GMT"
    },
    {
      "title": "Why markets are ignoring scary headlines about Iran, trade wars and U.S. debt - MarketWatch",
      "pubDate": "Mon, 16 Jun 2025 15:49:00 GMT"
    },
    {
      "title": "How the Federal Reserve Affects Mortgage Rates — and What It Means for Homebuyers in 2025 - Kiplinger",
      "pubDate": "Mon, 16 Jun 2025 17:39:35 GMT"
    },
    {
      "title": "Senate Republicans Release Revised Tax Cuts and Debt Limit Bill - Yahoo Finance",
      "pubDate": "Mon, 16 Jun 2025 23:31:03 GMT"
    },
    {
      "title": "Judge deems Trump's cuts to National Institutes of Health illegal - NBC News",
      "pubDate": "Mon, 16 Jun 2025 21:05:29 GMT"
    },
    {
      "title": "US Fed Rate Decision: What to Expect on June 18 - Morningstar",
      "pubDate": "Tue, 17 Jun 2025 07:28:00 GMT"
    },
    {
      "title": "Fed’s ‘Wait and See’ Approach Is Intact as New Risks Cloud Economic Outlook - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 11:31:33 GMT"
    },
    {
      "title": "US retail sales post biggest drop in four months - Reuters",
      "pubDate": "Tue, 17 Jun 2025 13:44:14 GMT"
    },
    {
      "title": "The US economy is in a good place, but the Federal Reserve is not - AP News",
      "pubDate": "Tue, 17 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "The Fed is set to make its next rate decision on Wednesday. Here's what to expect. - CBS News",
      "pubDate": "Tue, 17 Jun 2025 15:42:59 GMT"
    },
    {
      "title": "Managers bullish as fears about trade war, recession abate — BofA survey - Pensions & Investments",
      "pubDate": "Tue, 17 Jun 2025 21:30:56 GMT"
    },
    {
      "title": "Oil prices spike, US stocks fall on Israel-Iran crisis - Al Jazeera",
      "pubDate": "Wed, 18 Jun 2025 03:11:15 GMT"
    },
    {
      "title": "US electric vehicle registrations decline due to concerns over infrastructure and subsidies - digitimes",
      "pubDate": "Wed, 18 Jun 2025 02:02:15 GMT"
    },
    {
      "title": "Stocks slump and oil prices jump as Trump urges Iran's unconditional surrender - The Press Democrat",
      "pubDate": "Tue, 17 Jun 2025 22:18:44 GMT"
    },
    {
      "title": "US Economy Tension: Trump’s Immigration Crackdown Exposes Labor Dependence, Policy Flip-Flops - Deccan Herald",
      "pubDate": "Wed, 18 Jun 2025 05:59:00 GMT"
    },
    {
      "title": "Fed expected to hold interest rates steady, defying Trump - ABC7 Chicago",
      "pubDate": "Wed, 18 Jun 2025 11:48:05 GMT"
    },
    {
      "title": "Banks face rising risks from climate lawsuits - Financial Times",
      "pubDate": "Wed, 18 Jun 2025 11:00:49 GMT"
    },
    {
      "title": "Cloudy with a chance of showers? All eyes on Fed's economic forecast today - NPR",
      "pubDate": "Wed, 18 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "US Stocks Rise as Investors Await Federal Reserve Rate Decision - Bloomberg.com",
      "pubDate": "Wed, 18 Jun 2025 13:44:05 GMT"
    },
    {
      "title": "US Fed Meeting LIVE: US stocks trade higher ahead of Federal Reserve policy verdict amid Israel-Iran tensions - Mint",
      "pubDate": "Wed, 18 Jun 2025 16:16:48 GMT"
    },
    {
      "title": "Federal Reserve holds its benchmark interest rate steady at today's FOMC meeting - CBS News",
      "pubDate": "Wed, 18 Jun 2025 18:11:52 GMT"
    },
    {
      "title": "Federal Reserve holds interest rates, defying Trump’s demand to lower them - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 18:19:00 GMT"
    },
    {
      "title": "The Fed Is Waiting Until the Whites of Recession’s Eyes - Bloomberg",
      "pubDate": "Wed, 18 Jun 2025 18:55:10 GMT"
    },
    {
      "title": "Federal Reserve holds interest rates steady amid tariff uncertainty - MSNBC News",
      "pubDate": "Wed, 18 Jun 2025 20:15:00 GMT"
    },
    {
      "title": "US stocks close mostly lower with Fed on hold amid weakening economy - USA Today",
      "pubDate": "Wed, 18 Jun 2025 15:15:08 GMT"
    },
    {
      "title": "Social Security fund could run dry ahead of earlier forecast, trustees say - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 23:11:27 GMT"
    },
    {
      "title": "Fed fears the US economy is heading for stagflation, strategist says - Fox Business",
      "pubDate": "Wed, 18 Jun 2025 20:18:15 GMT"
    },
    {
      "title": "Social Security Benefits Could Be Cut in 8 Years Unless Congress Acts - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 03:49:12 GMT"
    },
    {
      "title": "The Fed cuts US economic outlook - Financial Times",
      "pubDate": "Thu, 19 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Top economist warns America is heading toward economic disaster the Fed can't fix - Fox Business",
      "pubDate": "Wed, 18 Jun 2025 22:25:00 GMT"
    },
    {
      "title": "Fed begins policy meeting amid Middle East tensions and slowing US economy - MSN",
      "pubDate": "Thu, 19 Jun 2025 10:44:35 GMT"
    },
    {
      "title": "Stocks Slide on Mideast Tension, Fed’s Warning: Markets Wrap - Bloomberg",
      "pubDate": "Thu, 19 Jun 2025 10:22:04 GMT"
    },
    {
      "title": "Fed decision live: Powell cites Trump tariff impacts as rates held steady - Reuters",
      "pubDate": "Thu, 19 Jun 2025 10:39:02 GMT"
    },
    {
      "title": "America’s economy could face a war shock - CNN",
      "pubDate": "Thu, 19 Jun 2025 14:55:00 GMT"
    }
  ],
  "china": [
    {
      "title": "China May retail sales grow at fastest pace since December 2023; industrial output misses expectations - CNBC",
      "pubDate": "Mon, 16 Jun 2025 02:11:00 GMT"
    },
    {
      "title": "China adds 100 nuclear warheads in past year, report shows - Nikkei Asia",
      "pubDate": "Sun, 15 Jun 2025 22:28:00 GMT"
    },
    {
      "title": "China Retail Sales Jump Most Since 2023 in Relief From Tariffs - Bloomberg",
      "pubDate": "Mon, 16 Jun 2025 02:57:00 GMT"
    },
    {
      "title": "China Cuts Steel Output as Beijing’s Curbs Start to Take Effect - Bloomberg",
      "pubDate": "Mon, 16 Jun 2025 03:07:14 GMT"
    },
    {
      "title": "China’s nuclear stockpile is growing ‘faster than any other country’: SIPRI - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 22:00:18 GMT"
    },
    {
      "title": "China's May factory output slows, retail sales surprisingly upbeat - Reuters",
      "pubDate": "Mon, 16 Jun 2025 02:08:00 GMT"
    },
    {
      "title": "China's factories slow, consumers unexpectedly perk up - Reuters",
      "pubDate": "Mon, 16 Jun 2025 11:16:34 GMT"
    },
    {
      "title": "Is more than trade on the table after US-China talks in London? - South China Morning Post",
      "pubDate": "Mon, 16 Jun 2025 12:01:54 GMT"
    },
    {
      "title": "China’s aircraft carriers send message in the open Pacific for the first time – and bigger and more powerful ships are coming - CNN",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "China Reviews Impact of US Data Curbs Due to Trump’s Budget Cuts - Bloomberg.com",
      "pubDate": "Mon, 16 Jun 2025 12:07:02 GMT"
    },
    {
      "title": "Italy regulator opens probe into China's DeepSeek - Reuters",
      "pubDate": "Mon, 16 Jun 2025 16:25:31 GMT"
    },
    {
      "title": "China’s Xi Jinping meets Central Asian leaders: Why their summit matters - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 14:38:28 GMT"
    },
    {
      "title": "US pushes Vietnam to decouple from Chinese tech, sources say - Reuters",
      "pubDate": "Mon, 16 Jun 2025 16:21:29 GMT"
    },
    {
      "title": "US pharma bets big on China to snap up potential blockbuster drugs - Reuters",
      "pubDate": "Mon, 16 Jun 2025 15:26:40 GMT"
    },
    {
      "title": "China proposes shorter clinical trial reviews in efforts to accelerate drug development - Fierce Biotech",
      "pubDate": "Mon, 16 Jun 2025 21:30:32 GMT"
    },
    {
      "title": "Chinese embassy in Israel urges citizens to leave - Reuters",
      "pubDate": "Tue, 17 Jun 2025 00:10:37 GMT"
    },
    {
      "title": "China Is Unleashing a New Export Shock on the World - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 04:00:10 GMT"
    },
    {
      "title": "China stockpiling nuclear warheads at fastest rate globally, new research shows - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 05:10:00 GMT"
    },
    {
      "title": "EU Refused Meeting With China on Lack of Trade Progress, FT Says - Bloomberg.com",
      "pubDate": "Tue, 17 Jun 2025 05:38:00 GMT"
    },
    {
      "title": "Why It’s So Hard to Challenge Challenge China’s Rare Earths Dominance - Time Magazine",
      "pubDate": "Tue, 17 Jun 2025 07:06:19 GMT"
    },
    {
      "title": "China’s state security agency warns of phishing emails sent by foreign spies - South China Morning Post",
      "pubDate": "Tue, 17 Jun 2025 08:07:03 GMT"
    },
    {
      "title": "Explosion at fireworks factory in southern China kills 9, injures 26 - Reuters",
      "pubDate": "Tue, 17 Jun 2025 09:05:01 GMT"
    },
    {
      "title": "China to nearly double nuclear power capacity by 2040 in rapid build-up - South China Morning Post",
      "pubDate": "Tue, 17 Jun 2025 11:30:10 GMT"
    },
    {
      "title": "China’s Spy Agencies Are Investing Heavily in A.I., Researchers Say - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 14:00:15 GMT"
    },
    {
      "title": "Iran reports major Israeli ‘cyber war’ as Tehran restricts internet for citizens - The Times of Israel",
      "pubDate": "Tue, 17 Jun 2025 17:21:29 GMT"
    },
    {
      "title": "China condemns US after plan to replace Huawei towers in Panama is unveiled - South China Morning Post",
      "pubDate": "Tue, 17 Jun 2025 21:40:18 GMT"
    },
    {
      "title": "FBI Raises 'Alarming' Claims of Chinese Interference in 2020 Election - Newsweek",
      "pubDate": "Tue, 17 Jun 2025 18:47:09 GMT"
    },
    {
      "title": "China Backs Iran in Fight Against Israel - Foreign Policy",
      "pubDate": "Tue, 17 Jun 2025 22:10:33 GMT"
    },
    {
      "title": "Malfunctions, overreactions and a steep learning curve: wargaming a Chinese attack on Taiwan - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 01:08:00 GMT"
    },
    {
      "title": "China Reacts to Trump Khamenei Threat - Newsweek",
      "pubDate": "Wed, 18 Jun 2025 07:38:11 GMT"
    },
    {
      "title": "IDF confirms drone shot down over Iran overnight, says no fear of information leaking - The Times of Israel",
      "pubDate": "Wed, 18 Jun 2025 08:29:46 GMT"
    },
    {
      "title": "China Lashes Out at G-7, Von der Leyen for Criticism of Policies - Bloomberg.com",
      "pubDate": "Wed, 18 Jun 2025 08:46:58 GMT"
    },
    {
      "title": "Aiming at the Dollar, China Makes a Pitch for Its Currency - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 08:05:11 GMT"
    },
    {
      "title": "North Korea's Kim met Russia's top security official, state media says - Reuters",
      "pubDate": "Wed, 18 Jun 2025 04:25:00 GMT"
    },
    {
      "title": "US-China Trade Truce Is a Cautionary Tale - Bloomberg",
      "pubDate": "Wed, 18 Jun 2025 10:00:39 GMT"
    },
    {
      "title": "Have China’s Carbon Emissions Finally Peaked? - Bloomberg",
      "pubDate": "Thu, 19 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "China has granted rare earth export licences to some firms, commerce ministry says - Reuters",
      "pubDate": "Thu, 19 Jun 2025 07:26:38 GMT"
    },
    {
      "title": "China's Housing Market Facing Long Slump - Newsweek",
      "pubDate": "Thu, 19 Jun 2025 10:13:28 GMT"
    },
    {
      "title": "China Is Hacking Russia to Steal War Secrets - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 09:01:07 GMT"
    },
    {
      "title": "China learned a valuable lesson in US trade talks: the value of its leverage - CNN",
      "pubDate": "Thu, 19 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "China floods Brazil with cheap EVs triggering backlash - Reuters",
      "pubDate": "Thu, 19 Jun 2025 10:02:25 GMT"
    },
    {
      "title": "China Goes on Diplomatic Offensive as Israel-Iran War Distracts America - Newsweek",
      "pubDate": "Thu, 19 Jun 2025 07:00:01 GMT"
    },
    {
      "title": "China has become the most important enabler of Russia’s war machine - The Economist",
      "pubDate": "Thu, 19 Jun 2025 12:57:40 GMT"
    }
  ],
  "world_news": [
    {
      "title": "Israel-Iran battle escalates, will be high on agenda as world leaders meet - Reuters",
      "pubDate": "Mon, 16 Jun 2025 02:01:00 GMT"
    },
    {
      "title": "Live Updates: Israel Strikes State TV After Telling People to Evacuate Part of Tehran - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 17:57:17 GMT"
    },
    {
      "title": "Israel strikes Iran: Is the world close to a nuclear radiation incident? - Al Jazeera",
      "pubDate": "Tue, 17 Jun 2025 10:08:53 GMT"
    },
    {
      "title": "LIVE: Israel, Iran continue missile attacks; 144 killed in Gaza in last 24 - Al Jazeera",
      "pubDate": "Wed, 18 Jun 2025 07:49:28 GMT"
    },
    {
      "title": "Israel hits nuclear sites, Iran strikes hospital as war escalates - Reuters",
      "pubDate": "Thu, 19 Jun 2025 13:18:24 GMT"
    }
  ],
  "us_politics": [
    {
      "title": "Minnesota lawmaker shootings underscore frequency of US political violence - Semafor",
      "pubDate": "Sun, 15 Jun 2025 22:02:00 GMT"
    },
    {
      "title": "Minnesota killings spread fear in country riven by violence against politicians - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 18:00:57 GMT"
    },
    {
      "title": "Suspected killer of Minnesota Democratic lawmaker arrested after two-day manhunt - France 24",
      "pubDate": "Mon, 16 Jun 2025 04:36:50 GMT"
    },
    {
      "title": "Here’s how Trump’s ‘big beautiful bill’ would impact housing - CNN",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Business Lobbyists Scramble to Kill $100 Billion ‘Revenge Tax’ - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 14:46:12 GMT"
    },
    {
      "title": "Like School Shootings, Political Violence Is Becoming Almost Routine - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 16:21:48 GMT"
    },
    {
      "title": "Senate GOP dials down SALT cap — for now - Politico",
      "pubDate": "Mon, 16 Jun 2025 18:23:27 GMT"
    },
    {
      "title": "Senate GOP tax bill would hit politically explosive Medicaid provision - Politico",
      "pubDate": "Mon, 16 Jun 2025 17:30:45 GMT"
    },
    {
      "title": "Senate version of Trump agenda bill cuts more from Medicaid: GOP aides - The Hill",
      "pubDate": "Mon, 16 Jun 2025 20:01:00 GMT"
    },
    {
      "title": "Senate to maintain cap on state tax deductions, imperilling Trump’s bill - Financial Times",
      "pubDate": "Mon, 16 Jun 2025 19:57:17 GMT"
    },
    {
      "title": "Senate Republicans unveil plan for cuts to Medicaid and taxes in Trump agenda bill - KTEN",
      "pubDate": "Mon, 16 Jun 2025 23:51:33 GMT"
    },
    {
      "title": "Senate Republicans unveil long-awaited details on Trump tax bill - CBS News",
      "pubDate": "Mon, 16 Jun 2025 22:46:06 GMT"
    },
    {
      "title": "Proposed GOP spending cuts could impact health care coverage for millions - CBS News",
      "pubDate": "Mon, 16 Jun 2025 23:07:00 GMT"
    },
    {
      "title": "US prosecutors charge Minnesota shooting suspect with murder - Financial Times",
      "pubDate": "Mon, 16 Jun 2025 19:45:30 GMT"
    },
    {
      "title": "Senate overhauls Trump’s tax bill, setting up brawl with the House - The Washington Post",
      "pubDate": "Tue, 17 Jun 2025 05:16:20 GMT"
    },
    {
      "title": "Senate GOP hits roadblocks in push to pass Trump’s tax and spending bill by July 4 - KTVZ",
      "pubDate": "Tue, 17 Jun 2025 00:56:34 GMT"
    },
    {
      "title": "Senate Finance Committee's version of the 'big, beautiful bill' sets up a potential clash with the House - ABC News",
      "pubDate": "Tue, 17 Jun 2025 02:47:12 GMT"
    },
    {
      "title": "Live updates: Fate of Trump’s legislation unclear, with Senate at odds with House on key provisions - The Washington Post",
      "pubDate": "Tue, 17 Jun 2025 14:21:48 GMT"
    },
    {
      "title": "Lawmakers move to limit Trump's war powers as Israel-Iran war escalates - CBS News",
      "pubDate": "Tue, 17 Jun 2025 17:50:53 GMT"
    },
    {
      "title": "Hospitals stunned by Senate GOP’s Medicaid plan - Politico",
      "pubDate": "Tue, 17 Jun 2025 21:06:43 GMT"
    },
    {
      "title": "Lawmakers aim to stop U.S. from joining Israel's military campaign against Iran - ABC News",
      "pubDate": "Tue, 17 Jun 2025 20:50:18 GMT"
    },
    {
      "title": "Democrats’ frustration with Fetterman mounts as he keeps criticizing his own party - CNN",
      "pubDate": "Wed, 18 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Images of Handcuffed Democrats Are Piling Up in Trump’s Immigration Crackdown - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 09:03:06 GMT"
    },
    {
      "title": "Inside the Chaos Swirling Through Ken Martin’s D.N.C. - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 18:45:28 GMT"
    },
    {
      "title": "A divided Congress mulls war powers as Trump considers strike in Iran - USA Today",
      "pubDate": "Wed, 18 Jun 2025 19:51:44 GMT"
    },
    {
      "title": "Supreme Court ruling on trans healthcare for kids may be a gamechanger in Florida - Miami Herald",
      "pubDate": "Wed, 18 Jun 2025 16:47:00 GMT"
    },
    {
      "title": "Major differences between House and Senate versions of Trump's tax and spending bill - Reuters",
      "pubDate": "Wed, 18 Jun 2025 17:57:53 GMT"
    },
    {
      "title": "‘He’s moving at a truly alarming speed’: Trump propels US into authoritarianism - The Guardian",
      "pubDate": "Thu, 19 Jun 2025 08:00:00 GMT"
    },
    {
      "title": "As Trump Debates Iran Action, the Meaning of ‘America First’ Is on the Line - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 22:45:14 GMT"
    },
    {
      "title": "Hegseth clashes with Democrats on Capitol Hill as Trump weighs striking Iran - The Washington Post",
      "pubDate": "Thu, 19 Jun 2025 04:54:20 GMT"
    }
  ],
  "science": [
    {
      "title": "Scientists Just Solved a 100-Million-Year-Old Mystery About Platypus Sex - ScienceAlert",
      "pubDate": "Sun, 15 Jun 2025 15:02:42 GMT"
    }
  ],
  "democratic_party": [
    {
      "title": "Two top union leaders leave DNC, dealing blow to chair Ken Martin - The Washington Post",
      "pubDate": "Mon, 16 Jun 2025 04:35:55 GMT"
    },
    {
      "title": "Teachers union head quits Democratic Party post in leadership dispute - Reuters",
      "pubDate": "Mon, 16 Jun 2025 02:49:00 GMT"
    },
    {
      "title": "Democratic divisions emerge as Congress tackles crypto regulation - NBC News",
      "pubDate": "Tue, 17 Jun 2025 22:08:28 GMT"
    },
    {
      "title": "The Democrats’ Hot Arraignment Summer - National Review",
      "pubDate": "Wed, 18 Jun 2025 15:21:10 GMT"
    },
    {
      "title": "Democrats’ Wary Response to Transgender Ruling Shows the Party’s Retreat - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 22:01:01 GMT"
    },
    {
      "title": "Exclusive: Democrats want new leaders, focus on pocketbook issues, Reuters/Ipsos poll finds - Reuters",
      "pubDate": "Thu, 19 Jun 2025 10:11:44 GMT"
    },
    {
      "title": "Democrats could do a lot better with the power they hold - The Economist",
      "pubDate": "Thu, 19 Jun 2025 12:57:40 GMT"
    }
  ],
  "north_korea": [
    {
      "title": "North Korean losses exceed 6,000 in Russia's Kursk Oblast, UK intelligence reports - The Kyiv Independent",
      "pubDate": "Sun, 15 Jun 2025 23:03:44 GMT"
    },
    {
      "title": "North Korea suffered more than 6,000 casualties in Ukraine, UK intelligence says - The Independent",
      "pubDate": "Mon, 16 Jun 2025 11:35:00 GMT"
    },
    {
      "title": "North Korea plans to send military construction workers and deminers to Russia - NPR",
      "pubDate": "Wed, 18 Jun 2025 06:52:52 GMT"
    },
    {
      "title": "North Korea launches more than a dozen rockets, South Korea says - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Thu, 19 Jun 2025 09:14:09 GMT"
    }
  ],
  "us_foreign_policy": [
    {
      "title": "US to cut military aid to Ukraine, Hegseth says - The Kyiv Independent",
      "pubDate": "Mon, 16 Jun 2025 05:49:23 GMT"
    },
    {
      "title": "What to Know About the Fighting Between Israel and Iran - The New York Times",
      "pubDate": "Mon, 16 Jun 2025 06:41:02 GMT"
    },
    {
      "title": "US moves 30 jets as Iran attack speculation grows - BBC",
      "pubDate": "Wed, 18 Jun 2025 15:09:52 GMT"
    },
    {
      "title": "US military ready to carry out any Trump decisions on Iran, Hegseth says - Reuters",
      "pubDate": "Wed, 18 Jun 2025 15:57:53 GMT"
    }
  ],
  "trade_war": [
    {
      "title": "Exclusive: US-China trade truce leaves military-use rare earth issue unresolved, sources say - Reuters",
      "pubDate": "Sun, 15 Jun 2025 22:59:51 GMT"
    },
    {
      "title": "China retail sales jump while industrial growth slows on trade war turmoil - Financial Times",
      "pubDate": "Mon, 16 Jun 2025 05:07:13 GMT"
    },
    {
      "title": "Trump tariffs live updates: EU weighs 10% tariff deal as Trump's July deadline looms - Yahoo Finance",
      "pubDate": "Mon, 16 Jun 2025 11:50:36 GMT"
    },
    {
      "title": "Shipping chaos: Inside the industry at the frontlines of the US-China trade war - CNN",
      "pubDate": "Mon, 16 Jun 2025 22:00:00 GMT"
    },
    {
      "title": "No Canada! North-of-the-border buyers pull back as trade war heats up - USA Today",
      "pubDate": "Tue, 17 Jun 2025 18:01:10 GMT"
    },
    {
      "title": "Trade war looms over voices of global business in China - Financial Times",
      "pubDate": "Tue, 17 Jun 2025 23:01:13 GMT"
    },
    {
      "title": "Dominant Chinese makers of bitcoin mining machines set up US production to beat tariffs - Reuters",
      "pubDate": "Wed, 18 Jun 2025 10:34:50 GMT"
    },
    {
      "title": "Trump tariffs live updates: Trump leaves G7 with UK trade deal in hand, stalled EU talks, and 'tough' Japan - Yahoo Finance",
      "pubDate": "Wed, 18 Jun 2025 14:52:10 GMT"
    },
    {
      "title": "How Trump’s Trade War Has Whipsawed the Port of L.A. - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 09:01:19 GMT"
    },
    {
      "title": "After mass anti-Trump protests, UAW President Fain doubles down on support for trade war - World Socialist Web Site",
      "pubDate": "Thu, 19 Jun 2025 01:57:28 GMT"
    }
  ],
  "cybersecurity": [
    {
      "title": "Exclusive | Cyberattack on Washington Post Strikes Journalists’ Email Accounts - WSJ",
      "pubDate": "Sun, 15 Jun 2025 19:41:00 GMT"
    },
    {
      "title": "Retail stores are getting hit hard by cyberattacks - Politico",
      "pubDate": "Mon, 16 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Cybersecurity takes a big hit in new Trump executive order - Ars Technica",
      "pubDate": "Tue, 17 Jun 2025 21:33:01 GMT"
    },
    {
      "title": "Hackers steal $48 million in cryptocurrency used by Iran to fund terror - The Jerusalem Post",
      "pubDate": "Wed, 18 Jun 2025 07:38:32 GMT"
    },
    {
      "title": "Israel-Tied Predatory Sparrow Hackers Are Waging Cyberwar on Iran’s Financial System - WIRED",
      "pubDate": "Wed, 18 Jun 2025 14:40:12 GMT"
    },
    {
      "title": "Pro-Israel hackers take credit after $90 million stolen from Iran’s largest crypto exchange - CNN",
      "pubDate": "Wed, 18 Jun 2025 20:37:00 GMT"
    }
  ],
  "recession": [
    {
      "title": "Ex-Fed Adviser Flags Israel-Iran Tensions As ‘Wild Card,’ Says Recession Odds Ticking Up - MSN",
      "pubDate": "Mon, 16 Jun 2025 05:49:57 GMT"
    },
    {
      "title": "Wake Me Up When We're Not In Recession. It Was Always So - RealClearMarkets",
      "pubDate": "Mon, 16 Jun 2025 08:28:32 GMT"
    },
    {
      "title": "Why Stock Investors Shouldn't Bet On A Recession - Seeking Alpha",
      "pubDate": "Mon, 16 Jun 2025 14:06:00 GMT"
    },
    {
      "title": "‘Worse than a recession’: Billionaire investor Ray Dalio sounds alarm on Trump’s economic agenda - Yahoo Finance",
      "pubDate": "Mon, 16 Jun 2025 19:24:00 GMT"
    },
    {
      "title": "White House pauses ICE raids on farms, hospitality firms; Businesses lower recession expectations: Labor shortage threatens economy - CoStar",
      "pubDate": "Mon, 16 Jun 2025 20:53:44 GMT"
    },
    {
      "title": "Investor Steve Eisman says we are headed for a global recession if Trump's tariffs spark a trade war - CNBC",
      "pubDate": "Tue, 17 Jun 2025 12:58:48 GMT"
    },
    {
      "title": "U.S. Treasury yields slide after retail sales tumbled in May, raising recession fear - CNBC",
      "pubDate": "Tue, 17 Jun 2025 08:13:21 GMT"
    },
    {
      "title": "Japan’s Exports Fall as US Tariffs Stoke Recession Risks - Bloomberg.com",
      "pubDate": "Wed, 18 Jun 2025 00:07:00 GMT"
    },
    {
      "title": "Food, Water, And Recession: What Developing Countries Worry About The Most - 24/7 Wall St.",
      "pubDate": "Wed, 18 Jun 2025 10:43:52 GMT"
    },
    {
      "title": "Retail investors turning to gold amid declining confidence in the US and growing recession fears - Universul.net",
      "pubDate": "Wed, 18 Jun 2025 15:38:09 GMT"
    },
    {
      "title": "Launching a new product during a recession can pay off, Northeastern research shows - Northeastern Global News",
      "pubDate": "Wed, 18 Jun 2025 20:10:30 GMT"
    },
    {
      "title": "Recession fears top consumer concerns - news8000.com",
      "pubDate": "Wed, 18 Jun 2025 23:53:02 GMT"
    },
    {
      "title": "Colorado economists say the risk of a recession in the state is growing - CBS News",
      "pubDate": "Thu, 19 Jun 2025 02:31:32 GMT"
    },
    {
      "title": "Americans Are Side Hustling Like We’re in a Recession - WSJ",
      "pubDate": "Thu, 19 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "Russia is on the verge of going into recession, economy minister says - Reuters",
      "pubDate": "Thu, 19 Jun 2025 06:39:00 GMT"
    },
    {
      "title": "Russian Officials Spar Over Whether Economy Cooling Or In Crisis - Bloomberg.com",
      "pubDate": "Thu, 19 Jun 2025 08:02:11 GMT"
    },
    {
      "title": "Russia needs monetary policy changes to avert a recession, says economy minister - Reuters",
      "pubDate": "Thu, 19 Jun 2025 10:28:04 GMT"
    },
    {
      "title": "Most CEOs aren't expecting a recession anytime soon, survey finds - AOL.com",
      "pubDate": "Thu, 19 Jun 2025 11:49:56 GMT"
    }
  ],
  "drones": [
    {
      "title": "Operation Spiderweb: how Ukraine's drone attack could reshape warfare – video explainer - The Guardian",
      "pubDate": "Mon, 16 Jun 2025 08:47:00 GMT"
    },
    {
      "title": "Scientists are dropping live mosquitoes out of drones in Hawaii. Here’s why. - vox.com",
      "pubDate": "Mon, 16 Jun 2025 11:30:00 GMT"
    },
    {
      "title": "Taiwan seals Ukraine combat-tested drone software deal to help deter China - Reuters",
      "pubDate": "Tue, 17 Jun 2025 12:14:44 GMT"
    },
    {
      "title": "Quietly, Pakistan Wages a Deadly Drone Campaign Inside Its Own Borders - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 04:01:07 GMT"
    }
  ],
  "hamas": [
    {
      "title": "What happened on day 617 of the Israel-Hamas war? - The Jerusalem Post",
      "pubDate": "Mon, 16 Jun 2025 00:21:02 GMT"
    },
    {
      "title": "Dozens killed by Israeli fire near Gaza aid sites, Hamas-run ministry says - BBC",
      "pubDate": "Mon, 16 Jun 2025 13:57:29 GMT"
    },
    {
      "title": "Israel kills 56 Palestinians in Gaza, most of them desperately seeking aid - Al Jazeera",
      "pubDate": "Mon, 16 Jun 2025 18:56:15 GMT"
    },
    {
      "title": "IDF says troops pushing Gaza offensive, strikes targeting Hamas infrastructure - The Times of Israel",
      "pubDate": "Wed, 18 Jun 2025 08:52:15 GMT"
    }
  ],
  "federal_reserve": [
    {
      "title": "Investors (and Trump) are about to find out if Fed still wants rate cuts in 2025 - Yahoo Finance",
      "pubDate": "Mon, 16 Jun 2025 08:00:22 GMT"
    },
    {
      "title": "Fed meets as policymakers are expected to assert their independence amid Trump’s pressure - Fortune",
      "pubDate": "Tue, 17 Jun 2025 09:31:45 GMT"
    },
    {
      "title": "Fed policymakers gather amid rising geopolitical risks, unclear tariff impact - Reuters",
      "pubDate": "Tue, 17 Jun 2025 10:07:50 GMT"
    },
    {
      "title": "The Fed is likely to keep rates the same, but give a forecast that moves markets. What to expect - CNBC",
      "pubDate": "Tue, 17 Jun 2025 19:20:23 GMT"
    },
    {
      "title": "Federal Reserve interest rate decision June 2025: What to know. - NBC News",
      "pubDate": "Wed, 18 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Fed leaves key rate unchanged as it awaits the impact of tariffs and Trump again scolds Powell - AP News",
      "pubDate": "Wed, 18 Jun 2025 20:17:00 GMT"
    },
    {
      "title": "Fed holds interest rate steady for fourth time in a row - CNN",
      "pubDate": "Wed, 18 Jun 2025 20:34:00 GMT"
    },
    {
      "title": "US Fed meeting: Jerome Powell-led US Federal Reserve keeps rates unchanged; defies Donald Trump’s call fo - Times of India",
      "pubDate": "Wed, 18 Jun 2025 18:02:00 GMT"
    },
    {
      "title": "The Federal Reserve Suffers From A Fatal Conceit And Our Economy Is Paying The Price - Forbes",
      "pubDate": "Thu, 19 Jun 2025 10:00:00 GMT"
    }
  ],
  "earthquakes": [
    {
      "title": "An earthquake off Peru’s coast shakes capital, leaving one person dead and 5 injured - CNN",
      "pubDate": "Mon, 16 Jun 2025 03:14:00 GMT"
    },
    {
      "title": "Iran Earthquakes: Tremors Felt In Qom, Fordow Nuclear Site And Sistan, Baluchestan Province - Times Now",
      "pubDate": "Sun, 15 Jun 2025 22:57:26 GMT"
    },
    {
      "title": "5.6 earthquake strikes near Lima, Peru, killing 1 and injuring several - AccuWeather",
      "pubDate": "Mon, 16 Jun 2025 10:11:00 GMT"
    },
    {
      "title": "Magnitude 5.8 earthquake strikes off coast of Mexico's Chiapas, EMSC says - Reuters",
      "pubDate": "Wed, 18 Jun 2025 10:26:23 GMT"
    }
  ],
  "hurricanes": [
    {
      "title": "Scientists discover concerning new phenomenon that may impact the intensity of hurricanes: 'Might get stronger' - Yahoo",
      "pubDate": "Mon, 16 Jun 2025 10:00:12 GMT"
    },
    {
      "title": "Hurricane Erick makes landfall in Mexico as major Category 3 storm - NBC News",
      "pubDate": "Thu, 19 Jun 2025 13:35:00 GMT"
    }
  ],
  "elon_musk": [
    {
      "title": "What Did Elon Musk Accomplish at DOGE? - The New Yorker",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Musk Rages at His Own AI for Its Take on Right-Wing Violence - The Daily Beast",
      "pubDate": "Wed, 18 Jun 2025 09:33:00 GMT"
    },
    {
      "title": "Watch: Big setback for Elon Musk, SpaceX's Starship destroyed during testing in massive explosion - The Economic Times",
      "pubDate": "Thu, 19 Jun 2025 05:55:18 GMT"
    }
  ],
  "cancer": [
    {
      "title": "AbbVie says blood cancer drug fails late-stage trial - Reuters",
      "pubDate": "Mon, 16 Jun 2025 13:12:27 GMT"
    },
    {
      "title": "Breakthrough blood test detects cancer years before symptoms appear - The Independent",
      "pubDate": "Tue, 17 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Targeted cancer drugs may replace chemo for some patients — and drugmakers say they're getting closer - CNBC",
      "pubDate": "Tue, 17 Jun 2025 11:00:01 GMT"
    },
    {
      "title": "‘Cancer is just everywhere’: could farming be behind Iowa’s unfolding health crisis? - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 15:21:00 GMT"
    },
    {
      "title": "New three-shot breast cancer vaccine offers new hope, targets milk protein to stop tumours before they grow - The Indian Express",
      "pubDate": "Thu, 19 Jun 2025 13:00:33 GMT"
    }
  ],
  "atlantic_ocean": [
    {
      "title": "Why has hurricane season been so quiet? Should Houston worry? - Houston Chronicle",
      "pubDate": "Mon, 16 Jun 2025 15:39:22 GMT"
    }
  ],
  "quantum": [
    {
      "title": "Scientists Just Unveiled a Quantum Clock That Could Rewrite the Rules of Timekeeping - The Daily Galaxy",
      "pubDate": "Mon, 16 Jun 2025 14:30:00 GMT"
    },
    {
      "title": "Scientists harness vacuum fluctuations to engineer quantum materials - Phys.org",
      "pubDate": "Wed, 18 Jun 2025 13:58:05 GMT"
    }
  ],
  "space_exploration": [
    {
      "title": "The administration’s anti-consensus Mars plan will fail - SpaceNews",
      "pubDate": "Mon, 16 Jun 2025 11:00:00 GMT"
    }
  ],
  "health_care": [
    {
      "title": "Proposed Medicaid cuts could devastate Appalachian Kentucky, health care providers say - Louisville Public Media",
      "pubDate": "Mon, 16 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Proposed Medicaid cuts could lead to thousands of deaths, study finds - NBC News",
      "pubDate": "Mon, 16 Jun 2025 21:04:33 GMT"
    },
    {
      "title": "The Senate Wants Billions More in Medicaid Cuts, Pinching States and Infuriating Hospitals - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 19:53:59 GMT"
    },
    {
      "title": "Senate Republicans propose deeper Medicaid cuts. Here’s what that means. - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 20:27:51 GMT"
    }
  ],
  "world_economy": [
    {
      "title": "OPEC expects solid second-half of 2025 for world economy, trims 2026 supply - Reuters",
      "pubDate": "Mon, 16 Jun 2025 13:39:10 GMT"
    }
  ],
  "amazon": [
    {
      "title": "Amazon to rejigger its healthcare business - Healthcare IT News",
      "pubDate": "Mon, 16 Jun 2025 19:09:57 GMT"
    },
    {
      "title": "Amazon CEO Jassy says AI will reduce its corporate workforce in the next few years - Yahoo Finance",
      "pubDate": "Wed, 18 Jun 2025 13:59:20 GMT"
    }
  ],
  "physics": [
    {
      "title": "Scientists May Have Just Uncovered a Key Clue to the Fifth Force! - The Daily Galaxy",
      "pubDate": "Mon, 16 Jun 2025 15:00:00 GMT"
    }
  ],
  "openai": [
    {
      "title": "OpenAI executives have discussed accusing Microsoft of anticompetitive behavior, WSJ reports - Reuters",
      "pubDate": "Mon, 16 Jun 2025 20:16:23 GMT"
    },
    {
      "title": "Exclusive | OpenAI and Microsoft Tensions Are Reaching a Boiling Point - WSJ",
      "pubDate": "Mon, 16 Jun 2025 19:58:00 GMT"
    },
    {
      "title": "OpenAI-Microsoft tensions escalate over control and contracts - Computerworld",
      "pubDate": "Tue, 17 Jun 2025 09:01:47 GMT"
    },
    {
      "title": "Sam Altman says Meta is offering $100 million to poach his employees - CNN",
      "pubDate": "Wed, 18 Jun 2025 14:27:00 GMT"
    },
    {
      "title": "OpenAI Changes Price Structure for Business Version of ChatGPT - WSJ",
      "pubDate": "Thu, 19 Jun 2025 09:41:00 GMT"
    }
  ],
  "research": [
    {
      "title": "Judge orders NIH to restore cuts to research grants related to diversity - The Washington Post",
      "pubDate": "Mon, 16 Jun 2025 21:31:20 GMT"
    },
    {
      "title": "US judge blocks Defense Department from slashing federal research funding - Reuters",
      "pubDate": "Tue, 17 Jun 2025 21:03:45 GMT"
    }
  ],
  "renewable_energy": [
    {
      "title": "US Senate budget bill proposal keeps cuts to solar, wind incentives - Reuters",
      "pubDate": "Mon, 16 Jun 2025 23:29:39 GMT"
    },
    {
      "title": "Renewable energy remains cheapest power builds as new gas plants get pricier - Reuters",
      "pubDate": "Mon, 16 Jun 2025 20:53:28 GMT"
    },
    {
      "title": "Senate Finance Committee reconciliation bill slashes solar PV, wind incentives, energy storage survives - PV Tech",
      "pubDate": "Tue, 17 Jun 2025 10:37:31 GMT"
    },
    {
      "title": "Solar stocks plummet as Senate version of Trump's tax bill cuts renewable energy incentives - CNBC",
      "pubDate": "Tue, 17 Jun 2025 11:24:21 GMT"
    },
    {
      "title": "Senate Republicans Double Down and Target Clean Energy in Draft Tax Bill - U.S. News & World Report",
      "pubDate": "Tue, 17 Jun 2025 18:28:00 GMT"
    },
    {
      "title": "Turning coalmines into solar energy plants ‘could add 300GW of renewables by 2030’ - The Guardian",
      "pubDate": "Tue, 17 Jun 2025 23:01:00 GMT"
    },
    {
      "title": "US Senate proposes clean energy tax credit overhaul, phasing out wind and solar support by 2028 - Windtech International",
      "pubDate": "Wed, 18 Jun 2025 09:03:49 GMT"
    },
    {
      "title": "Clean energy has fans in Trump's America, complicating budget talks - Reuters",
      "pubDate": "Wed, 18 Jun 2025 21:24:58 GMT"
    },
    {
      "title": "Solar bankruptcies mount as Congress slashes green energy funds - Financial Times",
      "pubDate": "Thu, 19 Jun 2025 04:01:22 GMT"
    }
  ],
  "blockchain": [
    {
      "title": "JPMorgan Chase files for blockchain-related trademark, triggering speculation it has stablecoin plans - Fortune",
      "pubDate": "Mon, 16 Jun 2025 21:50:00 GMT"
    }
  ],
  "electric-vehicle_battery": [
    {
      "title": "Senate Republicans seek to kill $7,500 EV tax credit - MSN",
      "pubDate": "Tue, 17 Jun 2025 01:45:10 GMT"
    }
  ],
  "cryptocurrency": [
    {
      "title": "Senate expected to pass crypto bill without addressing Trump's investments - ABC News",
      "pubDate": "Tue, 17 Jun 2025 06:03:50 GMT"
    },
    {
      "title": "Senate passes landmark crypto legislation with bipartisan support - USA Today",
      "pubDate": "Tue, 17 Jun 2025 21:48:48 GMT"
    },
    {
      "title": "Senate Passes Cryptocurrency Bill, Handing Industry a Victory - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 21:52:34 GMT"
    },
    {
      "title": "Senate passes first-of-its-kind cryptocurrency legislation - CNN",
      "pubDate": "Tue, 17 Jun 2025 22:39:00 GMT"
    },
    {
      "title": "Senate passes landmark crypto regulation bill on a bipartisan vote, sending it to the House - NBC News",
      "pubDate": "Tue, 17 Jun 2025 22:01:31 GMT"
    },
    {
      "title": "Senate passes GENIUS stablecoin bill, giving crypto industry first major legislative win - CNBC",
      "pubDate": "Tue, 17 Jun 2025 21:53:22 GMT"
    },
    {
      "title": "US Senate passes stablecoin bill in milestone for crypto industry - Reuters",
      "pubDate": "Tue, 17 Jun 2025 22:28:50 GMT"
    },
    {
      "title": "Senate Passes Massive Cryptocurrency Bill, Ignoring Risk To Financial System - TPM - Talking Points Memo",
      "pubDate": "Wed, 18 Jun 2025 00:07:00 GMT"
    },
    {
      "title": "DOJ announces largest-ever crypto seizure related to ‘pig butchering’ scams - The Hill",
      "pubDate": "Wed, 18 Jun 2025 23:04:00 GMT"
    }
  ],
  "national_security": [
    {
      "title": "Pentagon expands Middle East response as Israel, Iran trade strikes - The Washington Post",
      "pubDate": "Tue, 17 Jun 2025 04:47:00 GMT"
    },
    {
      "title": "Nippon Steel finalizes $15B takeover of US Steel after sealing national security agreement - AP News",
      "pubDate": "Wed, 18 Jun 2025 22:42:00 GMT"
    }
  ],
  "military_intelligence": [
    {
      "title": "Israeli military intelligence chief: We broke through Iranian defenses - The Jerusalem Post",
      "pubDate": "Tue, 17 Jun 2025 08:08:26 GMT"
    },
    {
      "title": "IDF’s intelligence chief says Israel must ‘hunt down’ Iran’s fleeing military commanders - The Times of Israel",
      "pubDate": "Thu, 19 Jun 2025 15:27:36 GMT"
    }
  ],
  "taxes": [
    {
      "title": "Senate Republicans Propose Key Tax Tweaks to House Bill - The New York Times",
      "pubDate": "Tue, 17 Jun 2025 15:33:54 GMT"
    }
  ],
  "alexandria_ocasio-cortez": [
    {
      "title": "AOC Joins Bipartisan Effort To Prevent Trump From Entering An Iran War - HuffPost",
      "pubDate": "Tue, 17 Jun 2025 17:47:34 GMT"
    }
  ],
  "tesla": [
    {
      "title": "Tesla stock slumps after a report that Cybertruck and Model Y production is being paused - Quartz",
      "pubDate": "Wed, 18 Jun 2025 00:32:22 GMT"
    },
    {
      "title": "Tesla’s Robotaxi, Long Promised by Elon Musk, Joins a Crowded Field - The New York Times",
      "pubDate": "Wed, 18 Jun 2025 15:59:34 GMT"
    }
  ],
  "military_and_defense": [
    {
      "title": "Israeli military says extensive damage to Iranian defense systems - NewsNation",
      "pubDate": "Wed, 18 Jun 2025 00:47:48 GMT"
    }
  ],
  "battery_electric_vehicle": [
    {
      "title": "Trump Is Turning the US Into an Electric Vehicle Laggard - Bloomberg.com",
      "pubDate": "Wed, 18 Jun 2025 07:00:38 GMT"
    }
  ],
  "us_supreme_court": [
    {
      "title": "US Supreme Court rules that states can ban transgender care for minors - BBC",
      "pubDate": "Wed, 18 Jun 2025 14:19:23 GMT"
    }
  ],
  "hacker": [
    {
      "title": "Pro-Israel hackers destroy $90 million in Iran crypto exchange breach, analytics firm says - CNBC",
      "pubDate": "Wed, 18 Jun 2025 14:09:58 GMT"
    }
  ],
  "large_language_model": [
    {
      "title": "Ukraine Launches National Large Language Model to Boost AI and Digital Sovereignty - Odessa Journal",
      "pubDate": "Wed, 18 Jun 2025 09:42:18 GMT"
    }
  ],
  "inflation": [
    {
      "title": "Fed holds interest rates steady, brushing off Trump’s calls for big cuts - The Washington Post",
      "pubDate": "Wed, 18 Jun 2025 21:36:10 GMT"
    },
    {
      "title": "US Fed leaves interest rates unchanged amid economic uncertainty - Al Jazeera",
      "pubDate": "Wed, 18 Jun 2025 19:00:46 GMT"
    }
  ],
  "nasa": [
    {
      "title": "Trump's plan to kill dozens of NASA missions threatens US space supremacy - Phys.org",
      "pubDate": "Wed, 18 Jun 2025 12:00:03 GMT"
    }
  ],
  "asteroids": [
    {
      "title": "Asteroid on collision course with moon could fire shrapnel at Earth - New Scientist",
      "pubDate": "Wed, 18 Jun 2025 11:38:32 GMT"
    }
  ],
  "hacking": [
    {
      "title": "Israel-linked group hacks Iranian cryptocurrency exchange in $90m heist - The Guardian",
      "pubDate": "Wed, 18 Jun 2025 19:43:00 GMT"
    }
  ],
  "american_civil_liberties_union": [
    {
      "title": "Supreme Court upholds Tennessee ban on gender-affirming care, ACLU comments - thv11.com",
      "pubDate": "Wed, 18 Jun 2025 20:16:00 GMT"
    }
  ],
  "spacex": [
    {
      "title": "SpaceX Starship Explodes During Test in Texas - The New York Times",
      "pubDate": "Thu, 19 Jun 2025 07:43:50 GMT"
    },
    {
      "title": "SpaceX Starship explodes on Texas launch site - Fox Business",
      "pubDate": "Thu, 19 Jun 2025 10:30:31 GMT"
    },
    {
      "title": "SpaceX rocket explodes in new setback to Elon Musk’s Mars project - The Guardian",
      "pubDate": "Thu, 19 Jun 2025 11:52:00 GMT"
    },
    {
      "title": "SpaceX's Starship explodes on Texas launch pad in 'catastrophic failure' during routine test - Live Science",
      "pubDate": "Thu, 19 Jun 2025 15:38:44 GMT"
    }
  ],
  "microsoft": [
    {
      "title": "Microsoft Plans Thousands of Job Cuts. How AI Is Reshaping the Labor Market. - Barron's",
      "pubDate": "Thu, 19 Jun 2025 14:08:00 GMT"
    }
  ],
  "energy_storage": [
    {
      "title": "Scientists make revolutionary breakthrough that could transform energy storage: 'Truly a game-changer' - Yahoo",
      "pubDate": "Thu, 19 Jun 2025 10:45:04 GMT"
    }
  ],
  "new_york_city_police_department": [
    {
      "title": "New York police search for a suspect and a motive after 11 police vehicles are torched - WCBD News 2",
      "pubDate": "Thu, 19 Jun 2025 16:21:05 GMT"
    }
  ],
  "pollution": [
    {
      "title": "Scientists find ‘alarming’ levels of toxic metals, pollution in Lake Maurepas - Louisiana Illuminator",
      "pubDate": "Thu, 19 Jun 2025 10:04:27 GMT"
    }
  ]
}