{
  "artificial_intelligence": [
    {
      "title": "2 Artificial Intelligence (AI) Stocks I'm Buying If the Market Crashes - Yahoo Finance",
      "pubDate": "Sat, 17 May 2025 17:23:00 GMT"
    },
    {
      "title": "AI models can't tell time or read a calendar, study reveals - Live Science",
      "pubDate": "Sat, 17 May 2025 13:00:00 GMT"
    },
    {
      "title": "Prediction: This Artificial Intelligence (AI) Data Center Stock -- Backed by Nvidia and Billionaire Jeff Bezos -- Could Go Parabolic After May 20 - Nasdaq",
      "pubDate": "Sat, 17 May 2025 14:05:00 GMT"
    },
    {
      "title": "AI Goes To School - Kiplinger",
      "pubDate": "Sat, 17 May 2025 14:08:00 GMT"
    },
    {
      "title": "House Includes 10-Year Ban on States Regulating AI in Budget Bill - Broadband Breakfast",
      "pubDate": "Sat, 17 May 2025 18:07:31 GMT"
    },
    {
      "title": "First Things First: How artificial intelligence is shaping families - Chattanooga Times Free Press",
      "pubDate": "Sat, 17 May 2025 16:00:03 GMT"
    },
    {
      "title": "U. researchers unveil AI-powered tool for disease prediction with 'unprecedented accuracy' - KSL News",
      "pubDate": "Sat, 17 May 2025 21:04:47 GMT"
    },
    {
      "title": "Musk's xAI updates Grok chatbot after 'white genocide' comments - Reuters",
      "pubDate": "Sat, 17 May 2025 21:08:01 GMT"
    },
    {
      "title": "MIT Backs Away From Paper Claiming Scientists Make More Discoveries with AI - Gizmodo",
      "pubDate": "Sat, 17 May 2025 19:30:08 GMT"
    },
    {
      "title": "EU Parliament: more AI to combat VAT fraud - VATCalc",
      "pubDate": "Sat, 17 May 2025 23:00:22 GMT"
    },
    {
      "title": "From Automation to Autonomy: How agentic AI is rewriting the enterprise playbook - ET Edge Insights - ET Edge Insights",
      "pubDate": "Sun, 18 May 2025 03:33:33 GMT"
    },
    {
      "title": "Experienced defense professional to discuss artificial intelligence in industry and government - Today's Medical Developments",
      "pubDate": "Sun, 18 May 2025 05:32:19 GMT"
    },
    {
      "title": "Ovy On The Drums, producer of Bad Bunny and Shakira: ‘I use artificial intelligence even for blood tests’ - EL PAÍS English",
      "pubDate": "Sun, 18 May 2025 04:00:00 GMT"
    },
    {
      "title": "Don’t embarrass yourself in your next AI conversation - Komando.com",
      "pubDate": "Sun, 18 May 2025 07:00:00 GMT"
    },
    {
      "title": "32.9% of Warren Buffett's $286 Billion Portfolio Is Invested in 3 Artificial Intelligence (AI) Stocks - Yahoo Finance",
      "pubDate": "Sun, 18 May 2025 08:51:00 GMT"
    },
    {
      "title": "Apple Users Ditch Google Search, Trump Praises Nvidia's Jensen Huang At Saudi Summit, SMCI Stock In 'Sweet Spot' And More: This Week In Artificial Intelligence - Benzinga",
      "pubDate": "Sun, 18 May 2025 11:00:15 GMT"
    },
    {
      "title": "Musk’s AI bot Grok blames its Holocaust scepticism on ‘programming error’ - The Guardian",
      "pubDate": "Sun, 18 May 2025 14:45:00 GMT"
    },
    {
      "title": "Navigating AI amid a mental health crisis | GUEST COMMENTARY - Baltimore Sun",
      "pubDate": "Sun, 18 May 2025 17:22:36 GMT"
    },
    {
      "title": "How OpenAI’s o3 and o4-mini Models Are Revolutionizing Visual Analysis and Coding - Unite.AI",
      "pubDate": "Sun, 18 May 2025 15:56:40 GMT"
    },
    {
      "title": "Artificial Intelligence (AI) Infrastructure Spend Could Hit $6.7 Trillion by 2030, According to McKinsey. 4 Data Center Stocks to Load Up on Right Now Like There's No Tomorrow. - The Motley Fool",
      "pubDate": "Sun, 18 May 2025 19:22:00 GMT"
    },
    {
      "title": "AI replacing 38% of white-collar jobs by 2026: What your career faces next - Journée Mondiale",
      "pubDate": "Sun, 18 May 2025 16:55:29 GMT"
    },
    {
      "title": "Why Apple Still Hasn’t Cracked AI - Bloomberg",
      "pubDate": "Sun, 18 May 2025 21:00:28 GMT"
    },
    {
      "title": "Nvidia Reportedly Aiming to Expand AI Business Beyond ‘Hyperscalers’ - PYMNTS.com",
      "pubDate": "Sun, 18 May 2025 22:01:05 GMT"
    }
  ],
  "donald_trump": [
    {
      "title": "Court lifts block on Trump order to strip federal workers of union rights - The Washington Post",
      "pubDate": "Sat, 17 May 2025 13:58:29 GMT"
    },
    {
      "title": "Trump says he will call Putin on Monday to discuss stopping Ukraine war - BBC",
      "pubDate": "Sat, 17 May 2025 16:47:21 GMT"
    },
    {
      "title": "Trump says he'll speak separately to Zelenskyy and Putin on Monday about a potential Russia-Ukraine ceasefire - NBC News",
      "pubDate": "Sat, 17 May 2025 15:28:00 GMT"
    },
    {
      "title": "Nonprofit leaders brace for possible targeting by the Trump administration after tax measure advances in Congress - CNN",
      "pubDate": "Sat, 17 May 2025 18:11:00 GMT"
    },
    {
      "title": "‘Very disturbing’: Trump receipt of overseas gifts unprecedented, experts warn - The Guardian",
      "pubDate": "Sat, 17 May 2025 19:13:00 GMT"
    },
    {
      "title": "Walz calls Trump a \"tyrant\" who abuses power and violates rule of law - CBS News",
      "pubDate": "Sat, 17 May 2025 19:29:46 GMT"
    },
    {
      "title": "Inmate's last words before execution: 'President Trump, keep making America great' - USA Today",
      "pubDate": "Sat, 17 May 2025 20:59:31 GMT"
    },
    {
      "title": "Trump Suggests Supreme Court Is ‘Illegally’ Blocking His Lawless Deportations - Rolling Stone",
      "pubDate": "Sat, 17 May 2025 21:12:25 GMT"
    },
    {
      "title": "Why so many CEOs crossed paths with Trump in the Middle East, from Sam Altman to Jensen Huang - Yahoo Finance",
      "pubDate": "Sat, 17 May 2025 18:57:37 GMT"
    },
    {
      "title": "‘Fight back’: Pedro Pascal urges Cannes to resist US political pressure - Al Jazeera",
      "pubDate": "Sat, 17 May 2025 22:06:09 GMT"
    },
    {
      "title": "Donald Trump's Approval Rating Now Underwater on Nearly Every Issue - Newsweek",
      "pubDate": "Sat, 17 May 2025 22:59:10 GMT"
    },
    {
      "title": "Under Fire From Trump’s Tariffs, Ammo Makers in a Balkan Valley Hunker Down - The New York Times",
      "pubDate": "Sun, 18 May 2025 05:17:44 GMT"
    },
    {
      "title": "Transactional diplomacy: Israel must defends its interests, not rely on Trump's whims - editorial - The Jerusalem Post",
      "pubDate": "Sun, 18 May 2025 02:58:45 GMT"
    },
    {
      "title": "Russia launches record 273-drone attack on Ukraine ahead of planned Trump-Putin call - The Kyiv Independent",
      "pubDate": "Sun, 18 May 2025 07:26:20 GMT"
    },
    {
      "title": "‘I own the store’: Trump seeks a direct role in the economy - The Washington Post",
      "pubDate": "Sun, 18 May 2025 10:00:54 GMT"
    },
    {
      "title": "One Thing Helping Trump’s Approval Rating: Some People Are Not Paying Attention - The New York Times",
      "pubDate": "Sun, 18 May 2025 07:15:04 GMT"
    },
    {
      "title": "Trump’s new border wall will threaten wildlife in an area where few people pass - The Guardian",
      "pubDate": "Sun, 18 May 2025 12:01:00 GMT"
    },
    {
      "title": "Mike Pence criticizes Trump on tariffs and key foreign policy issues as he watches from afar - NBC News",
      "pubDate": "Sun, 18 May 2025 13:00:00 GMT"
    },
    {
      "title": "Former VP Mike Pence calls the $400 million Qatari jet gift 'a bad idea' that Trump should turn down - CNBC",
      "pubDate": "Sun, 18 May 2025 13:52:38 GMT"
    },
    {
      "title": "US policy shifts on Syria, Yemen, Iran – but not Israel - Al Jazeera",
      "pubDate": "Sun, 18 May 2025 14:32:04 GMT"
    },
    {
      "title": "US treasury secretary says Walmart will ‘eat some of the tariffs’ after Trump demand - The Guardian",
      "pubDate": "Sun, 18 May 2025 15:59:00 GMT"
    },
    {
      "title": "Live updates: Lawmakers discuss Trump's 'big, beautiful bill,' Qatari jet gift - The Hill",
      "pubDate": "Sun, 18 May 2025 17:23:00 GMT"
    },
    {
      "title": "'Profound issues': Mike Pence says it's a 'bad idea' for Donald Trump to accept Qatari jet - USA Today",
      "pubDate": "Sun, 18 May 2025 13:01:59 GMT"
    },
    {
      "title": "Trump’s acceptance of Qatar jet gift is ‘definition of corruption’, senator says - The Guardian",
      "pubDate": "Sun, 18 May 2025 18:48:00 GMT"
    },
    {
      "title": "Bruce Springsteen doubles down after Trump calls him 'dried out prune' - USA Today",
      "pubDate": "Sun, 18 May 2025 17:31:59 GMT"
    },
    {
      "title": "Trump looks to meddle in the sports world like no president before - Politico",
      "pubDate": "Sun, 18 May 2025 18:00:00 GMT"
    },
    {
      "title": "Trump wishes Biden ‘fast and successful recovery’ after cancer diagnosis - The Hill",
      "pubDate": "Sun, 18 May 2025 21:37:00 GMT"
    }
  ],
  "us_economy": [
    {
      "title": "Trump recession is off the table — but trouble not over for U.S. economy - MarketWatch",
      "pubDate": "Sat, 17 May 2025 13:00:00 GMT"
    },
    {
      "title": "Trump warns Walmart: Don't raise prices due to my tariffs but do eat the costs from those taxes - WHEC.com",
      "pubDate": "Sat, 17 May 2025 15:59:57 GMT"
    },
    {
      "title": "Moody's downgrades U.S. rating from AAA to Aa1; what are the consequences of this move, and will the econo - The Economic Times",
      "pubDate": "Sat, 17 May 2025 13:42:24 GMT"
    },
    {
      "title": "Warren Buffett Remains Optimistic About America. Here Are Top American Companies Worth Investing In. - The Globe and Mail",
      "pubDate": "Sat, 17 May 2025 22:32:41 GMT"
    },
    {
      "title": "Rowdy and rich, here's what Preakness says about the US economy - BBC",
      "pubDate": "Sun, 18 May 2025 01:24:23 GMT"
    },
    {
      "title": "Report finds billions in economic impact from the beer industry. See the impact in Ohio - Canton Repository",
      "pubDate": "Sun, 18 May 2025 10:13:52 GMT"
    },
    {
      "title": "Why you can’t keep the US economy and stock market down for very long - Yahoo Finance",
      "pubDate": "Sun, 18 May 2025 17:14:57 GMT"
    },
    {
      "title": "US Treasury's Bessent to Attend G7 Finance Meeting, Focus on Imbalances - U.S. News & World Report",
      "pubDate": "Sun, 18 May 2025 16:23:00 GMT"
    }
  ],
  "us_politics": [
    {
      "title": "Republican Revolt Reflects a Core Party Divide Over Spending and Debt - The New York Times",
      "pubDate": "Sat, 17 May 2025 15:07:00 GMT"
    },
    {
      "title": "Biden Faces Renewed Scrutiny After Release of Special Counsel Audio - The New York Times",
      "pubDate": "Sat, 17 May 2025 15:44:00 GMT"
    },
    {
      "title": "Beto O’Rourke says Joe Biden ‘failed this country’ amid revelations of former president’s decline in office - The Independent",
      "pubDate": "Sat, 17 May 2025 16:10:00 GMT"
    },
    {
      "title": "Leaked audio reveals extent of Biden’s struggle to remember key details in 2023 interview, including when son died - The Independent",
      "pubDate": "Sat, 17 May 2025 15:49:00 GMT"
    },
    {
      "title": "\"Good God. This Is Pure Evil\": 26 Very Harsh But Very True Tweets About American Politics This Week - Yahoo",
      "pubDate": "Sat, 17 May 2025 16:55:38 GMT"
    },
    {
      "title": "‘Eddington’ star Pedro Pascal on US politics: “F**k the people that try to make you scared” - Screen Daily",
      "pubDate": "Sat, 17 May 2025 15:22:30 GMT"
    },
    {
      "title": "‘Watch Me,’ Biden Said. But Hearing Him in Hur Interview Is More Revealing. - The New York Times",
      "pubDate": "Sat, 17 May 2025 20:34:53 GMT"
    },
    {
      "title": "Trump Administration Abandons Fight to Ban Powerful Gun Accessory - The New York Times",
      "pubDate": "Sat, 17 May 2025 22:06:31 GMT"
    },
    {
      "title": "Pedro Pascal delivers strong message on U.S. politics: “Fight back. Don’t let them win” - Diario AS",
      "pubDate": "Sat, 17 May 2025 23:00:23 GMT"
    },
    {
      "title": "Libraries are cutting back on staff and services after Trump’s order to dismantle small agency - BigCountryHomepage.com",
      "pubDate": "Sun, 18 May 2025 04:31:04 GMT"
    },
    {
      "title": "The carnival of American politics is dizzying. Yet here we stand. - Kansas Reflector",
      "pubDate": "Sun, 18 May 2025 08:34:41 GMT"
    },
    {
      "title": "Why Buttigieg, Walz, Beshear and Other Democrats Are Already Teasing 2028 Bids - The New York Times",
      "pubDate": "Sun, 18 May 2025 09:01:21 GMT"
    },
    {
      "title": "This land is their land: Trump is selling out the US’s beloved wilderness - The Guardian",
      "pubDate": "Sun, 18 May 2025 13:00:00 GMT"
    },
    {
      "title": "The future of history: Trump could leave less documentation behind than any previous US president - newspressnow.com",
      "pubDate": "Sun, 18 May 2025 15:58:06 GMT"
    },
    {
      "title": "Trump to Speak With Putin and Zelensky in Effort to Procure Cease-Fire as Russia Ramps Up Strikes in Ukraine - Time Magazine",
      "pubDate": "Sun, 18 May 2025 16:30:37 GMT"
    },
    {
      "title": "Tributes pour in from across the political spectrum as Joe Biden announces prostate cancer diagnosis - The Independent",
      "pubDate": "Sun, 18 May 2025 20:48:00 GMT"
    },
    {
      "title": "Biden diagnosed with ‘aggressive form’ of prostate cancer - News Channel 3-12",
      "pubDate": "Sun, 18 May 2025 21:18:51 GMT"
    },
    {
      "title": "As It Turns Out, ‘They’ Didn’t Try to Kill Trump After All - WhoWhatWhy",
      "pubDate": "Sun, 18 May 2025 20:21:13 GMT"
    }
  ],
  "recession": [
    {
      "title": "Recession Probabilities Decline - Real Investment Advice",
      "pubDate": "Sat, 17 May 2025 12:20:31 GMT"
    },
    {
      "title": "JPMorgan Chase Says US May Have Dodged Recession, Warns Sluggish Growth Incoming - The Daily Hodl",
      "pubDate": "Sat, 17 May 2025 13:31:10 GMT"
    },
    {
      "title": "Big Short’s Michael Burry Abruptly Sells Everything – Except for One ‘Recession-Proof’ Asset - The Daily Hodl",
      "pubDate": "Sat, 17 May 2025 17:31:11 GMT"
    },
    {
      "title": "Jamie Dimon Says U.S. Recession Still a Real Possibility Amid Global Instability - Cryptodnes.bg",
      "pubDate": "Sat, 17 May 2025 16:43:15 GMT"
    },
    {
      "title": "Trump’s backing away from tariffs diminishes chances of recession, boosts tech services, says Everest Group founder - The Hindu",
      "pubDate": "Sat, 17 May 2025 14:53:00 GMT"
    },
    {
      "title": "Russian economy faces downturn: Recession fears intensify - MSN",
      "pubDate": "Sat, 17 May 2025 22:58:06 GMT"
    },
    {
      "title": "JPMorgan Sees Slow Growth Ahead But No Recession in 2025 - Cryptodnes.bg",
      "pubDate": "Sun, 18 May 2025 07:50:02 GMT"
    },
    {
      "title": "Emergency savings are crucial in a recession. Here's the dollar figure to aim for. - USA Today",
      "pubDate": "Sun, 18 May 2025 09:07:43 GMT"
    },
    {
      "title": "‘Almost in a Recession’: Fox Reporter Raises Red Flag on Trump - MSN",
      "pubDate": "Sun, 18 May 2025 15:30:45 GMT"
    },
    {
      "title": "‘What we’re doing is very big’: Trump says he won’t rule out a recession — here are 3 simple strategies to help keep your finances safe in a downturn - MSN",
      "pubDate": "Sun, 18 May 2025 15:50:36 GMT"
    },
    {
      "title": "Great Recession lessons that still apply now - Cleveland.com",
      "pubDate": "Sun, 18 May 2025 15:00:00 GMT"
    },
    {
      "title": "Michael Burry Makes Major Portfolio Shift, Holding Only One Asset He Deems 'Recession-Proof' - Benzinga",
      "pubDate": "Sun, 18 May 2025 17:21:18 GMT"
    },
    {
      "title": "Recession Recipes Are Taking Over TikTok This Summer - The Takeout",
      "pubDate": "Sun, 18 May 2025 18:30:00 GMT"
    }
  ],
  "trade_war": [
    {
      "title": "How America’s Trade War Is Supercharging an AI Infrastructure Boom - InvestorPlace",
      "pubDate": "Sat, 17 May 2025 15:55:17 GMT"
    },
    {
      "title": "Tariffs live updates: Trump says US will set new tariff rates for trading partners soon - Yahoo Finance",
      "pubDate": "Sat, 17 May 2025 16:16:59 GMT"
    },
    {
      "title": "U.S. stocks are nearing record highs again after a furious rally — 'this market could surprise everyone' - Fortune",
      "pubDate": "Sat, 17 May 2025 17:35:00 GMT"
    },
    {
      "title": "The whiplash of covering the trade war from inside China - NPR",
      "pubDate": "Sat, 17 May 2025 15:58:40 GMT"
    },
    {
      "title": "Exclusive: Some Chinese companies eye Singapore listings to expand markets amid trade war - Reuters",
      "pubDate": "Sat, 17 May 2025 23:04:17 GMT"
    },
    {
      "title": "Trump orders Walmart to ‘eat the tariffs’ and stop blaming his trade war for rising prices: ‘I’ll be watching’ - The Independent",
      "pubDate": "Sat, 17 May 2025 23:42:00 GMT"
    },
    {
      "title": "The US and China are in more than a trade war - The Spectator",
      "pubDate": "Sun, 18 May 2025 04:30:00 GMT"
    },
    {
      "title": "'Confident' China touts poverty alleviation efforts amid trade war with the U.S. - NBC News",
      "pubDate": "Sun, 18 May 2025 07:04:00 GMT"
    },
    {
      "title": "US Stock Market Looks More Favorable Now Than Pre-Trade War, According to Fundstrat’s Tom Lee – Here’s Why - The Daily Hodl",
      "pubDate": "Sun, 18 May 2025 07:04:11 GMT"
    },
    {
      "title": "Trump’s tariffs are failing, but the old model won’t save us either - Al Jazeera",
      "pubDate": "Sun, 18 May 2025 11:04:54 GMT"
    },
    {
      "title": "This pause in the trade war will be brief. Small businesses, plan accordingly - The Guardian",
      "pubDate": "Sun, 18 May 2025 11:00:00 GMT"
    },
    {
      "title": "China puts heavy 75% tax on US imports of vital engineering plastic - South China Morning Post",
      "pubDate": "Sun, 18 May 2025 13:00:13 GMT"
    },
    {
      "title": "Trade war fallout: Chinese e-commerce firms intensify push for Europe’s shoppers - South China Morning Post",
      "pubDate": "Sun, 18 May 2025 14:00:08 GMT"
    },
    {
      "title": "Tariffs live updates: Trump urges Walmart to 'eat the tariffs' and wants Fed to cut rates 'sooner than later' - Yahoo Finance",
      "pubDate": "Sun, 18 May 2025 15:10:41 GMT"
    },
    {
      "title": "Peter Schiff blasts US-China trade deal — says the Asian nation won by calling Trump’s ‘bluff’ on 145% tariffs - Yahoo Finance",
      "pubDate": "Sun, 18 May 2025 17:30:00 GMT"
    },
    {
      "title": "How consulting firms are advising clients to survive Trump's trade wars - Yahoo Finance",
      "pubDate": "Sun, 18 May 2025 17:08:01 GMT"
    },
    {
      "title": "Mansion sales are booming as the rich seek shelter from trade war fallout — 'real estate is safer' - Fortune",
      "pubDate": "Sun, 18 May 2025 18:54:00 GMT"
    },
    {
      "title": "Trade war truce isn’t cause for complacency - East Asia Forum",
      "pubDate": "Sun, 18 May 2025 22:00:00 GMT"
    }
  ],
  "us_foreign_policy": [
    {
      "title": "US foreign policy - The Guardian",
      "pubDate": "Sat, 17 May 2025 17:02:58 GMT"
    },
    {
      "title": "The end of US sanctions on Syria signaling new era for Middle East - BLiTZ - Fears None But God",
      "pubDate": "Sat, 17 May 2025 18:25:20 GMT"
    },
    {
      "title": "What Trump's Middle East tour means for U.S. foreign policy | The Sunday Magazine | On Demand | CBC Listen - CBC",
      "pubDate": "Sun, 18 May 2025 15:13:07 GMT"
    },
    {
      "title": "Pence: ‘I’ve never been a fan of American presidents criticizing America on foreign soil’ - Politico",
      "pubDate": "Sun, 18 May 2025 17:23:34 GMT"
    }
  ],
  "china": [
    {
      "title": "Trump says China and Walmart should ‘eat the tariffs’, not raise prices - South China Morning Post",
      "pubDate": "Sat, 17 May 2025 16:51:42 GMT"
    },
    {
      "title": "China’s warplane combat debut over Kashmir riles tense geopolitics - The Washington Post",
      "pubDate": "Sat, 17 May 2025 20:35:50 GMT"
    },
    {
      "title": "'You start to go crazy': The Australian who survived five years in a Chinese prison - BBC",
      "pubDate": "Sat, 17 May 2025 23:16:56 GMT"
    },
    {
      "title": "Global supply chains threatened by lack of Chinese rare earths - Financial Times",
      "pubDate": "Sun, 18 May 2025 04:00:58 GMT"
    },
    {
      "title": "China announces anti-dumping duties on plastics from US, EU, Japan and Taiwan - Reuters",
      "pubDate": "Sun, 18 May 2025 06:01:00 GMT"
    },
    {
      "title": "Nobel physicist Giorgio Parisi takes up complexity sciences post in China - South China Morning Post",
      "pubDate": "Sun, 18 May 2025 08:00:11 GMT"
    },
    {
      "title": "China Gave Pakistan Satellite Support, Indian Defense Group Says - Bloomberg.com",
      "pubDate": "Sun, 18 May 2025 09:22:04 GMT"
    },
    {
      "title": "China Is Enabling Pakistan’s Proxy Terror Against India - National Review",
      "pubDate": "Sun, 18 May 2025 10:30:28 GMT"
    },
    {
      "title": "Trump lowered tariffs on China. Here’s why that won’t spare Americans from price hikes and shortages - CNN",
      "pubDate": "Sun, 18 May 2025 09:00:00 GMT"
    },
    {
      "title": "Pilotless planes are taking flight in China. Bank of America says it's time to buy - CNBC",
      "pubDate": "Sun, 18 May 2025 13:03:00 GMT"
    },
    {
      "title": "Offshoring AI to the Middle East Could Hand China a Win - Bloomberg",
      "pubDate": "Sun, 18 May 2025 12:00:29 GMT"
    },
    {
      "title": "Caught between the U.S. and China, young people in Taiwan just want things to stay the same - NBC News",
      "pubDate": "Sun, 18 May 2025 12:02:17 GMT"
    },
    {
      "title": "China-US Trade Truce Prompts Nations to Consider Tougher Tactics - Bloomberg.com",
      "pubDate": "Sun, 18 May 2025 16:01:00 GMT"
    },
    {
      "title": "America's EV Outlook Just Got Bleaker. China Isn't Slowing Down. - InsideEVs",
      "pubDate": "Sun, 18 May 2025 16:03:37 GMT"
    }
  ],
  "russia": [
    {
      "title": "Russian Drone Strikes Civilian Shuttle Bus in Ukraine - The New York Times",
      "pubDate": "Sat, 17 May 2025 15:46:30 GMT"
    },
    {
      "title": "Ukraine Is Making More Weapons Than Ever—but Still Can’t Fight Russia Alone - WSJ",
      "pubDate": "Sun, 18 May 2025 04:01:00 GMT"
    },
    {
      "title": "Russia launches biggest drone attack on Ukraine since start of war, killing at least 1 - AP News",
      "pubDate": "Sun, 18 May 2025 10:06:00 GMT"
    },
    {
      "title": "New clips from Putin documentary suggest Russia dismissed Ukraine peace talks, ceasefire weeks ago - The Kyiv Independent",
      "pubDate": "Sun, 18 May 2025 12:53:45 GMT"
    },
    {
      "title": "Russia detains Greek oil tanker after it departs Estonian port - Al Jazeera",
      "pubDate": "Sun, 18 May 2025 17:23:57 GMT"
    },
    {
      "title": "Russia Preparing 'Combat Training' ICBM Launch, Kyiv Warns - Newsweek",
      "pubDate": "Sun, 18 May 2025 16:28:48 GMT"
    }
  ],
  "brics": [
    {
      "title": "Colombia applies to join China-led Brics bank amid shift from US ties - Business Standard",
      "pubDate": "Sat, 17 May 2025 17:49:29 GMT"
    },
    {
      "title": "UAE participates in BRICS Transport Ministers’ Meeting in Brazil - MSN",
      "pubDate": "Sat, 17 May 2025 20:20:50 GMT"
    },
    {
      "title": "India to showcase power sector achievements at BRICS energy ministers’ meet - Social News XYZ",
      "pubDate": "Sat, 17 May 2025 20:19:08 GMT"
    },
    {
      "title": "Brics Pay makes play towards a multipolar monetary order - Daily Nation",
      "pubDate": "Sat, 17 May 2025 21:00:00 GMT"
    },
    {
      "title": "New Africa BRICS Members Decry Preferential Treatment For South Africa – Analysis - Eurasia Review",
      "pubDate": "Sun, 18 May 2025 00:08:12 GMT"
    },
    {
      "title": "Malaysian PM: BRICS represents new initiative within the Global South - Tehran Times",
      "pubDate": "Sun, 18 May 2025 12:03:44 GMT"
    },
    {
      "title": "BRICS News Digest for the previous week - TV BRICS",
      "pubDate": "Sun, 18 May 2025 16:00:02 GMT"
    },
    {
      "title": "Open Questions | Brics message to ‘ring hollow’ if Pakistan is ‘blocked by India’: Khalil Hashmi - South China Morning Post",
      "pubDate": "Sun, 18 May 2025 22:00:24 GMT"
    }
  ],
  "ai_safety": [
    {
      "title": "AI Security Frameworks - Ensuring Trust in Machine Learning - CybersecurityNews",
      "pubDate": "Sat, 17 May 2025 19:00:00 GMT"
    }
  ],
  "financial_markets": [
    {
      "title": "Clifford Chance: Victoria Salem Named As Partner In Global Financial Markets Team - Pulse 2.0",
      "pubDate": "Sat, 17 May 2025 20:22:02 GMT"
    },
    {
      "title": "Retailers set to give tariff view as US stock market roars back By Reuters - Investing.com",
      "pubDate": "Sun, 18 May 2025 13:04:07 GMT"
    },
    {
      "title": "Investors await another Monday jolt after Moody’s downgrades US - Yahoo Finance",
      "pubDate": "Sun, 18 May 2025 18:19:39 GMT"
    },
    {
      "title": "Manipulation in financial markets: are regulators ready for artificial intelligence - Українські Національні Новини",
      "pubDate": "Sun, 18 May 2025 18:48:17 GMT"
    },
    {
      "title": "The US dollar is everyone’s problem - Lowy Institute",
      "pubDate": "Sun, 18 May 2025 17:33:20 GMT"
    },
    {
      "title": "Trump's tariff war pauses, brings momentary relief to markets - MSN",
      "pubDate": "Sun, 18 May 2025 17:40:24 GMT"
    }
  ],
  "ukraine": [
    {
      "title": "Russian attack on bus in Sumy region kills nine, Ukraine says, hours after peace talks - CNN",
      "pubDate": "Sat, 17 May 2025 19:37:00 GMT"
    },
    {
      "title": "Ukraine-Russia war live: Russia prepares ballistic missile launch - The Telegraph",
      "pubDate": "Sun, 18 May 2025 16:51:49 GMT"
    }
  ],
  "hamas": [
    {
      "title": "Hamas proposes releasing some hostages in fresh talks after new Israel offensive - BBC",
      "pubDate": "Sat, 17 May 2025 22:16:08 GMT"
    },
    {
      "title": "LIVE: Israel kills over 100 Palestinians in Gaza, resumes talks with Hamas - Al Jazeera",
      "pubDate": "Sun, 18 May 2025 06:22:30 GMT"
    }
  ],
  "terrorism": [
    {
      "title": "Deadly blast outside Palm Springs fertility clinic 'intentional act of terrorism,' FBI says - ABC News",
      "pubDate": "Sun, 18 May 2025 01:30:00 GMT"
    },
    {
      "title": "Bomb kills one near California fertility clinic; FBI calls it 'terrorism' - Reuters",
      "pubDate": "Sun, 18 May 2025 01:25:00 GMT"
    },
    {
      "title": "Authorities investigating a Palm Springs, California, fertility clinic explosion as terrorism - Times of India",
      "pubDate": "Sun, 18 May 2025 17:12:00 GMT"
    }
  ],
  "inflation": [
    {
      "title": "Prices will rise, Bessent says, as tariff pressure grows - Axios",
      "pubDate": "Sun, 18 May 2025 14:25:40 GMT"
    }
  ],
  "democratic_party": [
    {
      "title": "Original Sin: book on Biden’s health decline reopens Democratic party’s wounds - The Guardian",
      "pubDate": "Sun, 18 May 2025 16:37:00 GMT"
    }
  ]
}