{
  "donald_trump": [
    {
      "title": "'Elon is going to get decimated:' How Trump's feud with the world's richest man might end - USA Today",
      "pubDate": "Sat, 07 Jun 2025 18:47:40 GMT"
    },
    {
      "title": "Trump says relationship with Musk is over - BBC",
      "pubDate": "Sat, 07 Jun 2025 19:59:28 GMT"
    },
    {
      "title": "Trump threatens 'very serious consequences' if Elon Musk finances Republican challengers - USA Today",
      "pubDate": "Sat, 07 Jun 2025 21:14:17 GMT"
    },
    {
      "title": "Trump-Musk row fuels 'biggest crisis ever' at Nasa - BBC",
      "pubDate": "Sat, 07 Jun 2025 23:29:56 GMT"
    },
    {
      "title": "Trump threatens Musk with 'serious consequences' over spending bill feud - France 24",
      "pubDate": "Sat, 07 Jun 2025 18:23:10 GMT"
    },
    {
      "title": "Trump administration weighs broad cancellation of California funding - The Washington Post",
      "pubDate": "Sun, 08 Jun 2025 01:32:04 GMT"
    },
    {
      "title": "Trump to deploy National Guard in response to Los Angeles immigration protests - CNBC",
      "pubDate": "Sun, 08 Jun 2025 01:57:00 GMT"
    },
    {
      "title": "Trump Is Deploying National Guard Troops Under a Rarely Used Power - The New York Times",
      "pubDate": "Sun, 08 Jun 2025 02:46:47 GMT"
    },
    {
      "title": "Trump administration sending National Guard troops to L.A. amid clashes over raids - Los Angeles Times",
      "pubDate": "Sun, 08 Jun 2025 04:34:28 GMT"
    },
    {
      "title": "Live updates: Trump orders National Guard to L.A. after immigration raids trigger protests - The Washington Post",
      "pubDate": "Sun, 08 Jun 2025 05:15:01 GMT"
    },
    {
      "title": "Los Angeles protests live: Trump orders California National Guard be deployed after clashes over immigration raids - BBC",
      "pubDate": "Sun, 08 Jun 2025 06:00:37 GMT"
    },
    {
      "title": "How can Trump use the national guard on US soil? - The Guardian",
      "pubDate": "Sun, 08 Jun 2025 05:14:00 GMT"
    },
    {
      "title": "The Musk blowup reveals how Trump is remaking the presidency - CNN",
      "pubDate": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Musk vs Trump is a cautionary tale for Silicon Valley - Financial Times",
      "pubDate": "Sun, 08 Jun 2025 11:13:40 GMT"
    },
    {
      "title": "Los Angeles unrest: Is Trump allowed to deploy National Guard troops? - Al Jazeera",
      "pubDate": "Sun, 08 Jun 2025 14:26:15 GMT"
    },
    {
      "title": "Los Angeles protests live: First troops arrive in LA after Trump signs order to send 2,000 National Guardsmen - BBC",
      "pubDate": "Sun, 08 Jun 2025 16:23:02 GMT"
    },
    {
      "title": "Trump Means to Provoke, Not Pacify - The Atlantic",
      "pubDate": "Sun, 08 Jun 2025 18:15:00 GMT"
    },
    {
      "title": "Legal Issues Surround Trump’s Use of National Guard in LA Immigration Protests - The New York Times",
      "pubDate": "Sun, 08 Jun 2025 19:13:52 GMT"
    },
    {
      "title": "Los Angeles protests live: Trump vows to 'send whatever needed for law and order' as troops and protesters clash - BBC",
      "pubDate": "Sun, 08 Jun 2025 18:19:15 GMT"
    },
    {
      "title": "LA immigration protests live updates: Trump doesn't rule out sending active-duty Marines to California - ABC News",
      "pubDate": "Sun, 08 Jun 2025 21:39:00 GMT"
    },
    {
      "title": "Trump says he’s meeting with military leaders at Camp David - The Hill",
      "pubDate": "Sun, 08 Jun 2025 21:58:00 GMT"
    },
    {
      "title": "Judge declines to block Trump’s Corporation for Public Broadcasting board firings - The Hill",
      "pubDate": "Sun, 08 Jun 2025 22:48:00 GMT"
    },
    {
      "title": "Trump Calls on Qatar to Fund Kennedy Center’s MAGA Makeover - The Daily Beast",
      "pubDate": "Sun, 08 Jun 2025 23:28:00 GMT"
    },
    {
      "title": "LA immigration protests live updates: Cars in flames as National Guard, police work to disperse protests - ABC News",
      "pubDate": "Mon, 09 Jun 2025 01:27:00 GMT"
    },
    {
      "title": "Trump ignored Newsom in putting the National Guard in LA. That’s rare in US history - CalMatters",
      "pubDate": "Mon, 09 Jun 2025 01:44:15 GMT"
    },
    {
      "title": "What's happening in LA? Trump's controversial immigration crackdown explained - Australian Broadcasting Corporation",
      "pubDate": "Mon, 09 Jun 2025 03:46:38 GMT"
    },
    {
      "title": "Los Angeles protests live: tensions flare after Trump deploys hundreds of National Guard troops - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 04:44:45 GMT"
    },
    {
      "title": "Los Angeles protests live: LAPD calls for protestors to disperse as Trump says ‘bring in the troops’ - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 04:44:00 GMT"
    },
    {
      "title": "Trump news at a glance: California’s Newsom compares Trump to a ‘dictator’ over national guard deployment - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 02:00:02 GMT"
    },
    {
      "title": "LA immigration raid protests intensify after Trump deploys National Guard - France 24",
      "pubDate": "Sun, 08 Jun 2025 22:23:00 GMT"
    },
    {
      "title": "Donald Trump Authorizes Officials to Take 'Action Necessary to Liberate' LA - Newsweek",
      "pubDate": "Sun, 08 Jun 2025 22:25:13 GMT"
    },
    {
      "title": "Trump is invoking emergency powers at a record rate. Here's what that means - NPR",
      "pubDate": "Mon, 09 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Trump’s interest in Medicare cuts is a warning about Social Security too - MSNBC News",
      "pubDate": "Mon, 09 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "What Trump's national emergencies could mean for American democracy - NPR",
      "pubDate": "Mon, 09 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Live updates: Trump administration officials seek to repair frayed trade truce with China - The Washington Post",
      "pubDate": "Mon, 09 Jun 2025 13:41:31 GMT"
    },
    {
      "title": "US-China trade talks: Is a thaw on the cards after Trump-Xi call? - Al Jazeera",
      "pubDate": "Mon, 09 Jun 2025 13:51:12 GMT"
    },
    {
      "title": "Trump directs a new threat at Elon Musk, with an eye toward the 2026 midterm elections - MSNBC News",
      "pubDate": "Mon, 09 Jun 2025 12:46:44 GMT"
    },
    {
      "title": "Trump admin live updates: President to announce 'Trump savings accounts' for parents, guardians - ABC News",
      "pubDate": "Mon, 09 Jun 2025 16:47:00 GMT"
    },
    {
      "title": "A Trump Family Project Spurs Resignations and a Criminal Charge in Serbia - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 16:25:00 GMT"
    },
    {
      "title": "LA protests inch Elon Musk back to President Trump - CNN",
      "pubDate": "Mon, 09 Jun 2025 16:59:00 GMT"
    },
    {
      "title": "War of words between Trump and Newsom over LA protests escalates with arrest threat - ABC News",
      "pubDate": "Mon, 09 Jun 2025 19:07:35 GMT"
    },
    {
      "title": "Trump stumbles up the stairs to Air Force One, stoking memory of Biden tripping video - USA Today",
      "pubDate": "Mon, 09 Jun 2025 15:56:15 GMT"
    },
    {
      "title": "LA protests continue as California vows to sue Trump administration: Live updates - CNN",
      "pubDate": "Mon, 09 Jun 2025 21:49:00 GMT"
    },
    {
      "title": "Trump said it would be 'great' to arrest Newsom. Their stormy relationship and the politics at play - ABC News",
      "pubDate": "Mon, 09 Jun 2025 21:52:57 GMT"
    },
    {
      "title": "Trump endorses arrest of Gavin Newsom - KTLA",
      "pubDate": "Mon, 09 Jun 2025 18:04:37 GMT"
    },
    {
      "title": "Trump vows to \"HIT\" any protester who spits on police. He pardoned those who did far worse on Jan. 6 - AP News",
      "pubDate": "Tue, 10 Jun 2025 00:25:00 GMT"
    },
    {
      "title": "Trump asks the Supreme Court to neutralize the Convention Against Torture, in DHS v. D.V.D. - vox.com",
      "pubDate": "Mon, 09 Jun 2025 22:45:00 GMT"
    },
    {
      "title": "LA protests live: Trump sends another 2,000 National Guards and 700 Marines to LA on fourth day of unrest - BBC",
      "pubDate": "Mon, 09 Jun 2025 23:50:00 GMT"
    },
    {
      "title": "Trump authorizes additional 2,000 National Guard members to Los Angeles, US officials say - AP News",
      "pubDate": "Tue, 10 Jun 2025 04:42:00 GMT"
    },
    {
      "title": "President touts ‘Trump accounts’ that would create investments for American babies - The Washington Post",
      "pubDate": "Tue, 10 Jun 2025 03:19:00 GMT"
    },
    {
      "title": "LA protests live: Trump orders fresh troop deployment as unrest continues into fourth day - BBC",
      "pubDate": "Tue, 10 Jun 2025 05:51:00 GMT"
    },
    {
      "title": "Trump to California: Surrender - Time Magazine",
      "pubDate": "Mon, 09 Jun 2025 20:44:17 GMT"
    },
    {
      "title": "Trump Sends Additional Troops To LA As Immigration Protests Escalate - NDTV",
      "pubDate": "Tue, 10 Jun 2025 01:16:00 GMT"
    },
    {
      "title": "LA protesters and police in standoff as Trump doubles National Guard deployment - CNN",
      "pubDate": "Tue, 10 Jun 2025 10:03:00 GMT"
    },
    {
      "title": "Trump news at a glance: president ratchets up threats, troop deployment amid LA protests - The Guardian",
      "pubDate": "Tue, 10 Jun 2025 00:01:03 GMT"
    },
    {
      "title": "Live Updates: Hegseth to be grilled on Capitol Hill; Trump heading to Fort Bragg - The Washington Post",
      "pubDate": "Tue, 10 Jun 2025 12:18:38 GMT"
    },
    {
      "title": "Unstoppable force loses battle with immovable object: Elon bows to Trump - The Guardian",
      "pubDate": "Tue, 10 Jun 2025 13:01:00 GMT"
    },
    {
      "title": "Trump Says LA Would Be 'Burning to the Ground' Without Troops: Live Updates - Newsweek",
      "pubDate": "Tue, 10 Jun 2025 14:10:36 GMT"
    },
    {
      "title": "LA protests: Newsom says Trump 'deranged' as thousands more troops deployed - BBC",
      "pubDate": "Tue, 10 Jun 2025 13:50:13 GMT"
    },
    {
      "title": "Live updates: Trump warns that protesters at Army parade will be ‘met with very big force’ - The Washington Post",
      "pubDate": "Tue, 10 Jun 2025 17:09:13 GMT"
    },
    {
      "title": "LA protests live: Trump defends sending troops as anti-ICE rallies spread - Al Jazeera",
      "pubDate": "Tue, 10 Jun 2025 17:31:46 GMT"
    },
    {
      "title": "LA protests live: National Guard troops deployed as legal battle rages - BBC",
      "pubDate": "Tue, 10 Jun 2025 12:56:15 GMT"
    },
    {
      "title": "Live updates: Trump visits troops at Fort Bragg as he faces criticism for deploying military to LA - AP News",
      "pubDate": "Tue, 10 Jun 2025 20:41:00 GMT"
    },
    {
      "title": "Trump admin live updates: Trump announces Army bases will receive old names again - ABC News",
      "pubDate": "Tue, 10 Jun 2025 21:05:00 GMT"
    },
    {
      "title": "LA protests live: City's mayor tells Trump 'stop the raids' as protesters and police clash - BBC",
      "pubDate": "Tue, 10 Jun 2025 20:03:28 GMT"
    },
    {
      "title": "Trump reverses Army base names in latest DEI purge - Politico",
      "pubDate": "Tue, 10 Jun 2025 22:18:40 GMT"
    },
    {
      "title": "Republicans warn Trump that some deportations go too far - Axios",
      "pubDate": "Tue, 10 Jun 2025 23:33:27 GMT"
    },
    {
      "title": "LA protests against Trump ICE raids, curfew tonight, Chicago demonstrations: Live updates - CNN",
      "pubDate": "Wed, 11 Jun 2025 01:46:00 GMT"
    },
    {
      "title": "Trump says he will 'liberate' Los Angeles in speech to mark the 250th anniversary of the Army - AP News",
      "pubDate": "Wed, 11 Jun 2025 02:45:00 GMT"
    },
    {
      "title": "Trump Administration Live Updates: Protesters at Washington Military Parade Will Face ‘Heavy Force,’ President Says - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 00:41:00 GMT"
    },
    {
      "title": "LA protests: Trump vows to 'liberate' city as mayor imposes curfew - BBC",
      "pubDate": "Wed, 11 Jun 2025 03:42:54 GMT"
    },
    {
      "title": "Trump is hyping a case to use American troops on domestic soil - CNN",
      "pubDate": "Wed, 11 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "LA Protests Live Updates: Marines Deployed on Trump’s Orders Amid Muted Demonstrations - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 22:56:53 GMT"
    },
    {
      "title": "Americans react to Trump sending military into Los Angeles - BBC",
      "pubDate": "Wed, 11 Jun 2025 03:41:14 GMT"
    },
    {
      "title": "Musk says some of his posts about Trump 'went too far' - Reuters",
      "pubDate": "Wed, 11 Jun 2025 08:46:54 GMT"
    },
    {
      "title": "US appeals court keeps Trump tariffs in place while it considers a legal fight of 'exceptional importance' - Yahoo Finance",
      "pubDate": "Wed, 11 Jun 2025 10:27:43 GMT"
    },
    {
      "title": "Trump says China will supply rare earths in 'done' deal - CNBC",
      "pubDate": "Wed, 11 Jun 2025 12:22:16 GMT"
    },
    {
      "title": "Trump says he plans to phase out FEMA after 2025 hurricane season - CNN",
      "pubDate": "Wed, 11 Jun 2025 06:34:00 GMT"
    },
    {
      "title": "A year later, Trump continues to appeal his historic criminal case. Here's what we know - NPR",
      "pubDate": "Wed, 11 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Trump says a U.S.-China trade deal is 'done' - NPR",
      "pubDate": "Wed, 11 Jun 2025 15:49:19 GMT"
    },
    {
      "title": "Newsom and California confront Trump with a potential blueprint for Democrats - CNN",
      "pubDate": "Wed, 11 Jun 2025 15:32:00 GMT"
    },
    {
      "title": "Live updates: Protests spread to U.S. cities beyond L.A.; Chicago mayor calls Trump ‘authoritarian’ - The Washington Post",
      "pubDate": "Wed, 11 Jun 2025 19:41:59 GMT"
    },
    {
      "title": "Trump is under water on some of his top issues — including immigration, poll shows - Politico",
      "pubDate": "Wed, 11 Jun 2025 19:53:53 GMT"
    },
    {
      "title": "Live updates: White House accuses Newsom and Bass of fanning flames, siding with criminals - The Washington Post",
      "pubDate": "Wed, 11 Jun 2025 21:19:45 GMT"
    },
    {
      "title": "Trump says China tariffs will stay high after two days of talks - NBC News",
      "pubDate": "Wed, 11 Jun 2025 15:42:49 GMT"
    },
    {
      "title": "Bragg Soldiers Who Cheered Trump's Political Attacks While in Uniform Were Checked for Allegiance, Appearance - Military.com",
      "pubDate": "Wed, 11 Jun 2025 17:31:00 GMT"
    },
    {
      "title": "Musk Called Trump Privately Before Posting Message of ‘Regret’ - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 23:16:25 GMT"
    },
    {
      "title": "Trump 'gold card' website opens. Here's how to join the $5 million waitlist - USA Today",
      "pubDate": "Thu, 12 Jun 2025 00:57:45 GMT"
    },
    {
      "title": "Trump speech prompts concerns about politicization of military - NBC News",
      "pubDate": "Thu, 12 Jun 2025 01:16:00 GMT"
    },
    {
      "title": "Trump attends ‘Les Misérables’ at the Kennedy Center, drawing protesters and fans - NPR",
      "pubDate": "Thu, 12 Jun 2025 03:22:27 GMT"
    },
    {
      "title": "Trump's ongoing push to erase his criminal conviction lands in federal appeals court - NPR",
      "pubDate": "Wed, 11 Jun 2025 17:58:30 GMT"
    },
    {
      "title": "Trump launches website for $5m ‘gold card’ granting US residency - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 05:57:33 GMT"
    },
    {
      "title": "Musk backtracks on Trump criticism after White House outreach - Reuters",
      "pubDate": "Thu, 12 Jun 2025 00:24:37 GMT"
    },
    {
      "title": "Trump's dealmaker image hits a wall - Axios",
      "pubDate": "Thu, 12 Jun 2025 08:46:20 GMT"
    },
    {
      "title": "Trump's deployment of troops to LA prompts host of legal questions -- and a challenge from California - ABC News",
      "pubDate": "Thu, 12 Jun 2025 09:21:27 GMT"
    },
    {
      "title": "Trump administration live updates: House to vote on DOGE-backed cuts; David Hogg out at DNC - NBC News",
      "pubDate": "Thu, 12 Jun 2025 11:08:08 GMT"
    },
    {
      "title": "Trump wanted an Iran deal fast. Now he may get military confrontation - CNBC",
      "pubDate": "Thu, 12 Jun 2025 12:09:05 GMT"
    },
    {
      "title": "Majorities in key U.S. allies have no confidence in Trump's global leadership - NPR",
      "pubDate": "Thu, 12 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Trump is ‘not all there,’ Newsom says amid Los Angeles fight - Politico",
      "pubDate": "Thu, 12 Jun 2025 14:22:44 GMT"
    },
    {
      "title": "Trump presidency live updates: House set to vote on DOGE-inspired cuts to foreign aid, PBS, NPR - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 15:12:12 GMT"
    },
    {
      "title": "Trump administration live updates: Hegseth testifies again; Trump signs bill blocking California's gas-powered vehicle ban - NBC News",
      "pubDate": "Thu, 12 Jun 2025 16:46:22 GMT"
    },
    {
      "title": "Trump promises ‘unforgettable’ military parade in DC, but who is it for? - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 16:18:45 GMT"
    },
    {
      "title": "Donald Trump says he may ‘have to force something’ on interest rates - Financial Times",
      "pubDate": "Thu, 12 Jun 2025 18:07:39 GMT"
    },
    {
      "title": "Trump blocks California rules for greener vehicles and gas-powered car ban - The Guardian",
      "pubDate": "Thu, 12 Jun 2025 18:13:00 GMT"
    },
    {
      "title": "Prices for common baby items are rising due to Trump's tariffs, congressional analysis says - CNBC",
      "pubDate": "Thu, 12 Jun 2025 19:44:35 GMT"
    },
    {
      "title": "Trump administration tells 500,000 immigrants to 'self-deport' after revoking protections - CNBC",
      "pubDate": "Thu, 12 Jun 2025 21:56:20 GMT"
    },
    {
      "title": "Trump warns Israel could strike Iran; U.S. officials say no military support - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 22:58:48 GMT"
    },
    {
      "title": "Live updates: California senator removed after interrupting news conference by Kristi Noem - AP News",
      "pubDate": "Thu, 12 Jun 2025 23:37:00 GMT"
    },
    {
      "title": "Trump vows changes to immigration crackdown to protect migrant farmers, hotel workers - USA Today",
      "pubDate": "Thu, 12 Jun 2025 16:41:16 GMT"
    },
    {
      "title": "Trump administration blocked from deploying National Guard to LA - BBC",
      "pubDate": "Fri, 13 Jun 2025 01:26:10 GMT"
    },
    {
      "title": "The simple reason Trump didn't want Israel to attack Iran - MSNBC News",
      "pubDate": "Thu, 12 Jun 2025 23:57:00 GMT"
    },
    {
      "title": "Appeals court delays order that would have blocked Trump from continuing to deploy National Guard in California - ABC News",
      "pubDate": "Fri, 13 Jun 2025 04:18:45 GMT"
    },
    {
      "title": "Live updates: Appeals court pauses ruling requiring Trump to return control of National Guard to California - CNN",
      "pubDate": "Fri, 13 Jun 2025 05:27:00 GMT"
    },
    {
      "title": "Trump news at a glance: Democrats rage after Secret Service, FBI shove and handcuff senator - The Guardian",
      "pubDate": "Fri, 13 Jun 2025 05:42:00 GMT"
    },
    {
      "title": "Trump promises immigration order soon on farm and leisure workers - Reuters",
      "pubDate": "Thu, 12 Jun 2025 21:34:12 GMT"
    },
    {
      "title": "Donald Trump’s Dictator Cosplay - The New Yorker",
      "pubDate": "Thu, 12 Jun 2025 22:48:52 GMT"
    },
    {
      "title": "Trump urges Iran to reach nuclear deal 'before there is nothing left' - CNBC",
      "pubDate": "Fri, 13 Jun 2025 10:29:45 GMT"
    },
    {
      "title": "Millions in US expected to protest against Trump in ‘No Kings’ protests - The Guardian",
      "pubDate": "Fri, 13 Jun 2025 11:02:00 GMT"
    },
    {
      "title": "Trump: Israel attack on Iran 'excellent,' more to come -ABC interview - Reuters",
      "pubDate": "Fri, 13 Jun 2025 11:32:56 GMT"
    },
    {
      "title": "Trump Issues Grave Warning to Iran After Israeli Strikes: ‘No More Death, No More Destruction’ - Time Magazine",
      "pubDate": "Fri, 13 Jun 2025 14:26:15 GMT"
    },
    {
      "title": "Trump Warns Iran of ‘Even More Brutal’ Attacks Without Nuclear Deal: Live Updates - WSJ",
      "pubDate": "Fri, 13 Jun 2025 15:29:00 GMT"
    },
    {
      "title": "Live updates: Judge blocks Trump executive order on when ballots may be counted - The Washington Post",
      "pubDate": "Fri, 13 Jun 2025 16:47:09 GMT"
    },
    {
      "title": "Trump struggles with Iran message as Republicans diverge over attack - BBC",
      "pubDate": "Fri, 13 Jun 2025 16:25:54 GMT"
    },
    {
      "title": "Live updates: Iran launches missile counterattack on Israel after punishing airstrikes - USA Today",
      "pubDate": "Fri, 13 Jun 2025 19:14:35 GMT"
    },
    {
      "title": "'We knew everything,' Trump tells Reuters about Israel's strikes on Iran - Reuters",
      "pubDate": "Fri, 13 Jun 2025 18:14:28 GMT"
    },
    {
      "title": "Trump's Truth Social post highlights a key betrayal of farmers. Here's what he omits. - MSNBC News",
      "pubDate": "Fri, 13 Jun 2025 20:36:45 GMT"
    },
    {
      "title": "Trump Talks Big on Global Diplomacy, but His Goals Are in Tatters - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 16:59:44 GMT"
    },
    {
      "title": "Trump approves U.S. Steel merger with Japan’s Nippon after companies sign national security agreement - CNBC",
      "pubDate": "Fri, 13 Jun 2025 23:42:12 GMT"
    },
    {
      "title": "Trump says national security concerns in Nippon-U.S. Steel deal can be resolved - NBC News",
      "pubDate": "Fri, 13 Jun 2025 23:53:02 GMT"
    },
    {
      "title": "Trump Live Updates: Latest News on Tariffs, Voter ID and More - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 02:38:00 GMT"
    },
    {
      "title": "Trump Shifts Deportation Focus, Pausing Raids on Farms, Hotels and Eateries - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 02:38:40 GMT"
    },
    {
      "title": "Trump's financial disclosures reveal tens of millions in income from guitars, bibles and watches with his name on them - NBC News",
      "pubDate": "Fri, 13 Jun 2025 22:48:00 GMT"
    },
    {
      "title": "Hundreds of ‘No Kings’ protests and rallies planned for Saturday over Trump’s policies - AP News",
      "pubDate": "Fri, 13 Jun 2025 23:47:00 GMT"
    },
    {
      "title": "Trump is deeply obsessed with US history – but he has learned all the wrong lessons from it | David Reynolds - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 05:00:00 GMT"
    },
    {
      "title": "Why is Trump is having a military parade in Washington DC? - BBC",
      "pubDate": "Fri, 13 Jun 2025 22:50:23 GMT"
    },
    {
      "title": "Tanks to roll through Washington as Trump hosts US military parade - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 09:22:00 GMT"
    },
    {
      "title": "Millions of protesters are expected at ‘No Kings’ rallies nationwide as President Trump’s military parade takes place on his 79th birthday - CNN",
      "pubDate": "Sat, 14 Jun 2025 02:05:00 GMT"
    },
    {
      "title": "Trump's immigration response poses political risks - NPR",
      "pubDate": "Sat, 14 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Live updates: Donald Trump military festival kicks off; Middle East tensions heat up - The Hill",
      "pubDate": "Sat, 14 Jun 2025 13:10:00 GMT"
    },
    {
      "title": "Iran-Israel tensions and an unpredictable Trump to dominate G7 - Al Jazeera",
      "pubDate": "Sat, 14 Jun 2025 13:56:51 GMT"
    },
    {
      "title": "Live updates: Protests begin ahead of Donald Trump military parade; Minnesota lawmaker assassinated - The Hill",
      "pubDate": "Sat, 14 Jun 2025 16:11:00 GMT"
    },
    {
      "title": "Trump military parade live updates: D.C. onlookers line streets; 'No Kings' protests unfold nationwide - NBC News",
      "pubDate": "Sat, 14 Jun 2025 18:15:28 GMT"
    },
    {
      "title": "Trump knocks California on its heels: ‘He’s pulling the trigger on everything all at once.’ - Politico",
      "pubDate": "Sat, 14 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Trump speaks with Putin amid global flareups - Politico",
      "pubDate": "Sat, 14 Jun 2025 20:03:13 GMT"
    },
    {
      "title": "Trump says Putin called to wish him a happy birthday and talk Iran - USA Today",
      "pubDate": "Sat, 14 Jun 2025 20:49:18 GMT"
    },
    {
      "title": "Trump reports over $600 million in income in latest financial disclosure - The Washington Post",
      "pubDate": "Sat, 14 Jun 2025 21:49:21 GMT"
    },
    {
      "title": "Trump presides over military parade as protests take place across US - CNN",
      "pubDate": "Sat, 14 Jun 2025 22:45:00 GMT"
    },
    {
      "title": "Trump military parade live updates: Tanks, thousands of soldiers take to D.C. streets for Army’s birthday - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 00:09:23 GMT"
    },
    {
      "title": "Live Updates: Trump’s Military Parade Starts Early to Beat the Rain - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 01:31:00 GMT"
    },
    {
      "title": "Trump presides over a military parade amid turmoil at home and abroad - NBC News",
      "pubDate": "Sun, 15 Jun 2025 00:09:00 GMT"
    },
    {
      "title": "Donald Trump’s Military Birthday Parade Was a Gross Failure - Rolling Stone",
      "pubDate": "Sun, 15 Jun 2025 01:21:48 GMT"
    },
    {
      "title": "Trump administration considers adding 36 countries to travel ban list - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 01:19:12 GMT"
    },
    {
      "title": "Inside Trump’s Extraordinary Turnaround on Immigration Raids - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 00:18:39 GMT"
    },
    {
      "title": "Trump celebrates 'fighting spirit' of US armed forces during massive military parade in Washington - ABC News",
      "pubDate": "Sun, 15 Jun 2025 00:33:45 GMT"
    },
    {
      "title": "Trump: Iran will face American might ‘at levels never seen before’ if it attacks US - The Times of Israel",
      "pubDate": "Sun, 15 Jun 2025 07:10:19 GMT"
    },
    {
      "title": "Trump holds military parade amid ‘No Kings’ protests across US - Al Jazeera",
      "pubDate": "Sun, 15 Jun 2025 07:07:29 GMT"
    },
    {
      "title": "Trump threatens Iran with retaliation ‘at levels never seen before’ - politico.eu",
      "pubDate": "Sun, 15 Jun 2025 09:40:00 GMT"
    },
    {
      "title": "Trump, in reversal, may exempt farms and hotels from immigration raids - NBC News",
      "pubDate": "Sun, 15 Jun 2025 12:00:13 GMT"
    },
    {
      "title": "Trump and Melania's awkward moment during military parade celebration revealed by lip leader; ‘I pushed my finger…’ - Hindustan Times - Hindustan Times",
      "pubDate": "Sun, 15 Jun 2025 12:50:11 GMT"
    },
    {
      "title": "Trump's Harvard battle is making some students consider European universities instead - Business Insider",
      "pubDate": "Sun, 15 Jun 2025 09:17:00 GMT"
    },
    {
      "title": "Poll: Americans disapprove of Trump's performance, as Republicans manage splits over spending plans - NBC News",
      "pubDate": "Sun, 15 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Trump vetoed Israeli plan to kill Iran's supreme leader, US officials say - Reuters",
      "pubDate": "Sun, 15 Jun 2025 16:43:39 GMT"
    }
  ],
  "ukraine": [
    {
      "title": "Ukrainian drone strikes Russian Tu-22 bomber: SBU releases new footage of Operation Spiderweb - The Kyiv Independent",
      "pubDate": "Sat, 07 Jun 2025 23:03:45 GMT"
    },
    {
      "title": "Ukraine war latest: Kharkiv suffers its 'most powerful attack of entire war' - as Kyiv and Moscow prepare for prisoner swap - Sky News",
      "pubDate": "Sun, 08 Jun 2025 01:51:25 GMT"
    },
    {
      "title": "Ukraine war briefing: Putin yet to retaliate in full force over Operation Spiderweb, officials say - The Guardian",
      "pubDate": "Sun, 08 Jun 2025 01:34:00 GMT"
    },
    {
      "title": "Ukraine denies postponing prisoner swaps as Russian strike on Kharkiv kills four - Reuters",
      "pubDate": "Sat, 07 Jun 2025 22:08:40 GMT"
    },
    {
      "title": "Ukraine drones attack on Moscow forces airport closure, Russia says - CNBC",
      "pubDate": "Sun, 08 Jun 2025 05:12:10 GMT"
    },
    {
      "title": "Ukrainian drone attacks force airport shutdowns near Moscow, mayor says - The Kyiv Independent",
      "pubDate": "Sun, 08 Jun 2025 08:01:29 GMT"
    },
    {
      "title": "Ukraine drone barrage targets Moscow as Zelenskyy demands accountability for Putin - ABC News",
      "pubDate": "Sun, 08 Jun 2025 08:50:39 GMT"
    },
    {
      "title": "Ukraine Says It Has Stepped Up Its Drone Game, Again - The New York Times",
      "pubDate": "Sun, 08 Jun 2025 09:35:47 GMT"
    },
    {
      "title": "Russia shoots down 10 Ukrainian drones targeting Moscow - Al Jazeera",
      "pubDate": "Sun, 08 Jun 2025 09:13:42 GMT"
    },
    {
      "title": "Ukrainian drone attack on Moscow closes 2 major airports - politico.eu",
      "pubDate": "Sun, 08 Jun 2025 11:59:00 GMT"
    },
    {
      "title": "Putin unleashes a summer offensive to break Ukraine - The Economist",
      "pubDate": "Sun, 08 Jun 2025 14:46:21 GMT"
    },
    {
      "title": "Russia says it is sending more Ukrainian soldiers’ bodies to border amid spat over prisoner swap - CNN",
      "pubDate": "Sun, 08 Jun 2025 19:59:00 GMT"
    },
    {
      "title": "Russian forces claim new advance deeper into Ukraine, amid dispute over dead soldiers - CNN",
      "pubDate": "Sun, 08 Jun 2025 23:18:00 GMT"
    },
    {
      "title": "Russia Says Its Forces Reach Ukraine’s Dnipropetrovsk region - Bloomberg",
      "pubDate": "Sun, 08 Jun 2025 15:13:01 GMT"
    },
    {
      "title": "Ukraine denies Russian troop presence in Dnipropetrovsk Oblast amid offensive, describes situation as 'tense' - The Kyiv Independent",
      "pubDate": "Sun, 08 Jun 2025 15:43:13 GMT"
    },
    {
      "title": "Ukraine war briefing: Poland scrambles planes to secure airspace as Russia targets western Ukraine - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 03:20:00 GMT"
    },
    {
      "title": "Russia claims key Ukraine advance as peace talks stall - Yahoo",
      "pubDate": "Sun, 08 Jun 2025 18:03:12 GMT"
    },
    {
      "title": "Ukraine says Russia launches record overnight drone attack - WXII",
      "pubDate": "Mon, 09 Jun 2025 09:03:00 GMT"
    },
    {
      "title": "Ukraine Says Russia Launched Biggest Air Assault of the War - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 10:53:39 GMT"
    },
    {
      "title": "Putin launches biggest ever drone attack at Ukraine, Kyiv says - politico.eu",
      "pubDate": "Mon, 09 Jun 2025 11:19:44 GMT"
    },
    {
      "title": "Video Russia launches nearly 500 strikes across Ukraine - ABC News",
      "pubDate": "Mon, 09 Jun 2025 13:46:16 GMT"
    },
    {
      "title": "Russia hits Ukraine with record 479-drone strike ahead of POW swap - Al Jazeera",
      "pubDate": "Mon, 09 Jun 2025 12:45:00 GMT"
    },
    {
      "title": "Ukraine claims to have damaged Russian fighter jets in night-time raid - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 09:42:00 GMT"
    },
    {
      "title": "Ukraine says it hit Russian MiG-31, Su-30/34 fighter jets following attack on airfield - The Kyiv Independent",
      "pubDate": "Mon, 09 Jun 2025 07:28:44 GMT"
    },
    {
      "title": "Russia Won't End Ukraine War Until NATO 'Pulls Out' of Baltics: Moscow - Newsweek",
      "pubDate": "Mon, 09 Jun 2025 15:43:53 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Kyiv ‘damages more fighter jets in nighttime raid’ after success of Operation Spiderweb - The Independent",
      "pubDate": "Mon, 09 Jun 2025 21:23:34 GMT"
    },
    {
      "title": "Russia and Ukraine exchange prisoners of war - Reuters",
      "pubDate": "Mon, 09 Jun 2025 19:14:55 GMT"
    },
    {
      "title": "Russia and Ukraine begin new prisoner swap as drone war and front-line battle continue apace - CBS News",
      "pubDate": "Tue, 10 Jun 2025 00:01:05 GMT"
    },
    {
      "title": "Russia's latest drone strikes hit Kyiv, maternity ward in Odesa, Ukraine says - Reuters",
      "pubDate": "Tue, 10 Jun 2025 05:54:00 GMT"
    },
    {
      "title": "2 killed in Ukraine as Russia launches hundreds of drones, missiles - ABC News",
      "pubDate": "Tue, 10 Jun 2025 07:18:45 GMT"
    },
    {
      "title": "Russia launches one of war's largest air attacks on Kyiv - Reuters",
      "pubDate": "Tue, 10 Jun 2025 09:56:01 GMT"
    },
    {
      "title": "Russia-Ukraine war live: 3 people killed in Kyiv, Odesa in Russian attacks - Al Jazeera",
      "pubDate": "Tue, 10 Jun 2025 11:35:17 GMT"
    },
    {
      "title": "Sharp rise in Russian drone attacks on Ukrainian cities - BBC",
      "pubDate": "Tue, 10 Jun 2025 12:50:32 GMT"
    },
    {
      "title": "Attack drones buzz for hours over Kyiv - and they're getting more destructive - BBC",
      "pubDate": "Tue, 10 Jun 2025 12:50:32 GMT"
    },
    {
      "title": "Zelenskyy demands 'action from America' after latest Russian drone, missile attack - ABC News",
      "pubDate": "Tue, 10 Jun 2025 11:23:26 GMT"
    },
    {
      "title": "Ukraine's drone attacks temporarily halt flights in Moscow, across Russia - Reuters",
      "pubDate": "Tue, 10 Jun 2025 12:12:58 GMT"
    },
    {
      "title": "US to cut military aid to Ukraine, Hegseth says - The Kyiv Independent",
      "pubDate": "Tue, 10 Jun 2025 19:42:07 GMT"
    },
    {
      "title": "Ukraine war briefing: Deaths in Kharkiv as Russia continues strikes on civilian targets - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 00:05:00 GMT"
    },
    {
      "title": "Russia-Ukraine war updates: More prisoners exchanged despite major strikes - Al Jazeera",
      "pubDate": "Tue, 10 Jun 2025 22:30:00 GMT"
    },
    {
      "title": "Russia strikes Ukrainian defense industry facilities while Ukraine hits Russian military targets - bastillepost.com",
      "pubDate": "Wed, 11 Jun 2025 04:07:19 GMT"
    },
    {
      "title": "Russia hits Ukraine's Kharkiv with deadly nighttime barrage of drones - Reuters",
      "pubDate": "Wed, 11 Jun 2025 09:37:37 GMT"
    },
    {
      "title": "Russia drones hit Kharkiv and other parts of Ukraine - ABC News",
      "pubDate": "Wed, 11 Jun 2025 06:19:28 GMT"
    },
    {
      "title": "Ukraine war: 1,212 soldiers' bodies repatriated in latest swap with Russia - BBC",
      "pubDate": "Wed, 11 Jun 2025 16:50:02 GMT"
    },
    {
      "title": "Ukraine war latest: Moscow launches deadly strikes on Kharkiv as US says it will cut aid to Kyiv - Sky News",
      "pubDate": "Thu, 12 Jun 2025 01:41:36 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: ‘Severely wounded’ prisoners set for exchange after Kyiv receives 1,212 dead soldiers - The Independent",
      "pubDate": "Thu, 12 Jun 2025 07:03:21 GMT"
    },
    {
      "title": "Ukraine war live: Kyiv strikes factory near Moscow while prisoner exchange continues - The Independent",
      "pubDate": "Thu, 12 Jun 2025 08:31:00 GMT"
    },
    {
      "title": "Ukraine, NATO eye tech trials for intercepting Russia’s cabled drones - Defense News",
      "pubDate": "Thu, 12 Jun 2025 12:21:30 GMT"
    },
    {
      "title": "Ukraine keeps up pressure on Russian airfields and war production - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 14:54:08 GMT"
    },
    {
      "title": "Russia’s military casualties top 1 million in 3-year-old war, Ukraine says - AP News",
      "pubDate": "Thu, 12 Jun 2025 15:17:00 GMT"
    },
    {
      "title": "Ukraine blasts Russia Day well-wishers as Rubio sends greetings to Moscow - politico.eu",
      "pubDate": "Thu, 12 Jun 2025 16:09:02 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Kyiv claims Moscow has lost more than one million soldiers - The Independent",
      "pubDate": "Thu, 12 Jun 2025 16:15:43 GMT"
    },
    {
      "title": "Russia returns 1,200 bodies of fallen Ukrainian soldiers - Al Jazeera",
      "pubDate": "Fri, 13 Jun 2025 20:26:15 GMT"
    },
    {
      "title": "Russia’s Summer Offensive in Ukraine Gains Ground With New Tactics - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 09:01:24 GMT"
    },
    {
      "title": "Trump gave Putin a ‘two-week’ deadline to consider peace in Ukraine. Instead, Russia just launched more drones. - The Kyiv Independent",
      "pubDate": "Sat, 14 Jun 2025 12:28:36 GMT"
    },
    {
      "title": "Ukraine confirms drone strikes on Russian chemical plants tied to explosives production - The Kyiv Independent",
      "pubDate": "Sat, 14 Jun 2025 08:08:29 GMT"
    },
    {
      "title": "Zelenskyy warns oil price surge could help Russia’s war effort - AP News",
      "pubDate": "Sat, 14 Jun 2025 17:08:00 GMT"
    },
    {
      "title": "Ukraine war briefing: Putin tells Trump in phone call Moscow ready to resume peace talks - theguardian.com",
      "pubDate": "Sun, 15 Jun 2025 01:36:00 GMT"
    },
    {
      "title": "Zelensky calls for aid to Ukraine not to decrease in wake of Israel-Iran war - The Times of Israel",
      "pubDate": "Sat, 14 Jun 2025 19:33:21 GMT"
    },
    {
      "title": "Ukraine war crime trial: A Russian soldier takes the stand for an execution - BBC",
      "pubDate": "Sun, 15 Jun 2025 00:25:47 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Zelensky claims his troops ‘gradually pushing back’ Putin’s forces in Sumy - The Independent",
      "pubDate": "Sun, 15 Jun 2025 09:18:40 GMT"
    },
    {
      "title": "Russia says it struck oil refinery that supplies Ukrainian army with fuel - Reuters",
      "pubDate": "Sun, 15 Jun 2025 10:15:34 GMT"
    },
    {
      "title": "Russia launches fresh massive aerial attack on Ukraine. 2 Khinzal missiles downed - Euronews.com",
      "pubDate": "Sun, 15 Jun 2025 11:15:18 GMT"
    },
    {
      "title": "Ukraine drone attack on Russia’s Tatarstan region leaves at least 1 dead, 13 injured - ABC News",
      "pubDate": "Sun, 15 Jun 2025 16:09:51 GMT"
    }
  ],
  "recession": [
    {
      "title": "The existing formula that compact cars sell well in the economic recession is expected to be broken - 매일경제",
      "pubDate": "Sun, 08 Jun 2025 03:57:08 GMT"
    },
    {
      "title": "Bitcoin (BTC) Climbs Despite ETF Outflows as US Recession Fears Ease - FXEmpire",
      "pubDate": "Sun, 08 Jun 2025 06:00:00 GMT"
    },
    {
      "title": "Moody’s Chief Economist on Recession Fears and How Politics Shapes the Economy - WSJ",
      "pubDate": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "'No recession bet whatsoever': The stock market isn't pricing in any sort of economic downturn, investment firm says - Business Insider",
      "pubDate": "Sun, 08 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Recession Risk After The Jobs Report - Forbes",
      "pubDate": "Sun, 08 Jun 2025 13:19:46 GMT"
    },
    {
      "title": "Klarna CEO warns AI may cause a recession as the technology comes for white-collar jobs - Business Insider",
      "pubDate": "Sun, 08 Jun 2025 17:55:00 GMT"
    },
    {
      "title": "Japan’s Economy at Risk of Technical Recession, Revised Data Shows - WSJ",
      "pubDate": "Mon, 09 Jun 2025 00:37:00 GMT"
    },
    {
      "title": "No recession signs in US, fears are overblown: Milken’s William Lee - CNBC TV18",
      "pubDate": "Mon, 09 Jun 2025 04:37:19 GMT"
    },
    {
      "title": "Recession Odds Still High if Trump Doesn’t Reverse Course, Analyst Warns - Cryptodnes.bg",
      "pubDate": "Mon, 09 Jun 2025 06:29:25 GMT"
    },
    {
      "title": "Survey: Recession fears, trade uncertainty fuel economic pessimism - Public News Service",
      "pubDate": "Mon, 09 Jun 2025 07:02:38 GMT"
    },
    {
      "title": "Trump actions could force a recession for colleges, R.I. higher ed leader says - The Boston Globe",
      "pubDate": "Mon, 09 Jun 2025 09:03:11 GMT"
    },
    {
      "title": "Market Talk: Expect a slowdown in the US but no recession - Reuters",
      "pubDate": "Mon, 09 Jun 2025 11:00:38 GMT"
    },
    {
      "title": "As more customers default on BNPL loans, Klarna’s CEO predicts AI will cause a recession - Fortune",
      "pubDate": "Mon, 09 Jun 2025 14:47:00 GMT"
    },
    {
      "title": "CEO recession expectations decline from April scare, survey says - CNBC",
      "pubDate": "Mon, 09 Jun 2025 16:33:37 GMT"
    },
    {
      "title": "Recession Watch Metrics - Calculated Risk",
      "pubDate": "Mon, 09 Jun 2025 17:49:00 GMT"
    },
    {
      "title": "Diners are eating like a recession is coming: Crain's Daily Gist podcast - Crain's Chicago Business",
      "pubDate": "Mon, 09 Jun 2025 10:31:18 GMT"
    },
    {
      "title": "Fingers crossed! Talks to avoid recession begin - Boston Herald",
      "pubDate": "Mon, 09 Jun 2025 20:42:42 GMT"
    },
    {
      "title": "Is TaskRabbit a new recession indicator? Its CEO says applications to be a 'Tasker' have spiked - Business Insider",
      "pubDate": "Tue, 10 Jun 2025 09:01:00 GMT"
    },
    {
      "title": "Most CEOs aren't expecting a recession anytime soon, survey finds - CBS News",
      "pubDate": "Tue, 10 Jun 2025 15:10:12 GMT"
    },
    {
      "title": "Libraries and rec centers at risk as San Diego officals grapple with budget cuts - Axios",
      "pubDate": "Tue, 10 Jun 2025 13:39:49 GMT"
    },
    {
      "title": "Goldman Sachs Predicts Stock Market Rally, Says Recession ‘Not in the Base Case’ – Here’s Why - The Daily Hodl",
      "pubDate": "Tue, 10 Jun 2025 18:42:13 GMT"
    },
    {
      "title": "World Bank sees slowest global growth outside recession since 2008 - TradingView",
      "pubDate": "Tue, 10 Jun 2025 14:46:17 GMT"
    },
    {
      "title": "Frozen pizza sales could be a key indicator of a recession - The Week",
      "pubDate": "Wed, 11 Jun 2025 06:00:00 GMT"
    },
    {
      "title": "US-China relations improve, yet industrial recession remains likely - Oxford Economics",
      "pubDate": "Wed, 11 Jun 2025 09:37:42 GMT"
    },
    {
      "title": "Recession Risk Looms Over a US Stock Market That Wants to Rally - Bloomberg",
      "pubDate": "Wed, 11 Jun 2025 18:15:01 GMT"
    },
    {
      "title": "Recession Nails: How to Save Money Without Skipping the Mani - NBC News",
      "pubDate": "Wed, 11 Jun 2025 18:35:00 GMT"
    },
    {
      "title": "Number of CEOs expecting recession drops - WCNC",
      "pubDate": "Wed, 11 Jun 2025 22:54:00 GMT"
    },
    {
      "title": "Recession not imminent in Eurozone, big four: Oxford Economics - Fibre2Fashion",
      "pubDate": "Thu, 12 Jun 2025 02:50:07 GMT"
    },
    {
      "title": "How should GCC investors prepare for the coming US recession? - Arabian Gulf Business Insight | AGBI",
      "pubDate": "Thu, 12 Jun 2025 11:15:16 GMT"
    },
    {
      "title": "Goldman Sachs trims US recession probability to 30% - Reuters",
      "pubDate": "Thu, 12 Jun 2025 13:48:21 GMT"
    },
    {
      "title": "Goldman Cuts Recession Odds, Boosts GDP Prediction - TipRanks",
      "pubDate": "Thu, 12 Jun 2025 15:35:21 GMT"
    },
    {
      "title": "CEO Says AI Will Replace So Many Jobs That It’ll Cause a Major Recession - futurism.com",
      "pubDate": "Thu, 12 Jun 2025 13:12:34 GMT"
    },
    {
      "title": "Goldman Cuts Recession Odds to 30% - TradingView",
      "pubDate": "Thu, 12 Jun 2025 19:27:46 GMT"
    },
    {
      "title": "Recession Watch: My Favorite Recession Indicator, Mid-June Update - Seeking Alpha",
      "pubDate": "Thu, 12 Jun 2025 19:50:00 GMT"
    },
    {
      "title": "WA agencies see largest wave of layoffs since Great Recession - The Seattle Times",
      "pubDate": "Thu, 12 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "US Recession Fears Are Finally Cooling Off: Risk Drops to Just 25% - The Tradable",
      "pubDate": "Thu, 12 Jun 2025 19:56:02 GMT"
    },
    {
      "title": "Recession Threat Is Back—and Maybe Something Worse - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "America’s Brutal Economic Choice - Is a Recession the Price of Survival? - MSN",
      "pubDate": "Fri, 13 Jun 2025 08:14:07 GMT"
    },
    {
      "title": "CEO Warns AI Will Plunge America into Recession - MSN",
      "pubDate": "Fri, 13 Jun 2025 09:40:55 GMT"
    },
    {
      "title": "Recession already underway, market still asleep, Rosenberg warns - KITCO",
      "pubDate": "Fri, 13 Jun 2025 09:57:00 GMT"
    },
    {
      "title": "House of Representatives passes recession package that strips NPR, PBS funding - cbs19.tv",
      "pubDate": "Fri, 13 Jun 2025 12:16:00 GMT"
    },
    {
      "title": "Analyst predicts recession during library talk - South Jersey Media",
      "pubDate": "Fri, 13 Jun 2025 19:00:00 GMT"
    },
    {
      "title": "'Recession risks alive' as Canada's manufacturing numbers suffer under Trump tariff regime - Financial Post",
      "pubDate": "Fri, 13 Jun 2025 18:07:17 GMT"
    },
    {
      "title": "Trump's tariffs and tax bill look like a 'Greek tragedy' that could tank the economy and stocks, former IMF official warns - Business Insider",
      "pubDate": "Sat, 14 Jun 2025 09:10:00 GMT"
    },
    {
      "title": "The optimism recession: Why American workforce is worried now more than ever despite stable jobs - Times of India",
      "pubDate": "Sat, 14 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Will the Fed Rescue Markets from Recession Fears? | Macro Money - MSN",
      "pubDate": "Sun, 15 Jun 2025 12:21:19 GMT"
    }
  ],
  "russia": [
    {
      "title": "Exclusive: US believes Russia response to Ukraine drone attack not over yet, expects multi-pronged strike - Reuters",
      "pubDate": "Sat, 07 Jun 2025 23:57:15 GMT"
    },
    {
      "title": "Russian Drone Swarms Test a Volunteer Air-Defense Unit Near Kyiv - The New York Times",
      "pubDate": "Sun, 08 Jun 2025 09:01:43 GMT"
    },
    {
      "title": "Russia claims to have pushed into central Ukrainian region for first time - CNN",
      "pubDate": "Sun, 08 Jun 2025 14:48:00 GMT"
    },
    {
      "title": "Putin Warned of Dual Threat to Russian Economy: 'Countdown to a Crisis' - Newsweek",
      "pubDate": "Sun, 08 Jun 2025 14:12:17 GMT"
    },
    {
      "title": "Russian forces closing in on Sumy city three years after Ukraine forced them out of region - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 01:30:00 GMT"
    },
    {
      "title": "Russian intelligence document calls China ‘the enemy’, leak exposes Moscow’s deep fear - Mint",
      "pubDate": "Sun, 08 Jun 2025 21:44:57 GMT"
    },
    {
      "title": "Putin approves big revamp of Russia's navy, Kremlin aide says - Reuters",
      "pubDate": "Mon, 09 Jun 2025 06:07:00 GMT"
    },
    {
      "title": "Russia ready to attack Nato by 2030, warns alliance chief - The Telegraph",
      "pubDate": "Mon, 09 Jun 2025 16:06:43 GMT"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,202 - Al Jazeera",
      "pubDate": "Tue, 10 Jun 2025 02:55:36 GMT"
    },
    {
      "title": "Massive Russian drone attack slams Kyiv and hits maternity hospital in Odesa, Ukrainian officials say - CNN",
      "pubDate": "Tue, 10 Jun 2025 09:08:00 GMT"
    },
    {
      "title": "U.S. Teacher Seized by Russia Is Located in Prison - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 09:03:36 GMT"
    },
    {
      "title": "EU announces punishing sanctions targeting Russian energy and banks - politico.eu",
      "pubDate": "Tue, 10 Jun 2025 14:33:57 GMT"
    },
    {
      "title": "EU's new Russia sanctions to target energy sector and banks - Reuters",
      "pubDate": "Tue, 10 Jun 2025 13:41:21 GMT"
    },
    {
      "title": "EU Proposes Nord Stream Ban, Cutting Oil Price Cap to Hit Russia - WSJ",
      "pubDate": "Tue, 10 Jun 2025 16:17:00 GMT"
    },
    {
      "title": "Europe heaps harsh sanctions on Russia, saying ‘strength is the only language’ Moscow understands - CNN",
      "pubDate": "Tue, 10 Jun 2025 16:26:00 GMT"
    },
    {
      "title": "European Union Unveils Fresh Sanctions on Russia, Including a Nord Stream Ban - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 18:24:28 GMT"
    },
    {
      "title": "After 3 days of consecutive attacks on Ukraine, Russia calls UN meeting over alleged European 'threats to peace' - The Kyiv Independent",
      "pubDate": "Tue, 10 Jun 2025 17:25:05 GMT"
    },
    {
      "title": "Russia fines Apple for violating 'LGBT propaganda' law, TASS reports - Reuters",
      "pubDate": "Tue, 10 Jun 2025 15:24:45 GMT"
    },
    {
      "title": "Russian attacks kill three as drones hit Kharkiv - AP News",
      "pubDate": "Wed, 11 Jun 2025 09:02:00 GMT"
    },
    {
      "title": "Russian Offensive Campaign Assessment, June 11, 2025 - Institute for the Study of War",
      "pubDate": "Thu, 12 Jun 2025 01:23:39 GMT"
    },
    {
      "title": "Russian War Losses Pass Grim 1-Million Milestone - Newsweek",
      "pubDate": "Thu, 12 Jun 2025 08:31:59 GMT"
    },
    {
      "title": "Russia Relocates Strategic Bombers After Ukraine's 'Spider's Web' Drone Attack - The Moscow Times",
      "pubDate": "Thu, 12 Jun 2025 11:56:17 GMT"
    },
    {
      "title": "Russia Responds to Israel's Strikes on Iran: 'Full-Scale War' Possible - Newsweek",
      "pubDate": "Fri, 13 Jun 2025 09:45:12 GMT"
    },
    {
      "title": "Russia’s offensive pushes closer to northern city of Sumy, opens new front - The Washington Post",
      "pubDate": "Sat, 14 Jun 2025 09:47:07 GMT"
    },
    {
      "title": "US Opposes European Push to Lower G-7 Price Cap on Russian Oil - Bloomberg.com",
      "pubDate": "Sat, 14 Jun 2025 16:25:48 GMT"
    },
    {
      "title": "Russia is shifting tactics again, assaulting Ukrainian cities with swarms of killer drones - CNN",
      "pubDate": "Sun, 15 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Russia Says It Struck Kremenchuk Oil Refinery in Central Ukraine - Bloomberg.com",
      "pubDate": "Sun, 15 Jun 2025 11:01:20 GMT"
    }
  ],
  "israel": [
    {
      "title": "Israel is accused of the gravest war crimes in Gaza - BBC",
      "pubDate": "Sun, 08 Jun 2025 04:31:59 GMT"
    },
    {
      "title": "Israel vows to prevent an aid boat carrying Greta Thunberg and other activists from reaching Gaza - AP News",
      "pubDate": "Sun, 08 Jun 2025 12:55:00 GMT"
    },
    {
      "title": "Israel intercepts Gaza-bound aid ship, detaining Greta Thunberg and other prominent activists - CNN",
      "pubDate": "Mon, 09 Jun 2025 03:12:00 GMT"
    },
    {
      "title": "Israel seized a Gaza-bound boat with Greta Thunberg on board. Can it do that? - AP News",
      "pubDate": "Mon, 09 Jun 2025 19:28:00 GMT"
    },
    {
      "title": "Pressure Rises on Israel as U.K., Canada and Others Impose Sanctions on 2 Far-Right Ministers - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 17:48:21 GMT"
    },
    {
      "title": "LIVE: Israel kills 120 Palestinians across Gaza in 24 hours - Al Jazeera",
      "pubDate": "Wed, 11 Jun 2025 13:16:49 GMT"
    },
    {
      "title": "Trump tells Netanyahu to end Gaza war and stop Iran threats, source says, as US ramps up pressure on Israel - CNN",
      "pubDate": "Wed, 11 Jun 2025 15:21:00 GMT"
    },
    {
      "title": "Israel is poised to launch operation on Iran, sources say - CBS News",
      "pubDate": "Thu, 12 Jun 2025 00:40:49 GMT"
    },
    {
      "title": "Israeli gunfire, strikes kill 120 Palestinians in Gaza, many at aid sites - Al Jazeera",
      "pubDate": "Wed, 11 Jun 2025 20:53:17 GMT"
    },
    {
      "title": "Israeli forces kill at least 60 Palestinians seeking food in Gaza, health officials say - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 22:33:09 GMT"
    },
    {
      "title": "Israel targets Iran's nuclear sites and military commanders in major attack - BBC",
      "pubDate": "Fri, 13 Jun 2025 03:21:25 GMT"
    },
    {
      "title": "Live updates: Israel strikes Iran; head of Revolutionary Guard killed in Tehran - The Washington Post",
      "pubDate": "Fri, 13 Jun 2025 05:12:02 GMT"
    },
    {
      "title": "Israel launches strikes on Iran's nuclear sites and other targets; Iran launches retaliatory drone strike - CBS News",
      "pubDate": "Fri, 13 Jun 2025 06:35:00 GMT"
    },
    {
      "title": "Israel strikes live updates: US provided 'exquisite' intel to Israel: Source - ABC News",
      "pubDate": "Fri, 13 Jun 2025 13:26:00 GMT"
    },
    {
      "title": "Live updates: Explosions heard in Tel Aviv as Iran launches missiles in response to Israeli strikes - The Washington Post",
      "pubDate": "Fri, 13 Jun 2025 18:52:27 GMT"
    },
    {
      "title": "What to Know About the Israeli Strike on Iran - CSIS | Center for Strategic and International Studies",
      "pubDate": "Fri, 13 Jun 2025 13:48:34 GMT"
    },
    {
      "title": "Israel used long-planned subterfuge in attack on Iranian nuclear targets, Israeli sources say - Reuters",
      "pubDate": "Fri, 13 Jun 2025 16:46:12 GMT"
    },
    {
      "title": "Israel Smuggled Explosive Drones Into Iran to Target Weapons - WSJ",
      "pubDate": "Sat, 14 Jun 2025 00:06:36 GMT"
    },
    {
      "title": "Live updates: Israel attacks Iran, explosions in Tel Aviv and Tehran, US position - CNN",
      "pubDate": "Sat, 14 Jun 2025 03:46:00 GMT"
    },
    {
      "title": "Live updates: Iranian missiles target Israel in retaliation for earlier strikes - The Washington Post",
      "pubDate": "Sat, 14 Jun 2025 05:04:01 GMT"
    },
    {
      "title": "Israel Attacks Iran News LIVE: Three Iran Nuclear Scientists Killed In New Israel Attack - NDTV",
      "pubDate": "Sat, 14 Jun 2025 10:38:33 GMT"
    },
    {
      "title": "Live updates: Waves of airstrikes in Iran and Israel as exchange of fire enters second day - NBC News",
      "pubDate": "Sat, 14 Jun 2025 11:31:51 GMT"
    },
    {
      "title": "Iranian Retaliatory Attacks Kill Three in Israel - WSJ",
      "pubDate": "Sat, 14 Jun 2025 12:42:00 GMT"
    },
    {
      "title": "Live updates: Israel warns ‘Tehran will burn’ if Iranian strikes continue - CNN",
      "pubDate": "Sat, 14 Jun 2025 13:34:00 GMT"
    },
    {
      "title": "Israel-Iran live updates: IDF resumes striking targets in Tehran - ABC News",
      "pubDate": "Sat, 14 Jun 2025 16:26:00 GMT"
    },
    {
      "title": "Live: Israel strikes Iranian gas field, Iran vows ‘heavy’ response - Al Jazeera",
      "pubDate": "Sat, 14 Jun 2025 19:05:24 GMT"
    },
    {
      "title": "Israel says attacks on Iran are nothing compared with what is coming - Reuters",
      "pubDate": "Sat, 14 Jun 2025 20:33:23 GMT"
    },
    {
      "title": "Israel and Iran strike at each other in new wave of attacks - Reuters",
      "pubDate": "Sat, 14 Jun 2025 21:48:34 GMT"
    },
    {
      "title": "Israel-Iran Live Updates: 'Tehran Is Burning,' Israeli Defense Minister Says; Iran Fires More Missiles - WSJ",
      "pubDate": "Sun, 15 Jun 2025 00:29:00 GMT"
    },
    {
      "title": "Israel targets Iran's Defense Ministry headquarters as Tehran unleashes deadly missile strike - AP News",
      "pubDate": "Sun, 15 Jun 2025 03:37:00 GMT"
    },
    {
      "title": "At least eight killed in Iranian strikes on Israel while Israeli attacks set Tehran oil depot on fire – live updates - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 03:59:00 GMT"
    },
    {
      "title": "Israel’s attack on Iran has a real chance of bringing about regime change - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Israel-Iran Attack LIVE: Iran Missiles Kill 10 In Israel Amid Trump's Big Warning To Tehran - NDTV",
      "pubDate": "Sun, 15 Jun 2025 08:32:26 GMT"
    },
    {
      "title": "Live updates: 13 killed by Iranian strikes on Israel, Trump warned Iran against attacking U.S. assets - NBC News",
      "pubDate": "Sun, 15 Jun 2025 09:43:50 GMT"
    },
    {
      "title": "Israel Bombed World's Largest Gas Field In Iran. Why It Is A Big Deal - NDTV",
      "pubDate": "Sun, 15 Jun 2025 05:22:18 GMT"
    },
    {
      "title": "Israel Bombards Tehran, Setting Oil Facilities Ablaze - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 06:01:00 GMT"
    },
    {
      "title": "LIVE: Iran defends retaliatory strikes on Israel; new blasts rock Tehran - Al Jazeera",
      "pubDate": "Sun, 15 Jun 2025 06:14:58 GMT"
    },
    {
      "title": "Israel-Iran live updates: 13 killed in Israel by 2 nights of Iranian strikes, Netanyahu says - ABC News",
      "pubDate": "Sun, 15 Jun 2025 13:24:00 GMT"
    },
    {
      "title": "Israel’s Attack in Iran Echoes Its Strategy Against Hezbollah - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 09:40:16 GMT"
    },
    {
      "title": "Israel attacks world’s largest gas field in Iran: What will be the impact? - Firstpost",
      "pubDate": "Sun, 15 Jun 2025 09:39:31 GMT"
    },
    {
      "title": "Israelis nationwide told to enter shelters amid Iranian missile attack - The Times of Israel",
      "pubDate": "Sun, 15 Jun 2025 10:36:33 GMT"
    }
  ],
  "inflation": [
    {
      "title": "ECB’s Central Rate Scenario May Need Fine-Tuning, Escriva Says - Bloomberg.com",
      "pubDate": "Sun, 08 Jun 2025 09:11:26 GMT"
    },
    {
      "title": "Bank of America resets Fed interest rate cut forecast - TheStreet",
      "pubDate": "Fri, 13 Jun 2025 01:11:49 GMT"
    },
    {
      "title": "Meat costs have rocketed, say Derby food business owners - BBC",
      "pubDate": "Sun, 15 Jun 2025 06:08:11 GMT"
    },
    {
      "title": "U.S. could lose more immigrants than it gains for first time in 50 years - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 10:02:20 GMT"
    }
  ],
  "artificial_intelligence": [
    {
      "title": "Judge in Britain warns of risk to justice after lawyers cited fake AI-generated cases in court - Los Angeles Times",
      "pubDate": "Sat, 07 Jun 2025 18:39:49 GMT"
    },
    {
      "title": "Got $3,000? 1 Artificial Intelligence (AI) Stock to Buy and Hold for the Long Term. - Yahoo Finance",
      "pubDate": "Sat, 07 Jun 2025 20:00:00 GMT"
    },
    {
      "title": "AI leaders have a new term for the fact that their models are not always so intelligent - Business Insider",
      "pubDate": "Sat, 07 Jun 2025 20:55:00 GMT"
    },
    {
      "title": "Apple under pressure to shine after AI stumble - The Economic Times",
      "pubDate": "Sun, 08 Jun 2025 03:38:39 GMT"
    },
    {
      "title": "Europe’s Mistral benefits from search for artificial intelligence alternatives - Financial Times",
      "pubDate": "Sun, 08 Jun 2025 04:00:01 GMT"
    },
    {
      "title": "Apple’s struggles to update Siri lead to investor concerns over AI strategy - Financial Times",
      "pubDate": "Sun, 08 Jun 2025 04:00:01 GMT"
    },
    {
      "title": "AI analysis says Dead Sea Scrolls are older than thought - upi.com",
      "pubDate": "Sat, 07 Jun 2025 19:46:52 GMT"
    },
    {
      "title": "Multimodal Artificial Intelligence Using Endoscopic USG, CT, and MRI to Differentiate Between Serous and Mucinous Cystic Neoplasms - Cureus",
      "pubDate": "Sun, 08 Jun 2025 07:23:07 GMT"
    },
    {
      "title": "QVAC: the open-source platform that aims to decentralize artificial intelligence (AI) - The Cryptonomist",
      "pubDate": "Sun, 08 Jun 2025 07:00:00 GMT"
    },
    {
      "title": "Warren Buffett Might Not Own These Artificial Intelligence (AI) Stocks -- but Their Fundamentals Check Out - The Globe and Mail",
      "pubDate": "Sun, 08 Jun 2025 09:42:25 GMT"
    },
    {
      "title": "US attacks on science and research a ‘great gift’ to China on artificial intelligence, former OpenAI board member says - The Guardian",
      "pubDate": "Sun, 08 Jun 2025 15:01:00 GMT"
    },
    {
      "title": "Research on artificial intelligence, machine and deep learning in medicine: global characteristics, readiness, and equity - Globalization and Health",
      "pubDate": "Sun, 08 Jun 2025 19:24:47 GMT"
    },
    {
      "title": "Warren Buffett's AI Bets: 22% of Berkshire Hathaway's $282 Billion Stock Portfolio Is in These 2 Artificial Intelligence Stocks - Yahoo Finance",
      "pubDate": "Sun, 08 Jun 2025 11:30:00 GMT"
    },
    {
      "title": "Ohio State Announces Decision on Students Using Artificial Intelligence - Men's Journal",
      "pubDate": "Sun, 08 Jun 2025 17:46:33 GMT"
    },
    {
      "title": "How Artificial Intelligence is changing policing - WBFF",
      "pubDate": "Sun, 08 Jun 2025 12:43:37 GMT"
    },
    {
      "title": "Microsoft Plans to Rank AI Models by Safety - PYMNTS.com",
      "pubDate": "Sun, 08 Jun 2025 23:23:56 GMT"
    },
    {
      "title": "Meta Reportedly Exploring $10 Billion-Plus Investment in Scale AI - PYMNTS.com",
      "pubDate": "Sun, 08 Jun 2025 23:15:00 GMT"
    },
    {
      "title": "Anthropic Open-sources Tool to Trace the \"Thoughts\" of Large Language Models - infoq.com",
      "pubDate": "Sun, 08 Jun 2025 17:00:12 GMT"
    },
    {
      "title": "AI transforms sightseeing for visually impaired users - News-Medical",
      "pubDate": "Mon, 09 Jun 2025 00:05:00 GMT"
    },
    {
      "title": "Apple Heads Into Annual Showcase Reeling From AI Missteps, Tech Upheaval and Trump's Trade War - U.S. News & World Report",
      "pubDate": "Mon, 09 Jun 2025 02:44:00 GMT"
    },
    {
      "title": "AI models still far from AGI-level reasoning: Apple researchers - Cointelegraph",
      "pubDate": "Mon, 09 Jun 2025 04:31:18 GMT"
    },
    {
      "title": "OpenAI Bans ChatGPT Accounts Used by Russian, Iranian and Chinese Hacker Groups - The Hacker News",
      "pubDate": "Mon, 09 Jun 2025 06:45:00 GMT"
    },
    {
      "title": "Getty's landmark UK lawsuit on copyright and AI set to begin - Reuters",
      "pubDate": "Mon, 09 Jun 2025 06:35:00 GMT"
    },
    {
      "title": "AI Infrastructure Trade Roars Back as Tech Giants Boost Spending - Bloomberg",
      "pubDate": "Mon, 09 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "Large language models in urban planning - Nature",
      "pubDate": "Mon, 09 Jun 2025 10:31:15 GMT"
    },
    {
      "title": "Keir Starmer says technology can create a ‘better future’ as he addresses AI fears - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 11:28:00 GMT"
    },
    {
      "title": "Artificial Intelligence on Campus - Cambridge University Press & Assessment",
      "pubDate": "Mon, 09 Jun 2025 11:16:27 GMT"
    },
    {
      "title": "Getty argues its landmark UK copyright case does not threaten AI - Reuters",
      "pubDate": "Mon, 09 Jun 2025 11:30:20 GMT"
    },
    {
      "title": "Amazon plans to invest $20 billion in Pennsylvania to expand cloud computing infrastructure and advance AI innovation - About Amazon",
      "pubDate": "Mon, 09 Jun 2025 14:35:28 GMT"
    },
    {
      "title": "Lecturers are struggling with students’ use of AI - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 15:32:00 GMT"
    },
    {
      "title": "Apple's WWDC keynote is just hours away. Here's what to expect. - MarketWatch",
      "pubDate": "Mon, 09 Jun 2025 15:50:00 GMT"
    },
    {
      "title": "Advanced AI suffers ‘complete accuracy collapse’ in face of complex problems, study finds - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 17:39:00 GMT"
    },
    {
      "title": "Apple unveils new operating system and AI capabilities - ABC News",
      "pubDate": "Mon, 09 Jun 2025 18:31:28 GMT"
    },
    {
      "title": "Meta in Talks to Invest Billions in Scale AI - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 20:31:36 GMT"
    },
    {
      "title": "Amazon invests historic $20 billion for artificial intelligence infrastructure in Pa. - Pittsburgh Post-Gazette",
      "pubDate": "Mon, 09 Jun 2025 21:20:32 GMT"
    },
    {
      "title": "Apple unveils new AI features at WWDC 25: What it means for iPhone users - USA Today",
      "pubDate": "Mon, 09 Jun 2025 18:33:45 GMT"
    },
    {
      "title": "Rep. Obernolte (R-CA) discusses L.A. protests and Artificial Intelligence - The Hill",
      "pubDate": "Mon, 09 Jun 2025 23:50:00 GMT"
    },
    {
      "title": "Apple AI boffins puncture AGI hype as reasoning models flail on complex planning - theregister.com",
      "pubDate": "Mon, 09 Jun 2025 17:47:00 GMT"
    },
    {
      "title": "Apple to give app developers access to its artificial intelligence models - Financial Times",
      "pubDate": "Mon, 09 Jun 2025 19:29:29 GMT"
    },
    {
      "title": "AI And Machine Learning Operationalization Software Market May - openPR.com",
      "pubDate": "Tue, 10 Jun 2025 04:33:08 GMT"
    },
    {
      "title": "Academic Publishers Sign AI Deals as Trump Cuts Research Funding - Bloomberg",
      "pubDate": "Tue, 10 Jun 2025 05:00:00 GMT"
    },
    {
      "title": "OpenAI reaches $10B in annual recurring revenue as ChatGPT adoption accelerates - SiliconANGLE",
      "pubDate": "Mon, 09 Jun 2025 23:05:26 GMT"
    },
    {
      "title": "Meta Is Creating a New A.I. Lab to Pursue ‘Superintelligence’ - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 07:18:31 GMT"
    },
    {
      "title": "Is ChatGPT Down? What We Know About OpenAI Outage Reports - Newsweek",
      "pubDate": "Tue, 10 Jun 2025 09:35:14 GMT"
    },
    {
      "title": "Tesla’s self-driving future under threat from China's auto, tech giants - Reuters",
      "pubDate": "Tue, 10 Jun 2025 05:04:00 GMT"
    },
    {
      "title": "Zuckerberg Is Personally Recruiting New ‘Superintelligence’ AI Team at Meta - Bloomberg.com",
      "pubDate": "Tue, 10 Jun 2025 13:41:59 GMT"
    },
    {
      "title": "Meta forming new AI lab helmed by Scale AI CEO Alex Wang, report says - CNBC",
      "pubDate": "Tue, 10 Jun 2025 14:09:56 GMT"
    },
    {
      "title": "F.D.A. Looks to A.I. to Enhance Efficiency - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 15:00:05 GMT"
    },
    {
      "title": "Mark Zuckerberg is reportedly recruiting a team to build a ‘superintelligence’ - CNN",
      "pubDate": "Tue, 10 Jun 2025 12:46:00 GMT"
    },
    {
      "title": "Apple may be the only tech company getting AI right, actually - CNN",
      "pubDate": "Tue, 10 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "AI system rolled out to boost rail safety and maintenance - Times of India",
      "pubDate": "Tue, 10 Jun 2025 12:02:00 GMT"
    },
    {
      "title": "France's Mistral launches Europe's first AI reasoning model - Reuters",
      "pubDate": "Tue, 10 Jun 2025 21:19:45 GMT"
    },
    {
      "title": "Apple Expands OpenAI Partnership Amid Rising AI Pressures - PYMNTS.com",
      "pubDate": "Tue, 10 Jun 2025 23:01:41 GMT"
    },
    {
      "title": "Mark Zuckerberg, ‘Frustrated’ by Llama 4, Assembles Meta ‘Superintelligence’ Team - RetailWire",
      "pubDate": "Tue, 10 Jun 2025 19:48:59 GMT"
    },
    {
      "title": "Researchers develop cybersecurity test for AI being used by Google - Rochester Institute of Technology",
      "pubDate": "Tue, 10 Jun 2025 17:26:29 GMT"
    },
    {
      "title": "Meta takes $15 billion stake in Scale AI in bid to catch competitors - The Washington Post",
      "pubDate": "Wed, 11 Jun 2025 03:37:48 GMT"
    },
    {
      "title": "How AI guided Ukraine’s drones to hit Russian airfields - Financial Times",
      "pubDate": "Wed, 11 Jun 2025 04:00:09 GMT"
    },
    {
      "title": "Meta commits absurd money to top Google, Microsoft in critical race - TheStreet",
      "pubDate": "Wed, 11 Jun 2025 00:33:00 GMT"
    },
    {
      "title": "The rise of artificial intelligence can make college degrees 'out of date': Upskill in AI or fall behind, says expert - CNBC",
      "pubDate": "Wed, 11 Jun 2025 06:15:34 GMT"
    },
    {
      "title": "Is Meta Creating An Uncontrollable Superintelligence? - Cointribune",
      "pubDate": "Wed, 11 Jun 2025 08:05:00 GMT"
    },
    {
      "title": "Artificial Intelligence Is Unlocking the Secrets of Black Holes - WIRED",
      "pubDate": "Wed, 11 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "NOAA debuts artificial intelligence models for hurricane season - FOX 13 Tampa Bay",
      "pubDate": "Wed, 11 Jun 2025 03:14:07 GMT"
    },
    {
      "title": "AI’s biggest secret: we can shape it - Prospect Magazine",
      "pubDate": "Wed, 11 Jun 2025 03:51:44 GMT"
    },
    {
      "title": "Meta to announce $15bn investment in bid to achieve computerised ‘superintelligence’ - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 13:46:00 GMT"
    },
    {
      "title": "The war is on for Congress’ AI law ban - The Verge",
      "pubDate": "Wed, 11 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Nvidia CEO Rebuts Anthropic CEO’s Dire Prediction of AI Taking Jobs - PYMNTS.com",
      "pubDate": "Wed, 11 Jun 2025 20:25:53 GMT"
    },
    {
      "title": "Why the Pope cares so much about AI - Politico",
      "pubDate": "Wed, 11 Jun 2025 20:59:20 GMT"
    },
    {
      "title": "Sam Altman says the robots are coming! How AGI will shape our future according to the CEO of OpenAI - TechRadar",
      "pubDate": "Wed, 11 Jun 2025 11:16:14 GMT"
    },
    {
      "title": "Meta Takes Next Steps Towards the Development of True Artificial Intelligence - Social Media Today",
      "pubDate": "Wed, 11 Jun 2025 21:03:17 GMT"
    },
    {
      "title": "Artificial intelligence: Disney and Universal sue Midjourney over copyright - BBC",
      "pubDate": "Thu, 12 Jun 2025 00:11:26 GMT"
    },
    {
      "title": "Disney, Universal sue AI company for copying Minions, Avengers and ‘Star Wars’ characters - Los Angeles Times",
      "pubDate": "Wed, 11 Jun 2025 17:47:23 GMT"
    },
    {
      "title": "Disney and Universal Sue A.I. Firm for Copyright Infringement - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 19:17:17 GMT"
    },
    {
      "title": "Forget AGI - Meta is going after 'superintelligence' now - ZDNET",
      "pubDate": "Wed, 11 Jun 2025 20:32:00 GMT"
    },
    {
      "title": "Meta’s Bold Push for AGI with Top Talent Recruitment - WebProNews",
      "pubDate": "Wed, 11 Jun 2025 20:30:13 GMT"
    },
    {
      "title": "Meta Debuts AI to Help Robots ‘Understand the Physical World’ - PYMNTS.com",
      "pubDate": "Thu, 12 Jun 2025 00:22:30 GMT"
    },
    {
      "title": "OpenAI’s Sam Altman: AI may already have surpassed human intelligence - MarketWatch",
      "pubDate": "Thu, 12 Jun 2025 08:41:00 GMT"
    },
    {
      "title": "Artificial Intelligence and Defensive Modernisation - Modern Diplomacy",
      "pubDate": "Thu, 12 Jun 2025 06:30:42 GMT"
    },
    {
      "title": "Artificial intelligence technology helps ALS patient regain their voice - WQAD",
      "pubDate": "Thu, 12 Jun 2025 11:42:00 GMT"
    },
    {
      "title": "Zero-Click AI Vulnerability Exposes Microsoft 365 Copilot Data Without User Interaction - The Hacker News",
      "pubDate": "Thu, 12 Jun 2025 11:11:00 GMT"
    },
    {
      "title": "Google DeepMind just changed hurricane forecasting forever with new AI model - VentureBeat",
      "pubDate": "Thu, 12 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Artificial intelligence debate makes its way into courtrooms across the nation - KFOX",
      "pubDate": "Thu, 12 Jun 2025 18:37:29 GMT"
    },
    {
      "title": "Barbie maker Mattel and OpenAI partner to develop AI-powered toys - CBS News",
      "pubDate": "Thu, 12 Jun 2025 22:24:30 GMT"
    },
    {
      "title": "Sam Altman says the Singularity is imminent - here's why - ZDNET",
      "pubDate": "Thu, 12 Jun 2025 17:14:00 GMT"
    },
    {
      "title": "Could artificial intelligence make war and peace decisions? - Johns Hopkins University",
      "pubDate": "Thu, 12 Jun 2025 19:11:00 GMT"
    },
    {
      "title": "Meta invests $14.3B in AI firm Scale and recruits its CEO for 'superintelligence' team - ABC News",
      "pubDate": "Fri, 13 Jun 2025 02:36:29 GMT"
    },
    {
      "title": "Could Artificial Intelligence solve construction worker accidents? - News 5 Cleveland WEWS",
      "pubDate": "Fri, 13 Jun 2025 01:23:52 GMT"
    },
    {
      "title": "MGCCC, Mississippi Artificial Intelligence Network weigh in on state's new AI initiative - WLOX",
      "pubDate": "Thu, 12 Jun 2025 22:54:11 GMT"
    },
    {
      "title": "Meta invests $15bn in Scale AI, doubling start-up’s valuation - Financial Times",
      "pubDate": "Fri, 13 Jun 2025 02:00:22 GMT"
    },
    {
      "title": "Meta’s Bold AGI Ambitions: Poaching Talent and Intensifying the AI Race - BBN Times",
      "pubDate": "Thu, 12 Jun 2025 22:44:44 GMT"
    },
    {
      "title": "Opinion | Artificial intelligence, Trump and the Future: 13 Gen Z-ers Discuss - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 09:03:14 GMT"
    },
    {
      "title": "They Asked ChatGPT Questions. The Answers Sent Them Spiraling. - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 09:00:39 GMT"
    },
    {
      "title": "Anthropic says looking to power European tech with hiring push - The Paintsville Herald",
      "pubDate": "Fri, 13 Jun 2025 04:22:54 GMT"
    },
    {
      "title": "Meta poaches 28-year-old Scale AI CEO after taking multibillion dollar stake in startup - Reuters",
      "pubDate": "Fri, 13 Jun 2025 11:53:25 GMT"
    },
    {
      "title": "US Moves to Ease Rules Hindering Self-Driving Cars, Like Tesla (TSLA) Cybercab - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 16:31:11 GMT"
    },
    {
      "title": "Meta Invests $14.3 Billion in AI Startup Scale AI, Accelerating Race Toward Superintelligence - The Bridge Chronicle",
      "pubDate": "Fri, 13 Jun 2025 14:31:10 GMT"
    },
    {
      "title": "Nvidia is nixing China from its financial forecasts because U.S. restrictions on chip sales have tightened so much, Jensen Huang says - Fortune",
      "pubDate": "Fri, 13 Jun 2025 17:29:00 GMT"
    },
    {
      "title": "AI is Bringing New Hope to the Undiagnosed - Fast Company",
      "pubDate": "Fri, 13 Jun 2025 20:36:52 GMT"
    },
    {
      "title": "Meta's $14.3 Billion AI Power Play: Why Zuckerberg Just Bet Big on Scale AI - Yahoo",
      "pubDate": "Fri, 13 Jun 2025 17:38:39 GMT"
    },
    {
      "title": "Meta officially ‘acqui-hires’ Scale AI — will it draw regulator scrutiny? - Computerworld",
      "pubDate": "Fri, 13 Jun 2025 20:25:00 GMT"
    },
    {
      "title": "Meta Invests $14.3 Billion in Scale AI as Zuckerberg Builds New Artificial Intelligence Team - TheWrap",
      "pubDate": "Fri, 13 Jun 2025 15:05:56 GMT"
    },
    {
      "title": "The Deficit Narrative May Find Its Cure In Artificial Intelligence - Seeking Alpha",
      "pubDate": "Fri, 13 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "The acceptance of ophthalmic artificial intelligence for eye diseases: a literature review and qualitative analysis - Nature",
      "pubDate": "Fri, 13 Jun 2025 22:37:26 GMT"
    },
    {
      "title": "Rates Of Hallucination In AI Models From Google, OpenAI On The Rise - Yahoo Finance",
      "pubDate": "Fri, 13 Jun 2025 17:31:38 GMT"
    },
    {
      "title": "Altman pines for 'gentle singularity' and Meta makes $14 billion bet: Week in AI - San Francisco Business Times - The Business Journals",
      "pubDate": "Fri, 13 Jun 2025 21:20:00 GMT"
    },
    {
      "title": "Workers in UK need to embrace AI or risk being left behind, minister says - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 06:00:00 GMT"
    },
    {
      "title": "Artificial intelligence (AI) - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 06:02:52 GMT"
    },
    {
      "title": "TotalEnergies to Collaborate with Mistral AI to Increase the Application of Artificial Intelligence in its Multi-Energy Strategy - TotalEnergies.com",
      "pubDate": "Sat, 14 Jun 2025 05:11:38 GMT"
    },
    {
      "title": "3 No-Brainer Artificial Intelligence (AI) Growth Stocks to Buy With $200 Right Now - Yahoo Finance",
      "pubDate": "Sat, 14 Jun 2025 09:55:00 GMT"
    },
    {
      "title": "Man found not guilty on all counts at trial over AI robocalls sent to New Hampshire primary voters - WMUR",
      "pubDate": "Sat, 14 Jun 2025 00:01:00 GMT"
    },
    {
      "title": "Toledo athletics embracing artificial intelligence with arms wide open - Toledo Blade",
      "pubDate": "Sat, 14 Jun 2025 12:21:47 GMT"
    },
    {
      "title": "US experts fear all vaccines at risk as Trump officials target mRNA jabs - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Arkansas Advocate: Arkansas Supreme Court releases proposed rule for artificial intelligence - Magnolia Reporter",
      "pubDate": "Sat, 14 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Artificial intelligence consumes massive amounts of energy. Here's why - Le Monde.fr",
      "pubDate": "Sat, 14 Jun 2025 18:30:05 GMT"
    },
    {
      "title": "How Artificial Intelligence Can Analyze Market Sentiment to Decrypt Public Opinion - Insider Monkey",
      "pubDate": "Sat, 14 Jun 2025 12:44:15 GMT"
    },
    {
      "title": "Amazon signs nuclear energy deal to power AI data centers - Cointelegraph",
      "pubDate": "Sat, 14 Jun 2025 21:02:56 GMT"
    },
    {
      "title": "Investors need to take a leap of faith on artificial intelligence - The Times",
      "pubDate": "Sat, 14 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "Bitcoin must upgrade or fall victim to quantum computing in 5 years - Cointelegraph",
      "pubDate": "Sat, 14 Jun 2025 15:02:36 GMT"
    },
    {
      "title": "Teaching artificial intelligence writing hurts student creativity - North Texas Daily",
      "pubDate": "Sat, 14 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "Meet Goku, the Chinese quant fund with AI ambitions beyond finance - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 01:00:18 GMT"
    },
    {
      "title": "Artificial intelligence models are vulnerable to inherent human biases, says an expert - Telegraph India",
      "pubDate": "Sun, 15 Jun 2025 03:39:51 GMT"
    },
    {
      "title": "UN Sounds Alarm On AI Nearing Human-Like Intelligence 'AGI', Urges Action - NDTV",
      "pubDate": "Sun, 15 Jun 2025 03:41:26 GMT"
    },
    {
      "title": "Big tech on a quest for ideal AI device - Yahoo",
      "pubDate": "Sun, 15 Jun 2025 02:09:00 GMT"
    },
    {
      "title": "Revealed: Thousands of UK university students caught cheating using AI - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 07:01:00 GMT"
    },
    {
      "title": "WEBINAR (7/17/25): \"Artificial Intelligence (AI) Risks and Threats to National Security\" Hosted By Defense Counterintelligence and Security Agency - Small Wars Journal",
      "pubDate": "Sun, 15 Jun 2025 02:10:11 GMT"
    },
    {
      "title": "UN Flags Risks Of Advancing Human-Like AI, Calls For Urgent Action - Oneindia",
      "pubDate": "Sun, 15 Jun 2025 09:04:42 GMT"
    },
    {
      "title": "Warren Buffett Has $90 Billion Invested in These 9 Artificial Intelligence (AI) Stocks. Here's the Best of the Bunch. - The Globe and Mail",
      "pubDate": "Sun, 15 Jun 2025 09:58:30 GMT"
    },
    {
      "title": "AI and future of jobs: Here’s what top tech CEOs Sam Altman, Jensen Huang are saying - The Indian Express",
      "pubDate": "Sun, 15 Jun 2025 11:41:28 GMT"
    },
    {
      "title": "Jersey and Guernsey leaders discuss AI at British-Irish summit - BBC",
      "pubDate": "Sun, 15 Jun 2025 11:14:00 GMT"
    },
    {
      "title": "Trump must stop the AI bloodbath before it’s too late - The Hill",
      "pubDate": "Sun, 15 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Scientists Discover a New Type of Magnetism That Could Improve Computer Memory by “Orders of Magnitude” - The Debrief",
      "pubDate": "Sun, 15 Jun 2025 13:00:41 GMT"
    }
  ],
  "financial_markets": [
    {
      "title": "Markets start to gear up for summer drama - TheStreet",
      "pubDate": "Sun, 08 Jun 2025 09:14:52 GMT"
    },
    {
      "title": "US stocks drift and Chinese markets rise as trade talks start between the world’s largest economies - Boston Herald",
      "pubDate": "Mon, 09 Jun 2025 14:06:45 GMT"
    },
    {
      "title": "BlackRock’s Bitcoin ETF becomes fastest-ever ETF to accumulate $70 billion - Fortune",
      "pubDate": "Mon, 09 Jun 2025 19:21:00 GMT"
    },
    {
      "title": "Bitcoin, US crypto stocks rise as more firms plan BTC buys - Cointelegraph",
      "pubDate": "Tue, 10 Jun 2025 04:17:34 GMT"
    },
    {
      "title": "BlackRock’s Bitcoin fund blows past $70B in record pace for ETFs - Cointelegraph",
      "pubDate": "Tue, 10 Jun 2025 04:03:14 GMT"
    },
    {
      "title": "Bitcoin surges to $108,000 as top US and Chinese officials meet to discuss tariffs - Fortune",
      "pubDate": "Tue, 10 Jun 2025 10:01:40 GMT"
    },
    {
      "title": "Stock market today: Dow, S&P 500, Nasdaq tread water in wait for clues on US-China trade talks - Yahoo Finance",
      "pubDate": "Tue, 10 Jun 2025 13:33:23 GMT"
    },
    {
      "title": "US Stocks Drift Higher as Traders Eye US-China Trade Talks - Bloomberg.com",
      "pubDate": "Tue, 10 Jun 2025 13:41:48 GMT"
    },
    {
      "title": "In China, fears grow of an EV financial crisis amid pricing war - CNBC",
      "pubDate": "Tue, 10 Jun 2025 16:57:34 GMT"
    },
    {
      "title": "Bitcoin Pulls Back After Latest Push Toward Record Falls Short - Bloomberg.com",
      "pubDate": "Tue, 10 Jun 2025 15:47:05 GMT"
    },
    {
      "title": "Global Banks Scramble to Hire Top Talent in Booming Japan - Bloomberg.com",
      "pubDate": "Tue, 10 Jun 2025 21:00:15 GMT"
    },
    {
      "title": "Stock valuations are historically high, and are hovering near levels that have preceded big downturns, Pimco said. - Business Insider",
      "pubDate": "Wed, 11 Jun 2025 11:54:00 GMT"
    },
    {
      "title": "Fed seen on track to start cutting rates by September - Reuters",
      "pubDate": "Wed, 11 Jun 2025 13:48:36 GMT"
    },
    {
      "title": "Stocks dip, dollar sags as trade, geopolitical tensions weigh - Reuters",
      "pubDate": "Thu, 12 Jun 2025 06:10:31 GMT"
    },
    {
      "title": "Oil prices surge over 7%, U.S. stock futures fall as Israel strikes Iran - MarketWatch",
      "pubDate": "Fri, 13 Jun 2025 00:24:00 GMT"
    },
    {
      "title": "Oil prices surge 11% on heels of Israeli strikes - CNBC",
      "pubDate": "Fri, 13 Jun 2025 00:46:00 GMT"
    },
    {
      "title": "Stocks tumble, oil soars as Israel's strike on Iran jolts markets - Reuters",
      "pubDate": "Fri, 13 Jun 2025 06:16:00 GMT"
    },
    {
      "title": "Oil Prices Surge and Stock Markets Stumble After Israel Attacks Iran - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 07:24:00 GMT"
    },
    {
      "title": "Global oil prices soar after Israel attacks Iran - BBC",
      "pubDate": "Fri, 13 Jun 2025 07:36:40 GMT"
    },
    {
      "title": "European stocks lose ground after Israel launches air strikes on Iran - CNBC",
      "pubDate": "Fri, 13 Jun 2025 10:36:00 GMT"
    },
    {
      "title": "Israel strikes Iran in major escalation: How the markets are reacting - InvestmentNews",
      "pubDate": "Fri, 13 Jun 2025 10:36:13 GMT"
    },
    {
      "title": "Dow futures fall more than 300 points after Israel strikes Iran, spiking oil prices: Live updates - CNBC",
      "pubDate": "Fri, 13 Jun 2025 12:39:00 GMT"
    },
    {
      "title": "Israel launches major strike on Iran: What is the market fallout? - Euronews.com",
      "pubDate": "Fri, 13 Jun 2025 08:14:33 GMT"
    },
    {
      "title": "Oil prices jump 7% and stocks drop as Israel-Iran tensions escalate - CNN",
      "pubDate": "Fri, 13 Jun 2025 20:06:00 GMT"
    },
    {
      "title": "Wall St ends sharply lower as Iran retaliates against Israel attack - Reuters",
      "pubDate": "Fri, 13 Jun 2025 20:18:46 GMT"
    },
    {
      "title": "The economic risks of Israel's Iran attack - Axios",
      "pubDate": "Fri, 13 Jun 2025 15:59:26 GMT"
    },
    {
      "title": "Stock market today: Dow, S&P 500, Nasdaq dive, oil surges as Israel and Iran trade strikes - Yahoo Finance",
      "pubDate": "Fri, 13 Jun 2025 20:03:35 GMT"
    },
    {
      "title": "Financial Markets Wall Street - timesdaily.com",
      "pubDate": "Fri, 13 Jun 2025 19:47:00 GMT"
    },
    {
      "title": "The attacks in the Middle East could make it harder for the Fed to cut rates - MSN",
      "pubDate": "Sat, 14 Jun 2025 07:21:17 GMT"
    },
    {
      "title": "Macroscope | How the obsession with risky assets is putting global finance in peril - South China Morning Post",
      "pubDate": "Sat, 14 Jun 2025 08:30:07 GMT"
    },
    {
      "title": "Dow Jones Futures: Israel-Iran Attacks Hit Market; The Next AI Winners After Nvidia, Broadcom? - Investor's Business Daily",
      "pubDate": "Sat, 14 Jun 2025 12:02:00 GMT"
    },
    {
      "title": "Household loans continue to increase in June on heated housing, stock markets - Yonhap News Agency",
      "pubDate": "Sun, 15 Jun 2025 02:07:43 GMT"
    },
    {
      "title": "Markets on war footing as oil spike threatens ASX rally - AFR",
      "pubDate": "Sun, 15 Jun 2025 02:25:00 GMT"
    },
    {
      "title": "Corporate bond defaults disappear from China’s onshore market - Financial Times",
      "pubDate": "Sun, 15 Jun 2025 04:00:32 GMT"
    },
    {
      "title": "How Escalating Tensions in the Middle East Could Impact Global Financial Markets - Investing.com",
      "pubDate": "Sun, 15 Jun 2025 11:04:28 GMT"
    }
  ],
  "us_foreign_policy": [
    {
      "title": "U.S. and Kenya Conclude Successful 2025 African Chiefs of Defense Conference in Nairobi - africom.mil",
      "pubDate": "Tue, 10 Jun 2025 12:14:53 GMT"
    },
    {
      "title": "US preparing to partially evacuate Iraq embassy over regional security risks, sources say - Reuters",
      "pubDate": "Wed, 11 Jun 2025 20:11:37 GMT"
    },
    {
      "title": "U.S. shrinks presence in Middle East amid fears of Israeli strike on Iran - The Washington Post",
      "pubDate": "Wed, 11 Jun 2025 23:08:46 GMT"
    },
    {
      "title": "Oil prices surge on fears of escalation between US and Iran - Financial Times",
      "pubDate": "Wed, 11 Jun 2025 20:35:57 GMT"
    },
    {
      "title": "US judge says Trump can’t cite foreign policy as grounds to detain Columbia activist - The Times of Israel",
      "pubDate": "Thu, 12 Jun 2025 03:50:26 GMT"
    },
    {
      "title": "US Marks Russia Day for First Time Since Invasion of Ukraine - Bloomberg",
      "pubDate": "Thu, 12 Jun 2025 14:51:46 GMT"
    },
    {
      "title": "Sanctions on Russia are working - Financial Times",
      "pubDate": "Thu, 12 Jun 2025 10:00:58 GMT"
    },
    {
      "title": "US defense official: US ready to defend PH despite growing China military - GMA Network",
      "pubDate": "Fri, 13 Jun 2025 10:11:21 GMT"
    },
    {
      "title": "US helps defend Israel from Iranian missile attack - Defense News",
      "pubDate": "Fri, 13 Jun 2025 20:42:24 GMT"
    },
    {
      "title": "US Helps Israel Shoot Down Barrage of Iranian Missiles - Military.com",
      "pubDate": "Fri, 13 Jun 2025 20:48:45 GMT"
    },
    {
      "title": "Israel urges U.S. to join war with Iran to eliminate nuclear program - Axios",
      "pubDate": "Sat, 14 Jun 2025 22:28:28 GMT"
    }
  ],
  "trade_war": [
    {
      "title": "How Trump’s trade war is supercharging the fast fashion industry - The Conversation",
      "pubDate": "Sun, 08 Jun 2025 20:14:09 GMT"
    },
    {
      "title": "New disputes emerge ahead of US-China trade talks in London - AP News",
      "pubDate": "Mon, 09 Jun 2025 01:52:00 GMT"
    },
    {
      "title": "US and China kick off fresh round of trade talks in London over intractable issues - CNN",
      "pubDate": "Mon, 09 Jun 2025 08:21:00 GMT"
    },
    {
      "title": "US and China to take second shot at averting trade war in London talks - Al Jazeera",
      "pubDate": "Mon, 09 Jun 2025 10:28:33 GMT"
    },
    {
      "title": "Shein seen boosting Indian manufacturing as U.S.-China trade war shakes up supply chains - CNBC",
      "pubDate": "Mon, 09 Jun 2025 14:09:01 GMT"
    },
    {
      "title": "Trump tariff revenue soars 78%. Who’s paying them? - NPR",
      "pubDate": "Mon, 09 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "US soybean farmers move to reduce dependence on China as trade war grinds on - South China Morning Post",
      "pubDate": "Mon, 09 Jun 2025 13:00:11 GMT"
    },
    {
      "title": "The U.S and the Chinese cases for having more trade war leverage - Axios",
      "pubDate": "Mon, 09 Jun 2025 16:21:06 GMT"
    },
    {
      "title": "US-China trade war sideswipes Europe’s carmakers - politico.eu",
      "pubDate": "Tue, 10 Jun 2025 03:30:00 GMT"
    },
    {
      "title": "From Visas to Jets, US and China Are Finding New Trade Leverage - Bloomberg",
      "pubDate": "Tue, 10 Jun 2025 09:00:40 GMT"
    },
    {
      "title": "World Bank Forecast Underscores Cost of U.S. Trade War - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 13:30:04 GMT"
    },
    {
      "title": "U.S., China reach \"framework\" to activate Geneva trade deal - Axios",
      "pubDate": "Wed, 11 Jun 2025 00:38:18 GMT"
    },
    {
      "title": "US, China reach deal to ease export curbs, keep tariff truce alive - Reuters",
      "pubDate": "Wed, 11 Jun 2025 01:55:00 GMT"
    },
    {
      "title": "US, China Officials Agree on Plan to Reduce Trade Tensions - Bloomberg.com",
      "pubDate": "Wed, 11 Jun 2025 00:54:00 GMT"
    },
    {
      "title": "The US and China have agreed on a framework to resolve their trade disputes - AP News",
      "pubDate": "Wed, 11 Jun 2025 03:55:00 GMT"
    },
    {
      "title": "US and China agree framework deal to extend trade war truce - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 01:46:00 GMT"
    },
    {
      "title": "Trump says ‘relationship is excellent’ with China after exports deal sealed - The Independent",
      "pubDate": "Wed, 11 Jun 2025 15:24:00 GMT"
    },
    {
      "title": "U.S.-China Trade Deal: Trump Tariffs Stay; Bessent Calls Talks an ‘Excellent Start’ - Barron's",
      "pubDate": "Wed, 11 Jun 2025 18:18:00 GMT"
    },
    {
      "title": "Trump tariffs live updates: Bessent suggests pause extension, US-China trade framework takes shape - Yahoo Finance",
      "pubDate": "Wed, 11 Jun 2025 19:24:14 GMT"
    },
    {
      "title": "Exclusive | China Puts Six-Month Limit on Its Ease of Rare-Earth Export Licenses - WSJ",
      "pubDate": "Wed, 11 Jun 2025 21:10:00 GMT"
    },
    {
      "title": "US trade war enters precarious slow grind - Reuters",
      "pubDate": "Thu, 12 Jun 2025 07:03:08 GMT"
    },
    {
      "title": "US-China trade truce leaves businesses still facing daunting tariffs - Nikkei Asia",
      "pubDate": "Thu, 12 Jun 2025 04:16:00 GMT"
    },
    {
      "title": "Canadian Support for Counter-Tariffs Dips as Trump Trade War Persists - Bloomberg",
      "pubDate": "Thu, 12 Jun 2025 18:01:56 GMT"
    },
    {
      "title": "Trade War Impacts Keep Jobless Claims at 8-Month High - Inc.com",
      "pubDate": "Thu, 12 Jun 2025 17:03:58 GMT"
    },
    {
      "title": "Opinion | Trump miscalculated on China. Now the administration is trying to fix the mess. - The Washington Post",
      "pubDate": "Fri, 13 Jun 2025 03:18:56 GMT"
    },
    {
      "title": "Why Did That Price Go Up? Welcome to the Fog of Trade War - WSJ",
      "pubDate": "Sun, 15 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "G7 leaders gather in Canada for summit overshadowed by Middle East crisis and Trump’s tariffs - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 07:08:59 GMT"
    }
  ],
  "china": [
    {
      "title": "FBI Working With India to Disrupt Chinese Fentanyl Network—Kash Patel - Newsweek",
      "pubDate": "Sat, 07 Jun 2025 18:58:18 GMT"
    },
    {
      "title": "Chinese Students Reconsider the U.S. as Republicans Threaten Their Visas - The New York Times",
      "pubDate": "Sat, 07 Jun 2025 23:23:04 GMT"
    },
    {
      "title": "China’s grueling ‘996’ work culture is being debated by European startups — 7 founders and VCs on why they are resisting - CNBC",
      "pubDate": "Sun, 08 Jun 2025 01:23:00 GMT"
    },
    {
      "title": "Officials race to comply with Xi’s austerity rules as inspectors come knocking - South China Morning Post",
      "pubDate": "Sat, 07 Jun 2025 22:00:14 GMT"
    },
    {
      "title": "China plans to build a \"deep-sea space station\" 6560 feet deep, set to be completed by 2030. - Farmingdale Observer",
      "pubDate": "Sat, 07 Jun 2025 23:15:00 GMT"
    },
    {
      "title": "Harvard’s China Ties Become New Front in Battle With Trump - WSJ",
      "pubDate": "Sun, 08 Jun 2025 04:02:00 GMT"
    },
    {
      "title": "China arms itself for more export control battles - Financial Times",
      "pubDate": "Sun, 08 Jun 2025 04:00:33 GMT"
    },
    {
      "title": "Taiwan coast guard, military drill to better face China's 'grey zone' threat - Reuters",
      "pubDate": "Sun, 08 Jun 2025 05:16:00 GMT"
    },
    {
      "title": "China's Export Restrictions Jolt Rare Earths Global Automakers Warn - Crude Oil Prices Today | OilPrice.com",
      "pubDate": "Sat, 07 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "China Expert Warns Of \"Something Worse\" Than Covid After US Fungus Smuggling Case - NDTV",
      "pubDate": "Sun, 08 Jun 2025 06:28:55 GMT"
    },
    {
      "title": "Export Controls to Take Center Stage at U.S.-China Trade Talks - WSJ",
      "pubDate": "Sun, 08 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "American students in China face a barrage of questions about Trump - The Washington Post",
      "pubDate": "Sun, 08 Jun 2025 10:32:05 GMT"
    },
    {
      "title": "China's EV race to the bottom leaves a few possible winners - CNBC",
      "pubDate": "Sun, 08 Jun 2025 11:04:49 GMT"
    },
    {
      "title": "Chinese ship runs aground off Philippines-occupied island in the disputed South China Sea - AP News",
      "pubDate": "Sun, 08 Jun 2025 10:05:00 GMT"
    },
    {
      "title": "US Seeks Deal in London on China Rare Earth Flows, Hassett Says - Bloomberg",
      "pubDate": "Sun, 08 Jun 2025 16:21:23 GMT"
    },
    {
      "title": "The Victims of the Trump Administration’s China-Bashing - The New Yorker",
      "pubDate": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "China’s sixth-gen fighters: new photos hint at cruising capacity, drone control - South China Morning Post",
      "pubDate": "Sun, 08 Jun 2025 14:00:08 GMT"
    },
    {
      "title": "NYT: China, \"the enemy,\" targets Russian tech, territory, and scientists, leaked FSB file shows - Euromaidan Press",
      "pubDate": "Sun, 08 Jun 2025 09:02:39 GMT"
    },
    {
      "title": "US, China Prepare for Second Round of Talks in London - Bloomberg",
      "pubDate": "Sun, 08 Jun 2025 21:36:51 GMT"
    },
    {
      "title": "Trump economic adviser ‘very comfortable’ with a trade deal closing with China on Monday - CNN",
      "pubDate": "Sun, 08 Jun 2025 18:58:00 GMT"
    },
    {
      "title": "China consumer prices slump again, deepening deflation worries as demand stays weak - CNBC",
      "pubDate": "Mon, 09 Jun 2025 01:41:00 GMT"
    },
    {
      "title": "Dollar steadies after rally, focus shifts to US-China trade talks - Reuters",
      "pubDate": "Mon, 09 Jun 2025 01:32:44 GMT"
    },
    {
      "title": "Taiwan Tries to Purge Its Ranks of China Sympathizers - WSJ",
      "pubDate": "Mon, 09 Jun 2025 03:00:00 GMT"
    },
    {
      "title": "China's May exports slow, deflation deepens as tariffs bite - Reuters",
      "pubDate": "Mon, 09 Jun 2025 05:03:40 GMT"
    },
    {
      "title": "China's exports to the U.S. clock their sharpest drop in more than 5 years — down over 34% in May - CNBC",
      "pubDate": "Mon, 09 Jun 2025 03:12:00 GMT"
    },
    {
      "title": "Global Markets Mixed; U.S.-China Trade Talks in Focus - WSJ",
      "pubDate": "Mon, 09 Jun 2025 08:20:00 GMT"
    },
    {
      "title": "China extends an olive branch to Western auto giants over rare earth shortage - CNBC",
      "pubDate": "Mon, 09 Jun 2025 07:02:13 GMT"
    },
    {
      "title": "Trump’s Leverage Wobbles as China Trade Talks Get Started - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 11:00:16 GMT"
    },
    {
      "title": "Chinese exports to the U.S. are cratering despite a trade truce - Quartz",
      "pubDate": "Mon, 09 Jun 2025 12:39:00 GMT"
    },
    {
      "title": "China launches Tianwen-2 for asteroid sampling - People's Daily Online",
      "pubDate": "Mon, 09 Jun 2025 05:51:00 GMT"
    },
    {
      "title": "China has a valuable card to play as it holds trade talks with the US today - CNN",
      "pubDate": "Mon, 09 Jun 2025 12:42:00 GMT"
    },
    {
      "title": "China’s Grip on an Obscure Rare Earth Metal Threatens the West’s Militaries - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 15:49:34 GMT"
    },
    {
      "title": "China backs Mekong pollution probe after reports point finger at mining firms - South China Morning Post",
      "pubDate": "Mon, 09 Jun 2025 11:19:13 GMT"
    },
    {
      "title": "Watch Why China May Need to Break Up Some Big Businesses - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 19:37:09 GMT"
    },
    {
      "title": "US, China Trade Talks to Continue Tuesday After Day One Wraps - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 19:11:46 GMT"
    },
    {
      "title": "Trump Says China ‘Not Easy’ as Trade Talks to Continue Tuesday - Bloomberg",
      "pubDate": "Mon, 09 Jun 2025 19:36:22 GMT"
    },
    {
      "title": "China's electric cars are cheaper, but is there a deeper cost? - BBC",
      "pubDate": "Mon, 09 Jun 2025 23:04:10 GMT"
    },
    {
      "title": "Stocks rise, dollar tentative ahead of US-China talks outcome - Reuters",
      "pubDate": "Tue, 10 Jun 2025 02:16:00 GMT"
    },
    {
      "title": "Asia-Pacific markets climb as investors await details of U.S.-China trade talks - CNBC",
      "pubDate": "Tue, 10 Jun 2025 04:26:00 GMT"
    },
    {
      "title": "China’s $1.1tn asset manager becomes star player on ‘national team’ - Financial Times",
      "pubDate": "Tue, 10 Jun 2025 04:01:31 GMT"
    },
    {
      "title": "Russian Intelligence Says It Collects WeChat Data. What Does That Mean? - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 04:57:12 GMT"
    },
    {
      "title": "China Sends Two Aircraft Carriers Into Pacific Ocean in a First - Bloomberg",
      "pubDate": "Tue, 10 Jun 2025 08:24:43 GMT"
    },
    {
      "title": "China to make all hospitals offer epidurals to incentivize childbirth - CNN",
      "pubDate": "Tue, 10 Jun 2025 02:53:00 GMT"
    },
    {
      "title": "China calls for cooperation with UK during ministers meeting - Reuters",
      "pubDate": "Tue, 10 Jun 2025 12:30:30 GMT"
    },
    {
      "title": "China Challenges US Sea Power With Two Aircraft Carriers in West Pacific - Newsweek",
      "pubDate": "Tue, 10 Jun 2025 07:46:31 GMT"
    },
    {
      "title": "How rare earth minerals could give China the upper hand in U.S. trade talks - NBC News",
      "pubDate": "Tue, 10 Jun 2025 16:05:03 GMT"
    },
    {
      "title": "China Makes Childbirth Change Amid Falling Birth Rate - Newsweek",
      "pubDate": "Tue, 10 Jun 2025 17:26:03 GMT"
    },
    {
      "title": "China is only 3-6 months behind US in AI, Trump official says - Reuters",
      "pubDate": "Tue, 10 Jun 2025 18:19:41 GMT"
    },
    {
      "title": "Gen. Keane warns China conducting 'most comprehensive penetration' of US society in our 250-year history - Fox Business",
      "pubDate": "Tue, 10 Jun 2025 13:18:00 GMT"
    },
    {
      "title": "China bans banks from luring customers with popular Labubu dolls - The Guardian",
      "pubDate": "Tue, 10 Jun 2025 13:03:00 GMT"
    },
    {
      "title": "US-China trade, export control talks push through second full day in London - Reuters",
      "pubDate": "Tue, 10 Jun 2025 21:05:46 GMT"
    },
    {
      "title": "U.S.-China Talks Continue. Export Restrictions Are the Problem. - Barron's",
      "pubDate": "Tue, 10 Jun 2025 20:09:00 GMT"
    },
    {
      "title": "China-U.S. agree on framework to implement Geneva trade consensus after second day of London talks - CNBC",
      "pubDate": "Wed, 11 Jun 2025 00:01:00 GMT"
    },
    {
      "title": "U.S. and China reach a trade agreement in principle - The Washington Post",
      "pubDate": "Wed, 11 Jun 2025 02:10:56 GMT"
    },
    {
      "title": "US and China agree on plan to ease export controls after trade talks in London - CNN",
      "pubDate": "Wed, 11 Jun 2025 03:09:00 GMT"
    },
    {
      "title": "Tariffs: US-China talks end with plan for Trump and Xi to approve - BBC",
      "pubDate": "Wed, 11 Jun 2025 00:52:26 GMT"
    },
    {
      "title": "China, U.S. officials reach agreement for allowing rare-earth, tech trade. Now it's up to Trump and Xi - CNBC",
      "pubDate": "Wed, 11 Jun 2025 00:01:00 GMT"
    },
    {
      "title": "Map Tracks Russian and Chinese Spy Ships Loitering off Coast of US Ally - Newsweek",
      "pubDate": "Wed, 11 Jun 2025 08:18:36 GMT"
    },
    {
      "title": "China EV battery installations in May: CATL share at 42.87%, BYD 22.49% - CnEVPost",
      "pubDate": "Wed, 11 Jun 2025 09:02:00 GMT"
    },
    {
      "title": "Russia says it is ready to remove excess nuclear materials from Iran - Reuters",
      "pubDate": "Wed, 11 Jun 2025 09:02:09 GMT"
    },
    {
      "title": "China testing orbital refueling procedures for satellite missions - Space Daily",
      "pubDate": "Wed, 11 Jun 2025 07:59:34 GMT"
    },
    {
      "title": "Trump says US gets rare earth minerals from China and tariffs on Chinese goods will total 55% - AP News",
      "pubDate": "Wed, 11 Jun 2025 14:18:00 GMT"
    },
    {
      "title": "U.S. tariffs on China won't change again, Lutnick says after trade talks - CNBC",
      "pubDate": "Wed, 11 Jun 2025 15:18:21 GMT"
    },
    {
      "title": "Trump’s China ‘truce’ is nothing of the sort - CNN",
      "pubDate": "Wed, 11 Jun 2025 14:33:00 GMT"
    },
    {
      "title": "China’s Lock on Rare Earths Dictated Path Toward Trade Truce - WSJ",
      "pubDate": "Wed, 11 Jun 2025 16:25:00 GMT"
    },
    {
      "title": "New China Trade ‘Deal’ Takes U.S. Back to Where It Started - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 22:40:10 GMT"
    },
    {
      "title": "U.S., China reach trade truce after two days of talks, Trump says - The Globe and Mail",
      "pubDate": "Wed, 11 Jun 2025 23:43:37 GMT"
    },
    {
      "title": "US-China trade truce leaves investors none the wiser - Reuters",
      "pubDate": "Wed, 11 Jun 2025 17:14:51 GMT"
    },
    {
      "title": "Critical minerals give China an edge in trade negotiations - AP News",
      "pubDate": "Thu, 12 Jun 2025 02:23:00 GMT"
    },
    {
      "title": "China's racing to build its AI ecosystem as U.S. tech curbs bite. Here's how its supply chain stacks up - CNBC",
      "pubDate": "Thu, 12 Jun 2025 03:54:00 GMT"
    },
    {
      "title": "Japan protests to China after ‘dangerous’ moves by warplanes over Pacific - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 06:33:45 GMT"
    },
    {
      "title": "China demands sensitive information for rare earth exports, companies warn - Financial Times",
      "pubDate": "Thu, 12 Jun 2025 04:01:56 GMT"
    },
    {
      "title": "Chinese jets fly as close as 45 metres to Japanese patrol planes in Pacific - Reuters",
      "pubDate": "Thu, 12 Jun 2025 08:28:23 GMT"
    },
    {
      "title": "China affirms trade deal with US, says it always keeps its word - Reuters",
      "pubDate": "Thu, 12 Jun 2025 08:39:47 GMT"
    },
    {
      "title": "Why China’s rare earth exports are a key issue in trade tensions with US - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 09:46:02 GMT"
    },
    {
      "title": "Chinese fighter jet in near miss with Japan military plane as Pacific tensions rise - The Guardian",
      "pubDate": "Thu, 12 Jun 2025 05:01:00 GMT"
    },
    {
      "title": "China appears to downplay US trade deal Trump said was 'done' - ABC News",
      "pubDate": "Thu, 12 Jun 2025 10:52:30 GMT"
    },
    {
      "title": "Exclusive: China-backed militia secures control of new rare earth mines in Myanmar - Reuters",
      "pubDate": "Thu, 12 Jun 2025 10:48:59 GMT"
    },
    {
      "title": "Xi Plays Long Game on US-China Trade as Trump Seeks Quick Wins - Bloomberg",
      "pubDate": "Thu, 12 Jun 2025 11:43:05 GMT"
    },
    {
      "title": "China says it will remove all tariffs on African exports to boost trade - Reuters",
      "pubDate": "Thu, 12 Jun 2025 15:17:38 GMT"
    },
    {
      "title": "China to remove tariffs on nearly all goods from Africa as both criticise US - South China Morning Post",
      "pubDate": "Thu, 12 Jun 2025 10:00:17 GMT"
    },
    {
      "title": "US says China's Huawei can't make more than 200,000 AI chips in 2025 - Reuters",
      "pubDate": "Thu, 12 Jun 2025 18:49:14 GMT"
    },
    {
      "title": "If China invaded Taiwan, who would enter the war? - The Economist",
      "pubDate": "Thu, 12 Jun 2025 13:00:23 GMT"
    },
    {
      "title": "China grants rare earth export permits after US trade talks, offers relief but uncertainty persists - ABC News",
      "pubDate": "Thu, 12 Jun 2025 21:30:13 GMT"
    },
    {
      "title": "Global EV sales rise in May as China hits 2025 peak -Rho Motion - Reuters",
      "pubDate": "Thu, 12 Jun 2025 23:05:55 GMT"
    },
    {
      "title": "Three reasons why China can't afford to invade Taiwan - Responsible Statecraft",
      "pubDate": "Thu, 12 Jun 2025 21:20:49 GMT"
    },
    {
      "title": "Taking lessons from Ukraine, Taiwan eyes sea drones to counter China - Reuters",
      "pubDate": "Fri, 13 Jun 2025 01:05:00 GMT"
    },
    {
      "title": "China cautions citizens in Iran, warns those in Israel of potential attacks - Reuters",
      "pubDate": "Fri, 13 Jun 2025 03:35:00 GMT"
    },
    {
      "title": "China delays approval of $35bn US chip merger amid Donald Trump’s trade war - Financial Times",
      "pubDate": "Fri, 13 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Cheerleaders to critics: German machinery makers call for EU action on China - South China Morning Post",
      "pubDate": "Fri, 13 Jun 2025 06:00:13 GMT"
    },
    {
      "title": "China expresses deep concern about Israel's attacks on Iran, urges de-escalation - Reuters",
      "pubDate": "Fri, 13 Jun 2025 08:54:47 GMT"
    },
    {
      "title": "China's tight grip on rare earths shows little sign of weakening - CNBC",
      "pubDate": "Fri, 13 Jun 2025 10:01:52 GMT"
    },
    {
      "title": "Chinese AI Companies Dodge U.S. Chip Curbs by Flying Suitcases of Hard Drives Abroad - WSJ",
      "pubDate": "Fri, 13 Jun 2025 03:00:00 GMT"
    },
    {
      "title": "What does China’s PLA gain from operating 2 carriers in second island chain? - South China Morning Post",
      "pubDate": "Fri, 13 Jun 2025 14:00:07 GMT"
    },
    {
      "title": "China Boosts Tesla Self-Driving Plan With Car-Data Export Rules - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 11:41:59 GMT"
    },
    {
      "title": "Pentagon review rattles submarine deal amid fears of China’s naval edge - The Washington Post",
      "pubDate": "Fri, 13 Jun 2025 16:11:01 GMT"
    },
    {
      "title": "Nvidia to exclude China from its revenue and profit forecasts - TechCrunch",
      "pubDate": "Fri, 13 Jun 2025 15:34:03 GMT"
    },
    {
      "title": "China Reacts to Israel's Attack on Iran - Newsweek",
      "pubDate": "Fri, 13 Jun 2025 12:50:02 GMT"
    },
    {
      "title": "Bunge's $34 billion Viterra merger clears final China hurdle - Reuters",
      "pubDate": "Fri, 13 Jun 2025 18:43:34 GMT"
    },
    {
      "title": "China Labor Bulletin, a Rights Group in Hong Kong, Shuts Down - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 18:10:00 GMT"
    },
    {
      "title": "Trade With China Is Becoming a One-Way Street - WSJ",
      "pubDate": "Sat, 14 Jun 2025 03:00:00 GMT"
    },
    {
      "title": "Boeing resumes China deliveries with 787-9 jet to Juneyao Airlines, Yicai reports - Reuters",
      "pubDate": "Sat, 14 Jun 2025 04:35:00 GMT"
    },
    {
      "title": "Former Cuomo Campaign Adviser Led Chinese State Oil Company - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 03:51:24 GMT"
    },
    {
      "title": "Russia, China condemn Israel's attacks on Iran in UN Security Council - Ynetnews",
      "pubDate": "Sat, 14 Jun 2025 03:45:13 GMT"
    },
    {
      "title": "Xi urges Communist Party to learn from pioneer of China’s economic planning - South China Morning Post",
      "pubDate": "Sat, 14 Jun 2025 10:00:21 GMT"
    },
    {
      "title": "Satellite images show extensive damage that Israeli fighter jets caused at one of Iran's top nuclear facilities - Business Insider",
      "pubDate": "Sat, 14 Jun 2025 17:01:00 GMT"
    },
    {
      "title": "China expresses backing for Tehran, opposition to Israeli strikes in separate calls with Araghchi, Sa'ar - The Times of Israel",
      "pubDate": "Sat, 14 Jun 2025 16:04:17 GMT"
    },
    {
      "title": "China’s Biotech Moment Ignites a 60% Stock Rally That Beats AI - Bloomberg.com",
      "pubDate": "Sun, 15 Jun 2025 00:00:00 GMT"
    },
    {
      "title": "Why Chinese firms building foreign factories are no longer focused on US market - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 03:00:11 GMT"
    },
    {
      "title": "China’s Wang Yi decries ‘unacceptable’ Israeli attack on Iran, urges diplomacy - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 06:01:19 GMT"
    },
    {
      "title": "China considers lifting sanctions on UK parliamentarians as relations warm - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 09:01:00 GMT"
    },
    {
      "title": "China’s extreme heat shield breaks thermal limit on hypersonic flight - South China Morning Post",
      "pubDate": "Sun, 15 Jun 2025 12:00:08 GMT"
    },
    {
      "title": "Exclusive: US-China trade truce leaves military-use rare earth issue unresolved, sources say - Reuters",
      "pubDate": "Sun, 15 Jun 2025 06:23:00 GMT"
    }
  ],
  "iran": [
    {
      "title": "Trump warns of possible military action if Iran enriches more uranium: ‘Going to have no choice’ - New York Post",
      "pubDate": "Sat, 07 Jun 2025 18:07:00 GMT"
    },
    {
      "title": "Iran to present counter-proposal to US in nuclear talks - Reuters",
      "pubDate": "Mon, 09 Jun 2025 09:25:11 GMT"
    },
    {
      "title": "Trump warns of decision time as Iran prepares nuclear counter-proposal - AL-Monitor",
      "pubDate": "Mon, 09 Jun 2025 22:00:20 GMT"
    },
    {
      "title": "US military evaluating options to prevent nuclear-armed Iran, general says - Reuters",
      "pubDate": "Tue, 10 Jun 2025 17:07:09 GMT"
    },
    {
      "title": "A nuclear deal with Iran could generate billions for US economy - Responsible Statecraft",
      "pubDate": "Wed, 11 Jun 2025 10:50:59 GMT"
    },
    {
      "title": "Oil prices rise more than 4% on escalating U.S.-Iran tensions - CNBC",
      "pubDate": "Wed, 11 Jun 2025 19:24:08 GMT"
    },
    {
      "title": "US to partially evacuate embassy in Iraq as Iran tensions rise - BBC",
      "pubDate": "Thu, 12 Jun 2025 02:32:48 GMT"
    },
    {
      "title": "Israel considering military strike on Iran, sources say - NBC News",
      "pubDate": "Thu, 12 Jun 2025 05:09:00 GMT"
    },
    {
      "title": "UN nuclear watchdog board finds Iran not complying with nuclear obligations - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 08:37:30 GMT"
    },
    {
      "title": "U.N. Watchdog Rules That Iran Is Not Complying With Nuclear Obligations - The New York Times",
      "pubDate": "Thu, 12 Jun 2025 09:08:16 GMT"
    },
    {
      "title": "Iran threatens nuclear escalation after UN watchdog board finds it in breach of obligations - CNN",
      "pubDate": "Thu, 12 Jun 2025 11:33:00 GMT"
    },
    {
      "title": "Israel considering military action against Iran in coming days: Sources - ABC News",
      "pubDate": "Thu, 12 Jun 2025 15:33:45 GMT"
    },
    {
      "title": "Exclusive: Top U.S. official warns of mass casualty retaliation by Iran - Axios",
      "pubDate": "Thu, 12 Jun 2025 16:30:00 GMT"
    },
    {
      "title": "A new Iran nuclear crisis looms after IAEA finds rule breaches - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 20:24:35 GMT"
    },
    {
      "title": "Tensions Rise with Iran - NPR",
      "pubDate": "Thu, 12 Jun 2025 22:35:52 GMT"
    },
    {
      "title": "Trump warns a strike on Iran 'could very well happen' if no nuclear deal is signed - NPR",
      "pubDate": "Thu, 12 Jun 2025 21:40:46 GMT"
    },
    {
      "title": "Israeli Strikes Target Iran's Nuclear Program: Live Updates - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 01:38:00 GMT"
    },
    {
      "title": "Israel strikes Iran nuclear sites and military leadership, as Middle East braces for retaliation - CNN",
      "pubDate": "Fri, 13 Jun 2025 02:39:00 GMT"
    },
    {
      "title": "Israel Launches Attack on Iran’s Nuclear Facilities: Live Updates - WSJ",
      "pubDate": "Fri, 13 Jun 2025 03:33:00 GMT"
    },
    {
      "title": "Israel hits Iran nuclear facilities, missile factories; Tehran vows revenge - Reuters",
      "pubDate": "Fri, 13 Jun 2025 05:07:00 GMT"
    },
    {
      "title": "Live updates: Israel strikes Iran’s nuclear and military sites - AP News",
      "pubDate": "Fri, 13 Jun 2025 06:43:00 GMT"
    },
    {
      "title": "Israel launches strikes on Iran: what we know so far - The Guardian",
      "pubDate": "Fri, 13 Jun 2025 04:54:00 GMT"
    },
    {
      "title": "Israel Iran War News Live Updates: Israel completes widespread operation against air defences in western Iran - The Economic Times",
      "pubDate": "Fri, 13 Jun 2025 08:47:31 GMT"
    },
    {
      "title": "Live updates: Israel strikes Iranian nuclear facilities as fears of war mount - NBC News",
      "pubDate": "Fri, 13 Jun 2025 09:45:53 GMT"
    },
    {
      "title": "Trump warns Iran: 'Make a deal, before it’s too late' - NewsNation",
      "pubDate": "Fri, 13 Jun 2025 11:03:49 GMT"
    },
    {
      "title": "Israel Strikes Iran to Target Nuclear Program - Foreign Policy",
      "pubDate": "Fri, 13 Jun 2025 01:47:02 GMT"
    },
    {
      "title": "Iran launches hundreds of armed drones towards Israel - Al Jazeera",
      "pubDate": "Fri, 13 Jun 2025 08:27:06 GMT"
    },
    {
      "title": "LIVE: Iran vows ‘powerful response’ to Israeli strikes, Trump urges deal - Al Jazeera",
      "pubDate": "Fri, 13 Jun 2025 07:34:43 GMT"
    },
    {
      "title": "Oil jumps over 7% after Israel strikes Iran - Reuters",
      "pubDate": "Fri, 13 Jun 2025 15:31:41 GMT"
    },
    {
      "title": "Airlines divert, cancel flights after Israel's strike on Iran closes airspace in Middle East - CNBC",
      "pubDate": "Fri, 13 Jun 2025 13:25:36 GMT"
    },
    {
      "title": "Iran launches scores of ballistic missiles in retaliation against Israel’s attack on Tehran - PBS",
      "pubDate": "Fri, 13 Jun 2025 19:46:03 GMT"
    },
    {
      "title": "Israel-Iran live updates: US helps shoot down missiles heading toward Israel - ABC News",
      "pubDate": "Fri, 13 Jun 2025 22:59:00 GMT"
    },
    {
      "title": "Tel Aviv Hit by Iranian Missile Strikes in Retaliation for Israel's Attacks on Nuclear Sites - Live Updates - WSJ",
      "pubDate": "Fri, 13 Jun 2025 23:59:00 GMT"
    },
    {
      "title": "Iran launches retaliatory missile attack in response to Israel nuclear site strikes: What to know - NBC News",
      "pubDate": "Fri, 13 Jun 2025 22:19:00 GMT"
    },
    {
      "title": "Israel hit Iran’s nuclear program – and Iran hit back. Here’s what we know - CNN",
      "pubDate": "Fri, 13 Jun 2025 22:53:00 GMT"
    },
    {
      "title": "A Miscalculation by Iran Led to Israeli Strikes’ Extensive Toll, Officials Say - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 02:36:23 GMT"
    },
    {
      "title": "Israel's endgame may be regime change in Iran - but it's a gamble - BBC",
      "pubDate": "Sat, 14 Jun 2025 02:46:19 GMT"
    },
    {
      "title": "Israel-Iran latest: Iran threatens further strikes and ‘will target US bases’ - The Independent",
      "pubDate": "Sat, 14 Jun 2025 07:30:00 GMT"
    },
    {
      "title": "LIVE: Iran hits Israel with retaliatory strikes after nuclear site attacks - Al Jazeera",
      "pubDate": "Sat, 14 Jun 2025 09:00:23 GMT"
    },
    {
      "title": "Iran retaliates for Israeli attack with missile strikes - Reuters",
      "pubDate": "Sat, 14 Jun 2025 10:24:58 GMT"
    },
    {
      "title": "Live Updates: Israel Warns 'Tehran Will Burn,' Iran Pulls Out of Nuclear Talks After Night of Crossfire - WSJ",
      "pubDate": "Sat, 14 Jun 2025 15:41:00 GMT"
    },
    {
      "title": "Israel attacked three key Iranian nuclear facilities. Did it strike a decisive blow? - CNN",
      "pubDate": "Sat, 14 Jun 2025 15:44:00 GMT"
    },
    {
      "title": "Live updates: Iran and Israel continue airstrikes; imminent nuclear talks with U.S. called off - The Washington Post",
      "pubDate": "Sat, 14 Jun 2025 17:27:05 GMT"
    },
    {
      "title": "Live: Iran sends new missile barrage at Israel, Israel renews Iran attacks - Al Jazeera",
      "pubDate": "Sat, 14 Jun 2025 20:37:30 GMT"
    },
    {
      "title": "LIVE: Iran fires missiles as Israel strikes oil facility in Tehran - Al Jazeera",
      "pubDate": "Sun, 15 Jun 2025 00:00:40 GMT"
    },
    {
      "title": "Iran cancels next round of nuclear talks with US after Israeli strikes - The Times of Israel",
      "pubDate": "Sat, 14 Jun 2025 19:10:00 GMT"
    },
    {
      "title": "Live Updates: Israel and Iran Exchange Strikes in Deadliest Day So Far - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 05:59:22 GMT"
    },
    {
      "title": "Ten killed in Iranian strikes on Israel as Trump threatens Tehran with ‘full strength’ of military if it attacks US – live updates - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 09:48:00 GMT"
    },
    {
      "title": "Iran launches new round of missiles, as Israel carries out strikes on targets in Tehran - CBS News",
      "pubDate": "Sun, 15 Jun 2025 02:52:17 GMT"
    },
    {
      "title": "Live updates: Israel says many targets remain as it continues to trade strikes with Iran - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 15:09:52 GMT"
    },
    {
      "title": "Live Updates: Israel Launches New Strikes on Iran as Trump Calls for Resolution - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 17:47:35 GMT"
    }
  ],
  "us_economy": [
    {
      "title": "Campbell’s says soup sales are soaring—and that’s actually a sign the U.S. economy is in a downturn, data shows - MSN",
      "pubDate": "Sat, 07 Jun 2025 20:22:42 GMT"
    },
    {
      "title": "The U.S. Economy Is Headed Toward an Uncomfortable Summer - WSJ",
      "pubDate": "Sun, 08 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "President Trump sends Federal Reserve harsh message on interest rates - TheStreet",
      "pubDate": "Sun, 08 Jun 2025 00:52:18 GMT"
    },
    {
      "title": "Is a recession coming? What the numbers tell us about where our economy stands - NPR",
      "pubDate": "Sun, 08 Jun 2025 13:44:57 GMT"
    },
    {
      "title": "US Economy Growth: Cyclical Stocks Outperform Defensives - News and Statistics - IndexBox",
      "pubDate": "Sun, 08 Jun 2025 19:34:14 GMT"
    },
    {
      "title": "JPMorgan Warns Slowdown Gradually Seeping Up and Spreading Across US Economy Despite Job Growth Topping Estimates - The Daily Hodl",
      "pubDate": "Sun, 08 Jun 2025 20:01:02 GMT"
    },
    {
      "title": "Trump Prepares to Oust Fed Boss Powell, Says New Chair Decision ‘Very Soon’ - Bitcoin.com News",
      "pubDate": "Sun, 08 Jun 2025 15:24:42 GMT"
    },
    {
      "title": "US Jobs: Data Still Don't Make Anything Easy for the Fed - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 05:00:00 GMT"
    },
    {
      "title": "US and China officials to meet for trade talks in London – business live - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 06:10:00 GMT"
    },
    {
      "title": "Asian shares rally ahead of US-China trade talks - The Independent",
      "pubDate": "Mon, 09 Jun 2025 04:28:00 GMT"
    },
    {
      "title": "The Fed Could Wait Too Long for the Labor Market to Crack - Inc.com",
      "pubDate": "Mon, 09 Jun 2025 10:17:25 GMT"
    },
    {
      "title": "US economy shows resilience amid uncertainties - MSN",
      "pubDate": "Mon, 09 Jun 2025 15:31:06 GMT"
    },
    {
      "title": "Businesses Plan to Pass Half of Trump Tariff Costs to Customers - Inc.com",
      "pubDate": "Mon, 09 Jun 2025 16:39:42 GMT"
    },
    {
      "title": "U.S. economy showing mixed signals for May - MarketWatch",
      "pubDate": "Mon, 09 Jun 2025 11:49:10 GMT"
    },
    {
      "title": "Corporate bankruptcy surge signals trouble for the U.S. economy - TheStreet",
      "pubDate": "Mon, 09 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "Hopes For Fed Rate Cuts Are Fading - Investopedia",
      "pubDate": "Mon, 09 Jun 2025 19:53:13 GMT"
    },
    {
      "title": "US stocks hold steady as trade talks with China begin - KIRO 7 News Seattle",
      "pubDate": "Mon, 09 Jun 2025 13:38:21 GMT"
    },
    {
      "title": "US Recession Expectations Among CEOs Decline in June, Survey Shows - marketscreener.com",
      "pubDate": "Mon, 09 Jun 2025 20:00:09 GMT"
    },
    {
      "title": "Trump tariffs killing the US economy? Tough times ahead for jobseekers and investors - The American Bazaar",
      "pubDate": "Mon, 09 Jun 2025 18:22:30 GMT"
    },
    {
      "title": "US-China trade talks to resume; UK jobs market ‘weakening’ as payrolls tumble – business live - The Guardian",
      "pubDate": "Tue, 10 Jun 2025 06:22:00 GMT"
    },
    {
      "title": "US small business sentiment improves in May, but uncertainty rising - Reuters",
      "pubDate": "Tue, 10 Jun 2025 10:04:24 GMT"
    },
    {
      "title": "Stocks, dollar stall as investors watch progress in US-China trade talks - Reuters",
      "pubDate": "Tue, 10 Jun 2025 11:47:51 GMT"
    },
    {
      "title": "US, China talks will result in a 'shaky truce at best' - Yahoo Finance",
      "pubDate": "Tue, 10 Jun 2025 13:56:55 GMT"
    },
    {
      "title": "Trump administration live updates: Hegseth clashes with Democrats during House testimony; N.J. voters head to the polls - NBC News",
      "pubDate": "Tue, 10 Jun 2025 19:44:53 GMT"
    },
    {
      "title": "World Bank Sees U.S. Growth Rate Halving as Tariffs Slow Global Economy - WSJ",
      "pubDate": "Tue, 10 Jun 2025 14:22:00 GMT"
    },
    {
      "title": "Treasury Sec. Bessent leaves London, but U.S.-China trade talks continue - CNBC",
      "pubDate": "Tue, 10 Jun 2025 21:15:01 GMT"
    },
    {
      "title": "World Bank Paints a Bleak Picture of the U.S. Economy—What It Means for Homebuyers and Sellers - Realtor.com",
      "pubDate": "Tue, 10 Jun 2025 22:12:56 GMT"
    },
    {
      "title": "World Bank Cuts Global Economic Growth Forecast Amid Tariff-Fueled Uncertainty - Investopedia",
      "pubDate": "Tue, 10 Jun 2025 20:09:29 GMT"
    },
    {
      "title": "Trump Tariffs Can Remain in Effect, US Appeals Court Says - Bloomberg",
      "pubDate": "Wed, 11 Jun 2025 01:21:00 GMT"
    },
    {
      "title": "Trump’s tax bill could raise taxes on foreign companies, hurting investment from abroad - AP News",
      "pubDate": "Tue, 10 Jun 2025 23:23:00 GMT"
    },
    {
      "title": "U.S. economy to avoid recession even after tariff hike - Wells Fargo (SP500:S&P Complete Indices) - Seeking Alpha",
      "pubDate": "Wed, 11 Jun 2025 08:40:00 GMT"
    },
    {
      "title": "Trump’s tariffs can remain in place for now, but appeals court fast tracks a summer resolution - CNN",
      "pubDate": "Wed, 11 Jun 2025 02:08:00 GMT"
    },
    {
      "title": "US Federal Reserve to keep rates unchanged at least until September – experts - GMK Center",
      "pubDate": "Wed, 11 Jun 2025 07:58:26 GMT"
    },
    {
      "title": "US prices continued to rise in May amid Trump tariffs - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 12:51:00 GMT"
    },
    {
      "title": "JPMorgan's Jamie Dimon warns U.S. economy could soon 'deteriorate' - CNBC",
      "pubDate": "Wed, 11 Jun 2025 13:12:33 GMT"
    },
    {
      "title": "US CEOs Are Feeling Bullish: Majority Now Believe The Economy Will Dodge Recession In 2025: Survey - Benzinga",
      "pubDate": "Wed, 11 Jun 2025 13:17:50 GMT"
    },
    {
      "title": "JPMorgan CEO: ‘Real Chance’ US Economic Numbers Will Dip - PYMNTS.com",
      "pubDate": "Wed, 11 Jun 2025 16:30:00 GMT"
    },
    {
      "title": "JPMorgan CEO Warns of Potential U.S. Economic Recession Risks - GuruFocus",
      "pubDate": "Thu, 12 Jun 2025 00:10:21 GMT"
    },
    {
      "title": "Why Trump Is Losing His Trade War - The Atlantic",
      "pubDate": "Wed, 11 Jun 2025 18:30:00 GMT"
    },
    {
      "title": "JPMorgan CEO Jamie Dimon warns economic conditions may deteriorate soon - Fox Business",
      "pubDate": "Wed, 11 Jun 2025 20:59:00 GMT"
    },
    {
      "title": "Trump economy shows surprising resilience despite tariff impacts - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 03:47:37 GMT"
    },
    {
      "title": "Largest US Banker Warns US Economy Could 'Deteriorate' As Global Growth Forecast Dims - dailyvoice.com",
      "pubDate": "Thu, 12 Jun 2025 01:31:05 GMT"
    },
    {
      "title": "UK economy shrank sharply in April as Trump tariffs and tax rises kicked in - CNBC",
      "pubDate": "Thu, 12 Jun 2025 10:03:22 GMT"
    },
    {
      "title": "Jobless Claims Show Cool Labor Market Needs Fed Help; S&P 500 Futures Slip - Investor's Business Daily",
      "pubDate": "Thu, 12 Jun 2025 12:42:00 GMT"
    },
    {
      "title": "Traders boost bets on Fed rate cuts after PPI, jobless claims data - Reuters",
      "pubDate": "Thu, 12 Jun 2025 13:11:20 GMT"
    },
    {
      "title": "US Producer Prices Increased Less Than Forecast in May - Bloomberg",
      "pubDate": "Thu, 12 Jun 2025 12:42:39 GMT"
    },
    {
      "title": "US economy could be set to 'deteriorate,' warns Dimon - MPA Mag",
      "pubDate": "Thu, 12 Jun 2025 14:08:07 GMT"
    },
    {
      "title": "JPMorgan Chase CEO issues dire warning on US economy - TheStreet",
      "pubDate": "Thu, 12 Jun 2025 17:07:00 GMT"
    },
    {
      "title": "Stock Market Today: Dow Opens 200 Points Lower; Dollar Drops After Trump Revives Tariff Threats — Live Updates - WSJ",
      "pubDate": "Thu, 12 Jun 2025 18:01:00 GMT"
    },
    {
      "title": "US economy is 'frozen' due to a string of compounding uncertainties, strategist says - Fox Business",
      "pubDate": "Thu, 12 Jun 2025 19:29:22 GMT"
    },
    {
      "title": "House Reconciliation Bill’s Health Care and SNAP Cuts Put Older Adults at Risk - Medicare Rights Center",
      "pubDate": "Thu, 12 Jun 2025 21:26:03 GMT"
    },
    {
      "title": "June Fed Meeting: Live Updates and Commentary - Kiplinger",
      "pubDate": "Fri, 13 Jun 2025 14:32:56 GMT"
    },
    {
      "title": "US Economy Shrinks for First Time in Three Years Amid Tariff Concerns - MSN",
      "pubDate": "Fri, 13 Jun 2025 13:31:34 GMT"
    },
    {
      "title": "The Israel-Iran War Could Send a Shock Through the US Economy. Here’s How. - Barron's",
      "pubDate": "Fri, 13 Jun 2025 19:34:00 GMT"
    },
    {
      "title": "How the U.S. economy could suffer collateral damage from Israel-Iran airstrikes - MarketWatch",
      "pubDate": "Fri, 13 Jun 2025 16:03:00 GMT"
    },
    {
      "title": "Rising Unemployment May Be Warning Signs for the U.S. Economy - La Voce di New York",
      "pubDate": "Sat, 14 Jun 2025 11:29:05 GMT"
    },
    {
      "title": "Federal Reserve, White House interest-rate cut battle heats up - TheStreet",
      "pubDate": "Sat, 14 Jun 2025 15:33:00 GMT"
    },
    {
      "title": "Map Shows US States With Best—And Worst—Economies - Newsweek",
      "pubDate": "Sat, 14 Jun 2025 09:00:01 GMT"
    },
    {
      "title": "The situation in the Middle East is a ‘major wild card’ for the Fed, former Powell adviser says - MarketWatch",
      "pubDate": "Sat, 14 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "The Federal Reserve Against Trump: Who wins the interest rate war? - MSN",
      "pubDate": "Sat, 14 Jun 2025 16:42:02 GMT"
    },
    {
      "title": "US Fed set to hold rates steady in the face of Trump pressure - France 24",
      "pubDate": "Sun, 15 Jun 2025 04:59:11 GMT"
    },
    {
      "title": "US Federal Reserve Expected to Hold Rates Despite Trump’s Push - News Central TV",
      "pubDate": "Sun, 15 Jun 2025 05:18:51 GMT"
    },
    {
      "title": "Trump has a plan to remake the housing-finance system. It’s baffling to many lawmakers and experts. - Politico",
      "pubDate": "Sun, 15 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Economist's View: Hard data versus soft and what to watch going forward - Pittsburgh Post-Gazette",
      "pubDate": "Sun, 15 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Fed meeting in focus as investors seek rate-path hints - MSN",
      "pubDate": "Sun, 15 Jun 2025 13:05:08 GMT"
    },
    {
      "title": "Making America Backward Again - Rolling Stone",
      "pubDate": "Sun, 15 Jun 2025 09:01:35 GMT"
    },
    {
      "title": "Fed interest rate decision looms as battle over cuts takes surprising turn - TheStreet",
      "pubDate": "Sun, 15 Jun 2025 14:51:38 GMT"
    }
  ],
  "terrorism": [
    {
      "title": "Trump administration to end DHS program designed to thwart terror attacks - NBC News",
      "pubDate": "Tue, 10 Jun 2025 23:06:17 GMT"
    }
  ],
  "cancer": [
    {
      "title": "A epitranscriptome for prostate cancer - Nature",
      "pubDate": "Mon, 09 Jun 2025 11:40:59 GMT"
    },
    {
      "title": "Rare Appendix Cancers Are Increasing Among Millennials and Gen X - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 21:29:43 GMT"
    },
    {
      "title": "Appendix Cancer Has Quadrupled in Millennials - Time Magazine",
      "pubDate": "Mon, 09 Jun 2025 21:28:51 GMT"
    },
    {
      "title": "Modified CAR-T cells target widespread protein found in multiple types of cancer - Medical Xpress",
      "pubDate": "Tue, 10 Jun 2025 19:30:04 GMT"
    },
    {
      "title": "Pancreatic cancer vaccine eradicates trace of disease in early trials - New Atlas",
      "pubDate": "Thu, 12 Jun 2025 10:07:25 GMT"
    },
    {
      "title": "Cancer: World-first 'Trojan horse' therapy to be given on NHS - BBC",
      "pubDate": "Fri, 13 Jun 2025 00:05:15 GMT"
    },
    {
      "title": "Blood cancer patients in England first in world to be offered ‘Trojan horse’ drug - The Guardian",
      "pubDate": "Fri, 13 Jun 2025 06:00:00 GMT"
    },
    {
      "title": "Glyphosate can trigger 'multiple' types of cancer, even at safe levels, says study - Times of India",
      "pubDate": "Sat, 14 Jun 2025 03:30:00 GMT"
    },
    {
      "title": "Simple blood test detects cancer up to 3 years before symptoms appear - Earth.com",
      "pubDate": "Sat, 14 Jun 2025 09:01:54 GMT"
    },
    {
      "title": "More Americans Under 50 Are Getting Cancer—Doctors Identify Three Age Groups - Newsweek",
      "pubDate": "Sat, 14 Jun 2025 18:00:01 GMT"
    }
  ],
  "democratic_party": [
    {
      "title": "Column | Gillibrand taps Blue Dog roots for Democrats’ path to Senate majority - The Washington Post",
      "pubDate": "Sat, 07 Jun 2025 22:55:04 GMT"
    },
    {
      "title": "Rahm Emanuel wants to save the ‘weak’ and ‘woke’ Democratic Party brand - Politico",
      "pubDate": "Sun, 08 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Arizona Democrats meet amid party tensions - The Arizona Republic",
      "pubDate": "Sun, 08 Jun 2025 03:42:28 GMT"
    },
    {
      "title": "Democrats, divided on trans issues, struggle to speak in one voice - The Washington Post",
      "pubDate": "Sun, 08 Jun 2025 10:02:14 GMT"
    },
    {
      "title": "Democrats wooing Musk after the Trump breakup is US plutocracy at its best - Al Jazeera",
      "pubDate": "Sun, 08 Jun 2025 12:15:08 GMT"
    },
    {
      "title": "Democratic Party chair lashes officer in leaked call, prompting more infighting - The Washington Post",
      "pubDate": "Mon, 09 Jun 2025 00:21:32 GMT"
    },
    {
      "title": "Leaked Audio Reveals DNC Chair in Despair Over Dem Civil War: ‘No One Knows Who the Hell I Am’ - The Daily Beast",
      "pubDate": "Mon, 09 Jun 2025 00:00:00 GMT"
    },
    {
      "title": "Democrats forced to walk tightrope on Trump, L.A. protests - The Hill",
      "pubDate": "Tue, 10 Jun 2025 00:00:00 GMT"
    },
    {
      "title": "David Hogg to Exit D.N.C. After Backlash to His Primary Plan - The New York Times",
      "pubDate": "Thu, 12 Jun 2025 00:05:38 GMT"
    },
    {
      "title": "Why ‘Hellcats’ could be the answer to Democrats troubles - Politico",
      "pubDate": "Thu, 12 Jun 2025 08:43:00 GMT"
    },
    {
      "title": "The Democrats’ resistance to Trump is a hollow performance - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 15:43:34 GMT"
    },
    {
      "title": "Democrats make a mark in their rowdy pushback to Trump - NBC News",
      "pubDate": "Fri, 13 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "2024 Broke the Democrats. Can They Put Themselves Back Together? - Reveal from The Center for Investigative Reporting",
      "pubDate": "Sat, 14 Jun 2025 07:01:00 GMT"
    },
    {
      "title": "Democrats engage in ‘treacherous’ fight with Trump on immigration, protests - The Washington Post",
      "pubDate": "Sat, 14 Jun 2025 11:32:10 GMT"
    },
    {
      "title": "Two Democratic lawmakers in Minnesota shot in their separate homes - The Guardian",
      "pubDate": "Sat, 14 Jun 2025 13:52:00 GMT"
    },
    {
      "title": "Two Democratic Minnesota Lawmakers Shot, One Fatally; Suspect at Large - WSJ",
      "pubDate": "Sat, 14 Jun 2025 16:03:00 GMT"
    },
    {
      "title": "Democratic Minnesota politician fatally shot, another injured in 'politically motivated assassination' - NBC News",
      "pubDate": "Sat, 14 Jun 2025 18:44:51 GMT"
    },
    {
      "title": "Minnesota police name suspect in shootings of Democratic state politicians - BBC",
      "pubDate": "Sat, 14 Jun 2025 20:57:59 GMT"
    },
    {
      "title": "Big turnout for Democrats in Virginia’s early primary voting gives party hope - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 14:31:30 GMT"
    },
    {
      "title": "Infighting jeopardizes hopes of Democratic comeback - The Hill",
      "pubDate": "Sun, 15 Jun 2025 10:00:00 GMT"
    }
  ],
  "north_korea": [
    {
      "title": "North Korea Appears to Have Added to Its Nuclear Complex - Bloomberg",
      "pubDate": "Wed, 11 Jun 2025 03:52:00 GMT"
    }
  ],
  "hamas": [
    {
      "title": "Hamas issues new photo of hostage Matan Zangauker, threatens execution if troops come near - The Times of Israel",
      "pubDate": "Sat, 07 Jun 2025 20:18:03 GMT"
    },
    {
      "title": "Hamas Releases Picture of Hostage Matan Zangauker After Saying IDF Besieged Captivity Site - Haaretz",
      "pubDate": "Sat, 07 Jun 2025 18:30:00 GMT"
    },
    {
      "title": "At least 90 people in Gaza dead amid Israeli attacks, Hamas-run health ministry says - CBS News",
      "pubDate": "Sat, 07 Jun 2025 22:45:00 GMT"
    },
    {
      "title": "Six killed by Israeli gunfire near Gaza aid site, Hamas officials say - BBC",
      "pubDate": "Sat, 07 Jun 2025 20:47:02 GMT"
    },
    {
      "title": "Israeli military says it struck Hamas member in southern Syria - Reuters",
      "pubDate": "Sun, 08 Jun 2025 07:34:41 GMT"
    },
    {
      "title": "Israel says it has found body of Hamas military leader Mohammed Sinwar - BBC",
      "pubDate": "Sun, 08 Jun 2025 20:05:41 GMT"
    },
    {
      "title": "Hamas documents reportedly show deep ties, coordination between Qatar, terror group - The Times of Israel",
      "pubDate": "Sun, 08 Jun 2025 22:42:00 GMT"
    },
    {
      "title": "Israel reveals tunnel under Gaza hospital, says body of Sinwar's brother found there - Reuters",
      "pubDate": "Sun, 08 Jun 2025 18:39:12 GMT"
    },
    {
      "title": "Israel strikes Syria again, claims to have killed alleged Hamas member - Al Jazeera",
      "pubDate": "Sun, 08 Jun 2025 21:51:48 GMT"
    },
    {
      "title": "US-Led Gaza Aid Resumes as Israel Uncovers Major Hamas Command Center Under European Hospital - cbn.com",
      "pubDate": "Mon, 09 Jun 2025 09:34:04 GMT"
    },
    {
      "title": "US sanctions charities it says are linked to Hamas's armed wing - Middle East Eye",
      "pubDate": "Tue, 10 Jun 2025 19:18:56 GMT"
    },
    {
      "title": "More Than 55,000 Palestinians Have Been Killed in the Israel-Hamas War, Gaza Health Officials Say - U.S. News & World Report",
      "pubDate": "Wed, 11 Jun 2025 12:26:00 GMT"
    },
    {
      "title": "US-backed Gaza Humanitarian Foundation says 5 aid workers killed in attack - Al Jazeera",
      "pubDate": "Thu, 12 Jun 2025 02:03:45 GMT"
    },
    {
      "title": "Hamas attacks Gaza aid group, kills at least five, staff feared taken hostage - JNS.org",
      "pubDate": "Thu, 12 Jun 2025 01:30:00 GMT"
    },
    {
      "title": "Israeli strikes on Gaza kill at least 16 as war rages on after the opening of new front with Iran - Spectrum News",
      "pubDate": "Sat, 14 Jun 2025 15:23:00 GMT"
    }
  ],
  "climate": [
    {
      "title": "Mass. psychologist on the impact climate change has on mental health - WCVB",
      "pubDate": "Sat, 07 Jun 2025 23:15:00 GMT"
    },
    {
      "title": "Rivers release ancient carbon dioxide into the atmosphere – reshaping climate science - The Brighter Side of News",
      "pubDate": "Sat, 07 Jun 2025 18:07:00 GMT"
    },
    {
      "title": "As Arctic ice vanishes, maritime traffic booms fuel climate crisis - France 24",
      "pubDate": "Sun, 08 Jun 2025 07:15:38 GMT"
    },
    {
      "title": "Scientists issue warning over unpredictable threats as hurricane season begins: 'Known unknowns' - The Cool Down",
      "pubDate": "Mon, 09 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "Climate Change Heightens Risk Of Indian Farmer Suicides - Barron's",
      "pubDate": "Mon, 09 Jun 2025 05:56:00 GMT"
    },
    {
      "title": "Scientists Uncover Flaw in Climate Models: Clouds Are Supercharging Arctic Warming - SciTechDaily",
      "pubDate": "Mon, 09 Jun 2025 14:07:41 GMT"
    },
    {
      "title": "NOAA : Carbon Dioxide in Atmosphere Reaches Highest Level in Millions of Years - Democracy Now!",
      "pubDate": "Mon, 09 Jun 2025 14:54:25 GMT"
    },
    {
      "title": "BlackRock, other funds clash with Republican states over evidence in climate-investing case - Reuters",
      "pubDate": "Tue, 10 Jun 2025 01:57:00 GMT"
    },
    {
      "title": "These Kids Fought the Climate Crisis in Court. Now They’re Taking on Trump - Rolling Stone",
      "pubDate": "Tue, 10 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "EPA to propose rolling back climate rule for power plants Wednesday - Politico",
      "pubDate": "Tue, 10 Jun 2025 21:54:14 GMT"
    },
    {
      "title": "Month of May was world’s second-warmest on record: EU scientists - Al Jazeera",
      "pubDate": "Wed, 11 Jun 2025 07:56:31 GMT"
    },
    {
      "title": "Scientists discover concerning new phenomenon that may impact the intensity of hurricanes: 'Might get stronger' - The Cool Down",
      "pubDate": "Wed, 11 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "Major US climate website likely to be shut down after almost all staff fired - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 11:26:00 GMT"
    },
    {
      "title": "Scientists mapped what happens if a crucial system of ocean currents collapses. The weather impact would be extreme - CNN",
      "pubDate": "Wed, 11 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Trump to revoke Biden’s climate rule on power plants - Politico",
      "pubDate": "Wed, 11 Jun 2025 18:08:58 GMT"
    },
    {
      "title": "Trump gutted the National Climate Assessment. America will suffer as a result. - The Hill",
      "pubDate": "Wed, 11 Jun 2025 18:30:00 GMT"
    },
    {
      "title": "Ocean current ‘collapse’ could trigger ‘profound cooling’ in northern Europe – even with global warming - Carbon Brief",
      "pubDate": "Wed, 11 Jun 2025 13:15:03 GMT"
    },
    {
      "title": "Trump proposes axing all climate rules for power plants - The Hill",
      "pubDate": "Wed, 11 Jun 2025 18:24:00 GMT"
    },
    {
      "title": "E.P.A. Axes Biden’s Climate and Pollution Limits on Power Plants - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 22:55:51 GMT"
    },
    {
      "title": "EPA moves to repeal limits on greenhouse gas emissions by power plants - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 01:50:43 GMT"
    },
    {
      "title": "Climate Change Could Complicate Anti-Submarine Warfare - The New York Times",
      "pubDate": "Thu, 12 Jun 2025 09:02:35 GMT"
    },
    {
      "title": "A popular climate website will be hobbled, after Trump administration eliminates entire staff - NPR",
      "pubDate": "Thu, 12 Jun 2025 20:47:02 GMT"
    },
    {
      "title": "Homeowners Battle Insurers Over $2.9 Trillion Climate Risk - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Trump’s latest budget proposal could gut climate and weather research in Colorado - Colorado Public Radio",
      "pubDate": "Thu, 12 Jun 2025 23:42:11 GMT"
    },
    {
      "title": "New Climate Study Highlights Dire Sea Level Warnings - Inside Climate News",
      "pubDate": "Fri, 13 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "Climate change leads to spread of infection-causing fungi, scientists say - ABC News",
      "pubDate": "Sat, 14 Jun 2025 10:15:39 GMT"
    },
    {
      "title": "Ancient carbon emissions from rivers may accelerate climate change: study - FOX6 News Milwaukee",
      "pubDate": "Sat, 14 Jun 2025 11:32:56 GMT"
    },
    {
      "title": "Climate Change Is Ruining Cheese, Scientists and Farmers Warn - futurism.com",
      "pubDate": "Sat, 14 Jun 2025 19:00:37 GMT"
    },
    {
      "title": "Why nuclear war, not the climate crisis, is humanity’s biggest threat, according to one author - The Guardian",
      "pubDate": "Sun, 15 Jun 2025 11:01:00 GMT"
    }
  ],
  "ai_safety": [
    {
      "title": "UK ministers delay AI regulation amid plans for more ‘comprehensive’ bill - The Guardian",
      "pubDate": "Sat, 07 Jun 2025 19:31:00 GMT"
    },
    {
      "title": "Microsoft (MSFT) Introduces AI Safety Ranking System - GuruFocus",
      "pubDate": "Sat, 07 Jun 2025 20:35:22 GMT"
    },
    {
      "title": "Microsoft to Rank AI Models by Safety in Bid to Boost Customer Trust - Sri Lanka Guardian",
      "pubDate": "Sun, 08 Jun 2025 04:03:24 GMT"
    },
    {
      "title": "State and federal laws allow charges for AI child sexual abuse images - Scranton Times-Tribune",
      "pubDate": "Sun, 08 Jun 2025 04:05:27 GMT"
    },
    {
      "title": "AI Liability Insurance: The Next Step in Safeguarding Businesses from AI Failures - Unite.AI",
      "pubDate": "Sun, 08 Jun 2025 05:44:53 GMT"
    },
    {
      "title": "What next for artificial intelligence after the Trump-Musk blowup - Washington Examiner",
      "pubDate": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Enterprises are getting stuck in AI pilot hell, say Chatterbox Labs execs - MSN",
      "pubDate": "Sun, 08 Jun 2025 18:04:28 GMT"
    },
    {
      "title": "AI model shows threats of its blackmail instincts during safety test - Inquirer.net",
      "pubDate": "Mon, 09 Jun 2025 06:26:24 GMT"
    },
    {
      "title": "Microsoft to introduce AI safety ranking for cloud - Yahoo Finance",
      "pubDate": "Mon, 09 Jun 2025 10:40:49 GMT"
    },
    {
      "title": "AI fuels hacking attacks against corporate execs, poll finds - SC Media",
      "pubDate": "Mon, 09 Jun 2025 13:10:25 GMT"
    },
    {
      "title": "Safety institute announces research projects as global focus shifts to AI adoption - Toronto Star",
      "pubDate": "Mon, 09 Jun 2025 19:25:05 GMT"
    },
    {
      "title": "Campaigners urge UK regulator to curb Meta’s AI in safety - Tech in Asia",
      "pubDate": "Tue, 10 Jun 2025 01:40:00 GMT"
    },
    {
      "title": "Center for AI Standards and Innovation: the new frontier of security in artificial intelligence (AI) - The Cryptonomist",
      "pubDate": "Tue, 10 Jun 2025 09:45:11 GMT"
    },
    {
      "title": "New York’s RAISE Act Misses AI Safety Risks - City Journal",
      "pubDate": "Tue, 10 Jun 2025 07:44:52 GMT"
    },
    {
      "title": "Accelerating AI Interpretability To Promote U.S. Technological Leadership - Federation of American Scientists",
      "pubDate": "Tue, 10 Jun 2025 14:56:57 GMT"
    },
    {
      "title": "Can AI be used to control safety critical systems? A U.K.-funded research program aims to find out - Fortune",
      "pubDate": "Tue, 10 Jun 2025 17:24:00 GMT"
    },
    {
      "title": "New AI minister says Canada won’t ‘over-index’ on AI regulation - Village Report",
      "pubDate": "Tue, 10 Jun 2025 20:26:15 GMT"
    },
    {
      "title": "AI companion apps such as Replika need more effective safety controls, experts say - Australian Broadcasting Corporation",
      "pubDate": "Wed, 11 Jun 2025 02:26:15 GMT"
    },
    {
      "title": "When an AI says, ‘No, I don’t want to power off’: Inside the o3 refusal - Cointelegraph",
      "pubDate": "Wed, 11 Jun 2025 15:54:15 GMT"
    },
    {
      "title": "A National Center for Advanced AI Reliability and Security - Federation of American Scientists",
      "pubDate": "Wed, 11 Jun 2025 13:21:25 GMT"
    },
    {
      "title": "FDA Plans to Use AI to Speed Up Drug and Food Safety Reviews - Homenewshere.com",
      "pubDate": "Wed, 11 Jun 2025 13:30:00 GMT"
    },
    {
      "title": "Lenovo and Volcano Engine team on AI safety - KrASIA",
      "pubDate": "Thu, 12 Jun 2025 02:34:20 GMT"
    },
    {
      "title": "India unveils AI incident reporting guidelines for critical infrastructure - Digital Watch Observatory",
      "pubDate": "Thu, 12 Jun 2025 10:25:43 GMT"
    },
    {
      "title": "Former OpenAI Researcher Warns GPT-4o Shows Alarming Self-Preservation Bias in Safety Tests - iafrica.com",
      "pubDate": "Thu, 12 Jun 2025 13:24:10 GMT"
    },
    {
      "title": "Mitigating AI security threats: Why the G7 should embrace ‘federated learning’ - The Conversation",
      "pubDate": "Thu, 12 Jun 2025 16:59:40 GMT"
    },
    {
      "title": "NEXCOM NexCOBOT unit joins NVIDIA Halos AI Systems Inspection Lab - The Robot Report",
      "pubDate": "Thu, 12 Jun 2025 14:12:56 GMT"
    },
    {
      "title": "New York Legislature Approves Sweeping AI Safety Measure (1) - Bloomberg Law News",
      "pubDate": "Thu, 12 Jun 2025 18:56:00 GMT"
    },
    {
      "title": "Pennsylvania Senate Passes AI “Deepfake” Bill; Other Artificial Intelligence Policy in Focus - WENY News",
      "pubDate": "Thu, 12 Jun 2025 22:36:00 GMT"
    },
    {
      "title": "Anthropic expands in Europe, eyes AI growth and safety leadership - Proactive Investors",
      "pubDate": "Fri, 13 Jun 2025 07:15:00 GMT"
    },
    {
      "title": "I’m trying to be positive about AI. Worry persists. | Opinion - centralmaine.com",
      "pubDate": "Fri, 13 Jun 2025 08:01:48 GMT"
    },
    {
      "title": "AI safety controls needed now - The Northside Sun",
      "pubDate": "Fri, 13 Jun 2025 13:04:15 GMT"
    },
    {
      "title": "AM Bores’ + Sen. Gounardes Landmark AI Safety Bill Passes New York State Legislature - Harlem World Magazine",
      "pubDate": "Fri, 13 Jun 2025 16:43:08 GMT"
    },
    {
      "title": "Sen. Gounardes’ AI safety bill clears both chambers of NY legislature - Brooklyn Eagle",
      "pubDate": "Fri, 13 Jun 2025 20:39:53 GMT"
    },
    {
      "title": "New York passes a bill to prevent AI-fueled disasters - TechCrunch",
      "pubDate": "Fri, 13 Jun 2025 22:09:17 GMT"
    },
    {
      "title": "Why AI is an Overlooked Cybersecurity Risk in Supply Chains - Supply & Demand Chain Executive",
      "pubDate": "Sat, 14 Jun 2025 18:39:03 GMT"
    },
    {
      "title": "New York Steps Up with First-of-Its-Kind AI Safety Legislation - CoinCentral",
      "pubDate": "Sun, 15 Jun 2025 05:17:34 GMT"
    },
    {
      "title": "New York State passes RAISE Act for frontier AI models - The Economic Times",
      "pubDate": "Sun, 15 Jun 2025 11:47:22 GMT"
    }
  ],
  "us_politics": [
    {
      "title": "Trump Warns of Consequences for Musk if He Backs Candidates Against Republicans - The New York Times",
      "pubDate": "Sat, 07 Jun 2025 18:48:51 GMT"
    },
    {
      "title": "US foreign policy - The Guardian",
      "pubDate": "Sat, 07 Jun 2025 22:24:55 GMT"
    },
    {
      "title": "Trump asks Supreme Court to allow Education Department purge - Boston Herald",
      "pubDate": "Sat, 07 Jun 2025 20:34:40 GMT"
    },
    {
      "title": "Trump v Elon Musk may deliver one true winner: JD Vance - The Times",
      "pubDate": "Sat, 07 Jun 2025 23:01:00 GMT"
    },
    {
      "title": "Trump's deportation program nets positive approval amid contrasting views over its scope, CBS News poll finds - CBS News",
      "pubDate": "Sun, 08 Jun 2025 13:03:27 GMT"
    },
    {
      "title": "National guard troops sent by Trump arrive in LA following protests against immigration raids – US politics live - The Guardian",
      "pubDate": "Sun, 08 Jun 2025 11:56:00 GMT"
    },
    {
      "title": "National Guard on the ground in LA after Trump’s deployment order - CNN",
      "pubDate": "Sun, 08 Jun 2025 18:12:00 GMT"
    },
    {
      "title": "Breaking With Trump, Bacon Says He Won’t Follow His Party ‘Off the Cliff’ - The New York Times",
      "pubDate": "Sun, 08 Jun 2025 15:31:20 GMT"
    },
    {
      "title": "Trump’s expansive new travel ban takes effect for 19 countries - The Washington Post",
      "pubDate": "Mon, 09 Jun 2025 05:45:52 GMT"
    },
    {
      "title": "Trump Jumps at the Chance for a Standoff in California Over Immigration - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 00:02:53 GMT"
    },
    {
      "title": "Democrats Hate Trump’s Policy Bill, but Love Some of Its Tax Cuts - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 09:01:59 GMT"
    },
    {
      "title": "Trump tax bill reveals striking shift in GOP’s focus - The Washington Post",
      "pubDate": "Mon, 09 Jun 2025 16:00:00 GMT"
    },
    {
      "title": "Senate Republicans Plan to Release Major Revisions to Trump’s Tax Bill - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "LA protest crackdown offers Trump two victories — and one big risk - The Times",
      "pubDate": "Mon, 09 Jun 2025 18:50:54 GMT"
    },
    {
      "title": "RFK Jr. removes all 17 members of vaccine committee for CDC - Axios",
      "pubDate": "Mon, 09 Jun 2025 21:25:23 GMT"
    },
    {
      "title": "Jan. 6 attack gets in the way of Republican talking points on ICE protests - MSNBC News",
      "pubDate": "Mon, 09 Jun 2025 15:08:35 GMT"
    },
    {
      "title": "White House Pushes Texas to Redistrict, Hoping to Blunt Democratic Gains - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 00:44:37 GMT"
    },
    {
      "title": "Senate Democrat Warns Party to Stay Focused On Trump’s Budget Bill, Don’t Get Distracted By Lo ... - Mediaite",
      "pubDate": "Mon, 09 Jun 2025 22:03:00 GMT"
    },
    {
      "title": "ICE Raid Protests: Los Angeles Is Losing the War for Public Opinion - Bloomberg",
      "pubDate": "Mon, 09 Jun 2025 20:56:20 GMT"
    },
    {
      "title": "Pentagon Sends 700 Marines to Los Angeles, Escalating Response to Protests - Bloomberg",
      "pubDate": "Mon, 09 Jun 2025 23:17:35 GMT"
    },
    {
      "title": "Inside the MAGA vs. hawk battle to sway Trump on bombing Iran - Politico",
      "pubDate": "Tue, 10 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "US cities follow LA's protests over Trump's immigration raids - BBC",
      "pubDate": "Tue, 10 Jun 2025 08:52:49 GMT"
    },
    {
      "title": "Trump faces criticism of his broad mass deportation push from two different angles - NBC News",
      "pubDate": "Tue, 10 Jun 2025 18:09:07 GMT"
    },
    {
      "title": "Trump warns that military parade protesters will face 'very heavy force' - NBC News",
      "pubDate": "Tue, 10 Jun 2025 19:25:13 GMT"
    },
    {
      "title": "Trump Declares Dubious Emergencies to Amass Power, Scholars Say - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 15:49:37 GMT"
    },
    {
      "title": "Democrats Enter Risky Political Terrain as Protests Grip California - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 23:38:27 GMT"
    },
    {
      "title": "House GOP gets list of ‘fatal’ megabill flaws to delete - Politico",
      "pubDate": "Tue, 10 Jun 2025 22:30:03 GMT"
    },
    {
      "title": "Senate GOP finalizing scaled-down food stamp cuts after backlash - Politico",
      "pubDate": "Tue, 10 Jun 2025 22:30:03 GMT"
    },
    {
      "title": "Trump Says Army Bases Will Revert to Confederate Names - The New York Times",
      "pubDate": "Wed, 11 Jun 2025 00:07:05 GMT"
    },
    {
      "title": "Trump’s aggressive moves on immigration protests put Democrats in a political bind - CNN",
      "pubDate": "Tue, 10 Jun 2025 21:27:00 GMT"
    },
    {
      "title": "Marines in Los Angeles have power to detain people, says major general, as US cities brace for more protests – live - The Guardian",
      "pubDate": "Wed, 11 Jun 2025 06:17:00 GMT"
    },
    {
      "title": "Trump's EPA plans to repeal climate pollution limits on fossil fuel power plants - NPR",
      "pubDate": "Wed, 11 Jun 2025 21:08:43 GMT"
    },
    {
      "title": "Senate rejects effort to block arms sales over Trump’s dealings with Qatar and UAE - Baltimore Sun",
      "pubDate": "Wed, 11 Jun 2025 23:26:15 GMT"
    },
    {
      "title": "House GOP tweaks megabill to protect filibuster-skirting power in Senate - Politico",
      "pubDate": "Wed, 11 Jun 2025 20:54:04 GMT"
    },
    {
      "title": "Republicans to Press Hochul, Walz and Pritzker on Immigration in Hearing - The New York Times",
      "pubDate": "Thu, 12 Jun 2025 13:12:03 GMT"
    },
    {
      "title": "Democrats look for reinvention and a new playbook against Trump in key committee race - WSLS",
      "pubDate": "Thu, 12 Jun 2025 04:09:48 GMT"
    },
    {
      "title": "House votes to cut global health funding - The Hill",
      "pubDate": "Thu, 12 Jun 2025 22:51:00 GMT"
    },
    {
      "title": "House Republicans vote to claw back $9.4 billion in funding for foreign aid, NPR and PBS - NBC News",
      "pubDate": "Thu, 12 Jun 2025 20:45:28 GMT"
    },
    {
      "title": "Democrats and Republicans point fingers over Sen. Padilla's removal from DHS event - NBC News",
      "pubDate": "Fri, 13 Jun 2025 01:02:00 GMT"
    },
    {
      "title": "Senate G.O.P. Includes Expanded Fund for Radiation Victims in Policy Bill - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 02:06:20 GMT"
    },
    {
      "title": "House Approves $9 Billion in Funding Cuts Affecting NPR, PBS and Foreign Aid - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 00:05:17 GMT"
    },
    {
      "title": "Sen Alex Padilla dragged out of Noem immigration briefing in LA - BBC",
      "pubDate": "Thu, 12 Jun 2025 22:05:22 GMT"
    },
    {
      "title": "House votes to eliminate federal funding for public media outlets - NPR",
      "pubDate": "Fri, 13 Jun 2025 08:10:29 GMT"
    },
    {
      "title": "US judge blocks Trump administration from overhauling federal elections - Deccan Herald",
      "pubDate": "Fri, 13 Jun 2025 13:57:23 GMT"
    },
    {
      "title": "Republicans back Israeli attack on Iran but some Democrats say it sabotages nuclear talks - The Guardian",
      "pubDate": "Fri, 13 Jun 2025 18:15:00 GMT"
    },
    {
      "title": "House GOP launches probe of China-based billionaire linked to protest groups, including anti-ICE agitators in LA - New York Post",
      "pubDate": "Fri, 13 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "Israel’s Strikes on Iran Divide Congress, Drawing Praise and Concern - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 18:17:03 GMT"
    },
    {
      "title": "Republicans Are Divided Over Iran. Will Trump Pick a Side? - The New York Times",
      "pubDate": "Fri, 13 Jun 2025 22:00:31 GMT"
    },
    {
      "title": "US Senate seeks to add expanded compensation for nuclear radiation victims to tax bill - ABC News",
      "pubDate": "Sat, 14 Jun 2025 02:27:42 GMT"
    },
    {
      "title": "US lawmakers offer sweeping support for Israeli strikes on Iran, though some critical - The Times of Israel",
      "pubDate": "Sat, 14 Jun 2025 02:16:40 GMT"
    },
    {
      "title": "Minnesota Lawmaker Killed, Another Shot At, Trump Condemns \"Terrible Shooting\" - NDTV",
      "pubDate": "Sat, 14 Jun 2025 15:22:05 GMT"
    },
    {
      "title": "Minnesota shootings set off five-alarm fire in Congress - Axios",
      "pubDate": "Sat, 14 Jun 2025 17:42:40 GMT"
    },
    {
      "title": "Minnesota lawmaker Melissa Hortman killed, State Sen. John Hoffman wounded in 'targeted political violence' - ABC News",
      "pubDate": "Sat, 14 Jun 2025 18:32:18 GMT"
    },
    {
      "title": "Protests held nationwide ahead of Trump’s military parade - CNN",
      "pubDate": "Sat, 14 Jun 2025 21:28:00 GMT"
    },
    {
      "title": "Minnesota politician shootings raise concerns in New York State - Newsday",
      "pubDate": "Sat, 14 Jun 2025 22:10:21 GMT"
    },
    {
      "title": "Minnesota: US politician shot dead and another wounded - as suspect named - Sky News",
      "pubDate": "Sat, 14 Jun 2025 17:15:00 GMT"
    },
    {
      "title": "Hospitals would be hit hardest by Medicaid cuts in GOP tax bill, report finds - statnews.com",
      "pubDate": "Sat, 14 Jun 2025 16:23:48 GMT"
    },
    {
      "title": "Like School Shootings, Political Violence Is Becoming Almost Routine - The New York Times",
      "pubDate": "Sun, 15 Jun 2025 00:40:56 GMT"
    },
    {
      "title": "Medicaid enrollees fear losing health coverage if Congress enacts work requirements - ABC News",
      "pubDate": "Sun, 15 Jun 2025 04:46:00 GMT"
    },
    {
      "title": "Minnesota House leader assassinated, state senator shot in political violence that stuns nation - Star Tribune",
      "pubDate": "Sun, 15 Jun 2025 04:48:28 GMT"
    },
    {
      "title": "Minnesota tragedy sparks calls for protection of lawmakers - Scripps News",
      "pubDate": "Sat, 14 Jun 2025 20:05:22 GMT"
    },
    {
      "title": "Minnesota lawmakers Melissa Hortman and John Hoffman targeted by gunman, suspect at large - BBC",
      "pubDate": "Sat, 14 Jun 2025 23:12:42 GMT"
    },
    {
      "title": "Congress' fight over security erupts after Minnesota shootings - Axios",
      "pubDate": "Sun, 15 Jun 2025 12:24:52 GMT"
    },
    {
      "title": "Minnesota killings spread fear in country riven by violence against politicians - The Washington Post",
      "pubDate": "Sun, 15 Jun 2025 17:45:17 GMT"
    }
  ],
  "cryptocurrency": [
    {
      "title": "Businesses Are Bingeing on Crypto, Dialing Up the Market’s Risks - WSJ",
      "pubDate": "Mon, 09 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "Democrats are drawing closer to the crypto industry despite Trump divisions - ABC News",
      "pubDate": "Mon, 09 Jun 2025 11:33:57 GMT"
    },
    {
      "title": "France makes arrests over cryptocurrency kidnapping - France 24",
      "pubDate": "Wed, 11 Jun 2025 13:15:15 GMT"
    },
    {
      "title": "Liz Warren Says Crypto Bill Creates a ‘Superhighway’ for Trump Corruption - rollingstone.com",
      "pubDate": "Thu, 12 Jun 2025 13:32:17 GMT"
    },
    {
      "title": "Even Before His Return to the White House, Trump Was Becoming a Crypto Czar - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 00:49:59 GMT"
    }
  ],
  "renewable_energy": [
    {
      "title": "China advances in marine energy technologies - bastillepost.com",
      "pubDate": "Sun, 08 Jun 2025 15:27:07 GMT"
    },
    {
      "title": "US solar energy growth to slow as Washington priorities shift - Reuters",
      "pubDate": "Mon, 09 Jun 2025 04:17:00 GMT"
    },
    {
      "title": "Meta signs deal for advanced geothermal power in New Mexico - Reuters",
      "pubDate": "Thu, 12 Jun 2025 21:44:46 GMT"
    },
    {
      "title": "Republican Concerns Over Clean Energy Tax Credit Phaseout - Crude Oil Prices Today | OilPrice.com",
      "pubDate": "Fri, 13 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "The Largest US Offshore Wind Project is Ready to Go Despite Trump’s Vendetta - Sierra Club",
      "pubDate": "Sun, 15 Jun 2025 09:04:27 GMT"
    }
  ],
  "spacex": [
    {
      "title": "NASA, Pentagon push for SpaceX alternatives amid Trump’s feud with Musk - The Washington Post",
      "pubDate": "Sat, 07 Jun 2025 20:53:34 GMT"
    }
  ],
  "earthquakes": [
    {
      "title": "An earthquake just off California’s coast poses dire tsunami risk for many communities - Los Angeles Times",
      "pubDate": "Sun, 08 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Magnitude 6.3 earthquake shakes Colombia’s capital Bogota - Al Jazeera",
      "pubDate": "Sun, 08 Jun 2025 14:13:16 GMT"
    },
    {
      "title": "Magnitude 6.5 Earthquake Strikes Colombia, GFZ Says - U.S. News & World Report",
      "pubDate": "Sun, 08 Jun 2025 13:19:00 GMT"
    },
    {
      "title": "Map: 6.3-Magnitude Earthquake Strikes Colombia - The New York Times",
      "pubDate": "Sun, 08 Jun 2025 20:56:15 GMT"
    },
    {
      "title": "A 6.3 magnitude earthquake hits central Colombia, with no casualties reported - ABC News",
      "pubDate": "Sun, 08 Jun 2025 14:58:37 GMT"
    },
    {
      "title": "Experts Say a Major Northern California Earthquake Is Coming—Here’s How to Get Ready - Active NorCal",
      "pubDate": "Sun, 08 Jun 2025 15:11:59 GMT"
    },
    {
      "title": "Magnitude 3.4 earthquake shakes Los Angeles on Tuesday afternoon - FOX Weather",
      "pubDate": "Tue, 10 Jun 2025 19:40:00 GMT"
    },
    {
      "title": "Almost half of California's faults — including San Andreas — are overdue for earthquakes - Live Science",
      "pubDate": "Wed, 11 Jun 2025 15:33:06 GMT"
    },
    {
      "title": "Magnitude 4.6 - 28 miles SE of Adak - Alaska Earthquake Center",
      "pubDate": "Wed, 11 Jun 2025 20:36:19 GMT"
    },
    {
      "title": "California’s Faults Are Long Overdue for Major Earthquakes—Scientists Warn of an Imminent Catastrophe - The Daily Galaxy",
      "pubDate": "Thu, 12 Jun 2025 16:15:00 GMT"
    },
    {
      "title": "Magnitude 6.5 earthquake strikes Russia's Kuril Islands, EMSC says - Reuters",
      "pubDate": "Fri, 13 Jun 2025 19:04:14 GMT"
    }
  ],
  "bitcoin": [
    {
      "title": "Bitcoin (BTC) Stays Firm as Trump-Musk Feud Escalates Over 2025 Budget Politics - CoinDesk",
      "pubDate": "Sat, 07 Jun 2025 19:07:45 GMT"
    },
    {
      "title": "Legendary fund manager sends blunt 6-word message on bitcoin - TheStreet",
      "pubDate": "Sat, 07 Jun 2025 23:47:40 GMT"
    },
    {
      "title": "Bitcoin Skyrockets Past $108,000 Amid US-China Tariff Discussions - TradingView",
      "pubDate": "Tue, 10 Jun 2025 09:30:01 GMT"
    },
    {
      "title": "Bitcoin Sinks as Israel Escalates Iran Standoff With Airstrikes - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 03:02:00 GMT"
    },
    {
      "title": "Bitcoin Price Tumbles as Gold Rises. Amazon and Walmart Consider Issuing Stablecoins. - Barron's",
      "pubDate": "Fri, 13 Jun 2025 13:10:00 GMT"
    },
    {
      "title": "Bitcoin becoming 'more central’ to portfolios as its volatility cools, Coatue's Philippe Laffont says - CNBC",
      "pubDate": "Sat, 14 Jun 2025 13:17:16 GMT"
    },
    {
      "title": "SEC clears Trump Media filing, opening door to multi-billion-dollar Bitcoin buy - The Block",
      "pubDate": "Sat, 14 Jun 2025 19:01:42 GMT"
    }
  ],
  "cybersecurity": [
    {
      "title": "Trump administration takes aim at Biden and Obama cybersecurity rules - TechCrunch",
      "pubDate": "Sat, 07 Jun 2025 20:32:42 GMT"
    },
    {
      "title": "US infrastructure could crumble under cyberattack, ex-NSA advisor warns - theregister.com",
      "pubDate": "Sun, 08 Jun 2025 22:01:00 GMT"
    },
    {
      "title": "Amazon Whole Foods Distributor Breach Disrupts Deliveries - Bloomberg.com",
      "pubDate": "Mon, 09 Jun 2025 21:36:43 GMT"
    },
    {
      "title": "Whole Foods’ primary distributor goes offline amid rising corporate cyberattacks - Fast Company",
      "pubDate": "Mon, 09 Jun 2025 18:47:17 GMT"
    },
    {
      "title": "CISA Issues Alert on Erlang/OTP SSH Server RCE Vulnerability Under Active Exploitation - GBHackers News",
      "pubDate": "Tue, 10 Jun 2025 10:58:00 GMT"
    },
    {
      "title": "From malware to deepfakes, generative AI is transforming attacks - Cybersecurity Dive",
      "pubDate": "Tue, 10 Jun 2025 14:49:17 GMT"
    },
    {
      "title": "US Banks ‘Deeply Concerned’ About Cybersecurity Risk Following Attack on Top Financial Regulator - The Daily Hodl",
      "pubDate": "Thu, 12 Jun 2025 14:31:18 GMT"
    },
    {
      "title": "House Democrats call for GAO probe into CISA and NIST cybersecurity programs - Industrial Cyber",
      "pubDate": "Fri, 13 Jun 2025 10:49:11 GMT"
    },
    {
      "title": "WestJet probes cybersecurity incident affecting app and internal systems - Reuters",
      "pubDate": "Sat, 14 Jun 2025 17:25:42 GMT"
    }
  ],
  "elon_musk": [
    {
      "title": "'Terrifying' Impact of Trump-Musk Breakup on National Security and Space Programs - The Daily Beast",
      "pubDate": "Sat, 07 Jun 2025 20:52:00 GMT"
    },
    {
      "title": "Musk Floats Idea of Starting New Rival Political Party—and Even Names It—Amid Trump Feud - Time Magazine",
      "pubDate": "Sat, 07 Jun 2025 18:09:05 GMT"
    },
    {
      "title": "Surprising Trump-Musk rift worsens a huge Tesla problem - TheStreet",
      "pubDate": "Sat, 07 Jun 2025 22:37:00 GMT"
    },
    {
      "title": "Trump and Musk aides have spoken amid pause in hostilities - Politico",
      "pubDate": "Sun, 08 Jun 2025 11:37:12 GMT"
    },
    {
      "title": "Why Trump Appears To Have Won Billionaire Battle Royale With Elon Musk - NDTV",
      "pubDate": "Mon, 09 Jun 2025 14:55:04 GMT"
    },
    {
      "title": "Elon Musk says he regrets some social media posts he made about Trump - CNBC",
      "pubDate": "Wed, 11 Jun 2025 07:18:43 GMT"
    },
    {
      "title": "Elon Musk called President Trump on Monday night expressing regret - CNN",
      "pubDate": "Wed, 11 Jun 2025 21:16:00 GMT"
    },
    {
      "title": "Elon Musk says his next product will be the most important Tesla has ever produced. And he says it’s (finally) almost here - CNN",
      "pubDate": "Thu, 12 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Exclusive: White House reviews SpaceX contracts as Trump-Musk feud simmers, sources say - Reuters",
      "pubDate": "Fri, 13 Jun 2025 22:20:19 GMT"
    },
    {
      "title": "How Elon Musk Is Reinventing Tesla’s Strategy - WSJ",
      "pubDate": "Sat, 14 Jun 2025 09:30:00 GMT"
    }
  ],
  "astronomy": [
    {
      "title": "Scientists Just Discovered a ‘Super-Earth’ : Atmosphere, Size, Distance… It Has It All! - MSN",
      "pubDate": "Mon, 09 Jun 2025 02:22:18 GMT"
    }
  ],
  "federal_reserve": [
    {
      "title": "Transatlantic interest rate rift widens as Trump piles pressure on Powell - Financial Times",
      "pubDate": "Sun, 08 Jun 2025 04:00:49 GMT"
    },
    {
      "title": "Powell Under Scrutiny? Trump Announces An Imminent Decision. - Cointribune",
      "pubDate": "Sun, 08 Jun 2025 07:05:00 GMT"
    },
    {
      "title": "Trump's Call for Rate Cuts: A Clash with the Federal Reserve - MSN",
      "pubDate": "Sun, 08 Jun 2025 19:42:11 GMT"
    },
    {
      "title": "Fed Chair hit with savage message on interest rates - TheStreet",
      "pubDate": "Sun, 08 Jun 2025 13:56:38 GMT"
    },
    {
      "title": "What To Expect From Next Week's Federal Reserve Meeting on Interest Rates - Investopedia",
      "pubDate": "Fri, 13 Jun 2025 21:44:22 GMT"
    },
    {
      "title": "Federal Reserve to Release Bank Stress Test Results on June 27 - Bloomberg",
      "pubDate": "Fri, 13 Jun 2025 19:00:00 GMT"
    },
    {
      "title": "Why the Fed and ECB are no longer on the same page - Yahoo Finance",
      "pubDate": "Sat, 14 Jun 2025 15:00:34 GMT"
    }
  ],
  "republican_party": [
    {
      "title": "Trump-backed Simmons sins second term as NC’s GOP chairman - WRAL.com",
      "pubDate": "Sat, 07 Jun 2025 23:35:19 GMT"
    }
  ],
  "cybersecurity_and_infrastructure_security_agency": [
    {
      "title": "Trump cyber executive order drops Biden-era provisions - The Record from Recorded Future News",
      "pubDate": "Mon, 09 Jun 2025 13:46:40 GMT"
    },
    {
      "title": "House committee sets CISA budget cut at $135M, not Trump’s $495M - CyberScoop",
      "pubDate": "Tue, 10 Jun 2025 18:03:31 GMT"
    }
  ],
  "drones": [
    {
      "title": "Iran launches 100 drones at Israel in response to missile attack as markets reel - CNBC",
      "pubDate": "Fri, 13 Jun 2025 07:38:41 GMT"
    },
    {
      "title": "Iran launches missiles and drones at Israel as Israel attacks Iranian nuclear sites and top commanders, IDF says - CBS News",
      "pubDate": "Fri, 13 Jun 2025 18:50:00 GMT"
    },
    {
      "title": "Israel and Ukraine Show How Drone Smuggling Is Powerful New War Technique - The New York Times",
      "pubDate": "Sat, 14 Jun 2025 18:32:06 GMT"
    }
  ],
  "alexandria_ocasio-cortez": [
    {
      "title": "AOC Slams Democrats' Response To Violence In L.A. Protests: 'Everything Was Fine Until Trump Decided To Unleash Violent Raids' - Latin Times",
      "pubDate": "Wed, 11 Jun 2025 11:39:12 GMT"
    }
  ],
  "fusion_power": [
    {
      "title": "Nuclear fusion milestone: Germany's Wendelstein 7-X fusion reactor achieves 43-second plasma run, sets new triple product record - Business Today",
      "pubDate": "Sun, 08 Jun 2025 09:08:19 GMT"
    },
    {
      "title": "New facility to accelerate materials solutions for fusion energy - MIT News",
      "pubDate": "Mon, 09 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Europe’s fastest-growing nuclear fusion company raises $148 million in record funding round - CNBC",
      "pubDate": "Wed, 11 Jun 2025 08:29:29 GMT"
    },
    {
      "title": "Proxima Fusion Raises €130M Series A to Build World’s First Stellarator-Based Fusion Power Plant in the 2030S - Yahoo Finance",
      "pubDate": "Wed, 11 Jun 2025 07:01:00 GMT"
    },
    {
      "title": "Fusion energy industry gets £2.5bn funding boost - MSN",
      "pubDate": "Sat, 14 Jun 2025 06:59:53 GMT"
    }
  ],
  "brics": [
    {
      "title": "Russia confirms participation in upcoming BRICS summit in Brazil - Latest news from Azerbaijan",
      "pubDate": "Thu, 12 Jun 2025 10:23:59 GMT"
    }
  ],
  "health_care": [
    {
      "title": "Nearly 700,000 Americans Lose Health Care Coverage in 2025 - Newsweek",
      "pubDate": "Wed, 11 Jun 2025 10:00:02 GMT"
    }
  ],
  "world_news": [
    {
      "title": "Israel Says Gaza Aid Boat Passengers, Including Greta Thunberg, Are Being Deported - The New York Times",
      "pubDate": "Tue, 10 Jun 2025 04:07:12 GMT"
    },
    {
      "title": "Air India Dreamliner crashes into Ahmedabad college hostel, kills over 290 - Reuters",
      "pubDate": "Thu, 12 Jun 2025 16:29:43 GMT"
    },
    {
      "title": "Israel Attacks Iran News LIVE: Israel Strikes Iran Again, Less Than 24 Hours After Destroying Nuclear Sites - NDTV",
      "pubDate": "Fri, 13 Jun 2025 18:30:31 GMT"
    },
    {
      "title": "Israel hit Iran's nuclear sites and killed its top military commanders, Iran retaliated - as it happened - Reuters",
      "pubDate": "Sat, 14 Jun 2025 03:43:15 GMT"
    },
    {
      "title": "Iran confronts US at UNSC emergency meeting over Israeli strikes - The New Arab",
      "pubDate": "Sat, 14 Jun 2025 15:40:40 GMT"
    },
    {
      "title": "Iran launches new strike on Israel; Tehran rocked by explosions - Scripps News",
      "pubDate": "Sat, 14 Jun 2025 22:09:25 GMT"
    }
  ],
  "hurricanes": [
    {
      "title": "2025 hurricane season could see degraded forecasts because of weather service cuts - The Palm Beach Post",
      "pubDate": "Sat, 07 Jun 2025 22:19:35 GMT"
    },
    {
      "title": "Updated 2025 Atlantic hurricane season forecast maintains above-average predictions fueled by warm ocean temps - FOX Weather",
      "pubDate": "Wed, 11 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Scientists warn that future hurricanes will be off charts of current scale: 'We do need a new category' - The Cool Down",
      "pubDate": "Sun, 15 Jun 2025 00:25:00 GMT"
    }
  ],
  "health": [
    {
      "title": "Study reveals major health upside of going through menopause later - New York Post",
      "pubDate": "Sat, 07 Jun 2025 19:02:00 GMT"
    },
    {
      "title": "A promising new HIV vaccine was set to start trials. Then came Trump's latest cuts : Goats and Soda - NPR",
      "pubDate": "Tue, 10 Jun 2025 14:16:46 GMT"
    }
  ],
  "atlantic_ocean": [
    {
      "title": "Scientists revise timeline for possible collapse of key Atlantic ocean current - ehn.org",
      "pubDate": "Tue, 10 Jun 2025 09:31:06 GMT"
    }
  ],
  "artificial_general_intelligence": [
    {
      "title": "Mark Zuckerberg is assembling a team of experts to achieve artificial general intelligence - iblnews.org",
      "pubDate": "Tue, 10 Jun 2025 12:46:14 GMT"
    },
    {
      "title": "Sam Altman Says AI Has Already Gone Past The Event Horizon But No Worries Since AGI And ASI Will Be A Gentle Singularity - Forbes",
      "pubDate": "Thu, 12 Jun 2025 01:01:39 GMT"
    },
    {
      "title": "In a first, UN report calls for urgent action on AGI: What does it mean? - The Indian Express",
      "pubDate": "Thu, 12 Jun 2025 12:12:34 GMT"
    }
  ],
  "oceans": [
    {
      "title": "Ocean Temperatures Are Increasing Around the World. See Where. - The New York Times",
      "pubDate": "Mon, 09 Jun 2025 08:55:31 GMT"
    },
    {
      "title": "Ocean Acidity Has Reached Critical Levels, And We're All Under Threat - ScienceAlert",
      "pubDate": "Sat, 14 Jun 2025 22:01:19 GMT"
    }
  ],
  "hacking": [
    {
      "title": "Ukrainian Hacker Gets Arrested For Hacking 5,000 Accounts For Cryptojacking - Lowyat.NET",
      "pubDate": "Sun, 08 Jun 2025 05:31:59 GMT"
    }
  ],
  "openai": [
    {
      "title": "Exclusive: OpenAI taps Google in unprecedented cloud deal despite AI rivalry, sources say - Reuters",
      "pubDate": "Tue, 10 Jun 2025 17:22:17 GMT"
    }
  ],
  "data_breach": [
    {
      "title": "Largest ever data leak exposes over 4 billion user records - Cybernews",
      "pubDate": "Mon, 09 Jun 2025 12:54:18 GMT"
    },
    {
      "title": "AI is a data-breach time bomb, reveals new report - BleepingComputer",
      "pubDate": "Tue, 10 Jun 2025 14:02:00 GMT"
    },
    {
      "title": "Ocuco Data Breach Lawsuit Investigation - ClassAction.org",
      "pubDate": "Thu, 12 Jun 2025 20:34:16 GMT"
    },
    {
      "title": "JPMorgan Chase, Bank of America and TD Bank Issue Data Breach Alerts, Say Critical Information on Several Customers Compromised - The Daily Hodl",
      "pubDate": "Sat, 14 Jun 2025 14:30:56 GMT"
    }
  ],
  "biology": [
    {
      "title": "Ancient Protein Breaks Biological Rules by Working in a Mirror World - SciTechDaily",
      "pubDate": "Sun, 08 Jun 2025 03:06:01 GMT"
    },
    {
      "title": "US arrests another Chinese scientist for allegedly smuggling biological material - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 22:17:00 GMT"
    }
  ],
  "united_states": [
    {
      "title": "Trump's travel ban on 12 countries goes into effect early Monday - Reuters",
      "pubDate": "Sun, 08 Jun 2025 10:03:36 GMT"
    }
  ],
  "environment": [
    {
      "title": "The scientists warning the world about ocean acidification – ‘evil twin’ of the climate crisis - The Guardian",
      "pubDate": "Mon, 09 Jun 2025 04:00:00 GMT"
    }
  ],
  "atmospheric_science": [
    {
      "title": "Near-future rocket launches could slow ozone recovery - Nature",
      "pubDate": "Mon, 09 Jun 2025 22:10:14 GMT"
    }
  ],
  "world_economy": [
    {
      "title": "World Bank slashes global economic outlook as trade tensions continue - Al Jazeera",
      "pubDate": "Tue, 10 Jun 2025 16:25:10 GMT"
    },
    {
      "title": "Citing trade wars, the World Bank sharply downgrades global economic growth forecast to 2.3% - AP News",
      "pubDate": "Tue, 10 Jun 2025 13:42:00 GMT"
    },
    {
      "title": "World Bank Slashes Growth Projections Due to Tariff ‘Discord’ - PYMNTS.com",
      "pubDate": "Tue, 10 Jun 2025 20:07:00 GMT"
    },
    {
      "title": "Charting the Global Economy: Israeli Airstrikes Boost Oil Prices - Bloomberg",
      "pubDate": "Sat, 14 Jun 2025 09:00:00 GMT"
    }
  ],
  "apple": [
    {
      "title": "Analysis | Why Apple’s big events no longer feel revolutionary - The Washington Post",
      "pubDate": "Tue, 10 Jun 2025 23:30:00 GMT"
    }
  ],
  "blockchain": [
    {
      "title": "Bitcoin devs scramble to protect $2.2tn blockchain from looming quantum computer threat - dlnews.com",
      "pubDate": "Wed, 11 Jun 2025 12:42:06 GMT"
    }
  ],
  "pollution": [
    {
      "title": "Trump administration moves to repeal Biden power plant pollution rules - Reuters",
      "pubDate": "Wed, 11 Jun 2025 21:52:12 GMT"
    }
  ],
  "central_intelligence_agency": [
    {
      "title": "CIA analyst who leaked Israeli military plans gets three years in prison - The Washington Post",
      "pubDate": "Thu, 12 Jun 2025 02:46:17 GMT"
    },
    {
      "title": "Ex-CIA analyst Asif Rahman sentenced to 37 months for leaking Iran attack plans - Geo.tv",
      "pubDate": "Thu, 12 Jun 2025 04:50:00 GMT"
    },
    {
      "title": "Ex-CIA analyst gets 37 months for leaking top secret intel online - Israel National News",
      "pubDate": "Thu, 12 Jun 2025 05:27:00 GMT"
    },
    {
      "title": "CIA warns: Iran may have material for 8 nuclear bombs in just one month - Diario AS",
      "pubDate": "Sat, 14 Jun 2025 16:55:25 GMT"
    }
  ],
  "effects_of_global_warming": [
    {
      "title": "Parts of Britain could plunge to -30°C if the Gulf Stream collapses, scientists reveal - MSN",
      "pubDate": "Thu, 12 Jun 2025 06:10:09 GMT"
    }
  ],
  "kim_jong_un": [
    {
      "title": "Kim Jong-un caught building new nuclear bomb facility in North Korea as WW3 tensions grow - The Mirror US",
      "pubDate": "Thu, 12 Jun 2025 14:13:00 GMT"
    }
  ],
  "asteroids": [
    {
      "title": "Odds of ’city killer’ asteroid hitting Moon increases – what does that mean for us? - MSN",
      "pubDate": "Thu, 12 Jun 2025 10:54:42 GMT"
    },
    {
      "title": "Asteroid now poses real threat of hitting Moon, NASA warns - Global News",
      "pubDate": "Sun, 15 Jun 2025 03:01:42 GMT"
    }
  ],
  "chris_murphy": [
    {
      "title": "Sen. Murphy Says Israeli Attack on Iran Risks Regional War - WSJ",
      "pubDate": "Fri, 13 Jun 2025 00:55:50 GMT"
    }
  ],
  "military_and_defense": [
    {
      "title": "Israel attacks Iran, airstrikes kill armed forces and Revolutionary Guard chiefs - CNBC",
      "pubDate": "Fri, 13 Jun 2025 00:11:00 GMT"
    },
    {
      "title": "Israel targets Iranian military leaders, nuclear sites in wave of strikes: IDF - Breaking Defense",
      "pubDate": "Fri, 13 Jun 2025 12:38:13 GMT"
    },
    {
      "title": "IDF says Iran’s military intel, IRGC ballistic missile chiefs killed in strikes - The Times of Israel",
      "pubDate": "Sat, 14 Jun 2025 13:35:26 GMT"
    },
    {
      "title": "IDF soldier killed in Gaza fighting, bringing toll in military offensive to 430 - The Times of Israel",
      "pubDate": "Sun, 15 Jun 2025 06:05:33 GMT"
    }
  ],
  "military_intelligence": [
    {
      "title": "Israel destroys Iranian modern air defense systems - Defence Blog",
      "pubDate": "Fri, 13 Jun 2025 08:41:17 GMT"
    },
    {
      "title": "Israel's military intelligence chief says attack on Iran was to 'eliminate' threat - MSN",
      "pubDate": "Fri, 13 Jun 2025 11:43:06 GMT"
    }
  ],
  "battery_electric_vehicle": [
    {
      "title": "Global EV Sales Surge Past 7 Million - The EV Report",
      "pubDate": "Fri, 13 Jun 2025 11:38:05 GMT"
    }
  ],
  "national_security": [
    {
      "title": "Israel targets Iran's nuclear sites; Trump to meet with national security officials - CBS News",
      "pubDate": "Fri, 13 Jun 2025 11:00:00 GMT"
    }
  ],
  "earth": [
    {
      "title": "Scientists discover strong, unexpected link between Earth's magnetic field and oxygen levels - Live Science",
      "pubDate": "Fri, 13 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "Scientists Solve 50-Year Mystery of Strange Zone Deep Inside Earth - SciTechDaily",
      "pubDate": "Sun, 15 Jun 2025 10:29:10 GMT"
    }
  ],
  "political_corruption": [
    {
      "title": "Former Illinois House Speaker Michael Madigan given 7 1/2 years in federal corruption case - WQAD",
      "pubDate": "Fri, 13 Jun 2025 21:58:00 GMT"
    }
  ],
  "amazon": [
    {
      "title": "Amazon deforestation causing measurable drop in rainfall: study - Yahoo",
      "pubDate": "Sat, 14 Jun 2025 18:44:47 GMT"
    },
    {
      "title": "Amazon to invest $13 billion in Australia's data center infrastructure over five years - Reuters",
      "pubDate": "Sat, 14 Jun 2025 22:51:37 GMT"
    }
  ],
  "energy_storage": [
    {
      "title": "Scientists make revolutionary breakthrough that could transform energy storage: 'Truly a game-changer' - The Cool Down",
      "pubDate": "Sat, 14 Jun 2025 14:30:00 GMT"
    }
  ],
  "space_exploration": [
    {
      "title": "China makes history by firing precision laser at the moon in daylight, achieving a groundbreaking deep space milestone - Glass Almanac",
      "pubDate": "Sat, 14 Jun 2025 19:30:30 GMT"
    }
  ],
  "electric-vehicle_battery": [
    {
      "title": "Electric vehicle battery prices just crashed harder than anyone predicted - actumoteur.fr",
      "pubDate": "Sat, 14 Jun 2025 22:23:35 GMT"
    }
  ],
  "science": [
    {
      "title": "Scientists detect mysterious radio waves coming from beneath Antarctica’s ice - New York Post",
      "pubDate": "Sun, 15 Jun 2025 04:13:00 GMT"
    },
    {
      "title": "Scientists discover unexplained radio signals from beneath Antarctic ice - The Jerusalem Post",
      "pubDate": "Sun, 15 Jun 2025 09:35:00 GMT"
    }
  ]
}