{
  "donald_trump": [
    {
      "title": "Trump set to hold media event with Elon Musk at the White House - NBC News",
      "pubDate": "Fri, 30 May 2025 09:00:00 GMT"
    },
    {
      "title": "Behind Trump’s long campaign to target Chinese student visas - Politico",
      "pubDate": "Fri, 30 May 2025 09:55:00 GMT"
    },
    {
      "title": "Trump Has Found God. It’s Him. - Politico",
      "pubDate": "Fri, 30 May 2025 09:00:00 GMT"
    },
    {
      "title": "Trump Is Attempting a ‘Reverse Nixon’ - The Atlantic",
      "pubDate": "Fri, 30 May 2025 12:00:00 GMT"
    },
    {
      "title": "Live updates: Trump and Elon Musk to hold press event; court temporarily reinstates tariffs - NBC News",
      "pubDate": "Fri, 30 May 2025 11:15:37 GMT"
    },
    {
      "title": "Supreme Court allows Trump to revoke legal status of 500,000 immigrants - NBC News",
      "pubDate": "Fri, 30 May 2025 14:23:00 GMT"
    },
    {
      "title": "Supreme Court rules Trump can revoke protected status for 500,000 immigrants pending appeal - CNBC",
      "pubDate": "Fri, 30 May 2025 14:32:56 GMT"
    },
    {
      "title": "On the Campaign Trail, Elon Musk Juggled Drugs and Family Drama - The New York Times",
      "pubDate": "Fri, 30 May 2025 15:06:11 GMT"
    },
    {
      "title": "Does Trump Actually Think He's God? - Politico",
      "pubDate": "Fri, 30 May 2025 09:00:00 GMT"
    },
    {
      "title": "Trump demands bigger tax cuts in budget bill as Musk dodges question about reported drug use – US politics live - The Guardian",
      "pubDate": "Fri, 30 May 2025 09:43:00 GMT"
    },
    {
      "title": "Trump Accuses China of Violating Trade Truce, Escalating Tensions - The New York Times",
      "pubDate": "Fri, 30 May 2025 16:13:39 GMT"
    },
    {
      "title": "Trump says Elon Musk 'not really leaving' in Oval Office farewell - BBC",
      "pubDate": "Fri, 30 May 2025 20:25:07 GMT"
    },
    {
      "title": "Trump says Gaza ceasefire and nuclear deal with Iran are close - AP News",
      "pubDate": "Fri, 30 May 2025 20:20:00 GMT"
    },
    {
      "title": "Trump speaks at Pittsburgh steel plant after hosting Musk at White House - CNN",
      "pubDate": "Fri, 30 May 2025 21:40:00 GMT"
    },
    {
      "title": "Trump administration live updates: President raises steel tariff; PBS sues administration - NBC News",
      "pubDate": "Fri, 30 May 2025 23:19:31 GMT"
    },
    {
      "title": "Trump will hold a rally at U.S. Steel as investors seek clarity on Nippon deal. Here’s what we know - CNBC",
      "pubDate": "Fri, 30 May 2025 16:45:24 GMT"
    },
    {
      "title": "Trump says he wasn't aware of Musk reportedly using drugs during the 2024 campaign - USA Today",
      "pubDate": "Sat, 31 May 2025 02:06:55 GMT"
    },
    {
      "title": "Trump announces 50% steel tariffs and hails ‘blockbuster’ deal with Japan - The Guardian",
      "pubDate": "Fri, 30 May 2025 23:14:00 GMT"
    },
    {
      "title": "May 30, 2025 – Donald Trump presidency news - CNN",
      "pubDate": "Sat, 31 May 2025 03:16:00 GMT"
    },
    {
      "title": "Trump’s mass firings at several agencies will remain on hold, appeals court rules - CNN",
      "pubDate": "Sat, 31 May 2025 02:46:00 GMT"
    },
    {
      "title": "Lawyers for Migrants Press Appeals Court to Stop Trump’s Use of Alien Enemies Act - The New York Times",
      "pubDate": "Sat, 31 May 2025 05:32:03 GMT"
    },
    {
      "title": "From TACO to FAFO, investors love parodies of Trump acronyms - Reuters",
      "pubDate": "Fri, 30 May 2025 22:03:11 GMT"
    },
    {
      "title": "Trump's deals with law firms are like deals 'made with a gun to the head,' lawyers say - NPR",
      "pubDate": "Sat, 31 May 2025 09:00:00 GMT"
    },
    {
      "title": "Trump pardons drug kingpins even as he escalates U.S. drug war rhetoric - NPR",
      "pubDate": "Sat, 31 May 2025 10:00:00 GMT"
    },
    {
      "title": "Trump Is Planning a 'Garden of American Heroes' For the Country's Anniversary. Sculpture Experts Say It'll Never Happen. - Politico",
      "pubDate": "Sat, 31 May 2025 11:00:00 GMT"
    },
    {
      "title": "Daily State of Play: Trump’s Indefinite Refugee Ban and Funding Halt - CWS",
      "pubDate": "Sat, 31 May 2025 06:59:14 GMT"
    },
    {
      "title": "Todd and Julie Chrisley to live in this southern state after presidential pardon - Fox Business",
      "pubDate": "Sat, 31 May 2025 12:00:00 GMT"
    },
    {
      "title": "Impersonator breached Chief of Staff Susie Wiles’s phone, Trump says - The Washington Post",
      "pubDate": "Sat, 31 May 2025 13:51:22 GMT"
    },
    {
      "title": "Trump Explains Reason For Doubling Steel, Aluminum Tariffs - Time Magazine",
      "pubDate": "Sat, 31 May 2025 15:43:10 GMT"
    },
    {
      "title": "Trump pardons drive a big, burgeoning business for lobbyists - NBC News",
      "pubDate": "Sat, 31 May 2025 17:06:13 GMT"
    },
    {
      "title": "Trump gets key wins at Supreme Court on immigration, despite some misgivings - Reuters",
      "pubDate": "Sat, 31 May 2025 14:59:22 GMT"
    },
    {
      "title": "It’s called the Library of Congress. But Trump claims it’s his. - The Washington Post",
      "pubDate": "Sat, 31 May 2025 17:00:00 GMT"
    },
    {
      "title": "Trump pulls nomination for NASA administrator - The Hill",
      "pubDate": "Sat, 31 May 2025 20:36:00 GMT"
    },
    {
      "title": "Donald Trump Pulls NASA Nominee Days Before Senate Vote - Newsweek",
      "pubDate": "Sat, 31 May 2025 21:09:17 GMT"
    },
    {
      "title": "EU 'prepared to impose countermeasures' after Trump doubles steel tariffs to 50% - CNBC",
      "pubDate": "Sat, 31 May 2025 15:03:32 GMT"
    },
    {
      "title": "The fallout from Trump's war on Harvard will long outlast his presidency - BBC",
      "pubDate": "Sat, 31 May 2025 23:46:24 GMT"
    },
    {
      "title": "Trump to withdraw nomination of Musk ally to head NASA - PBS",
      "pubDate": "Sat, 31 May 2025 23:51:05 GMT"
    },
    {
      "title": "President Trump withdraws Isaacman nomination for NASA Administrator days before confirmation vote - Spaceflight Now",
      "pubDate": "Sun, 01 Jun 2025 03:06:27 GMT"
    },
    {
      "title": "Trump drops Nasa nominee Jared Isaacman, scrapping Elon Musk’s pick - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 03:18:00 GMT"
    },
    {
      "title": "Trump says Pakistani representatives coming to US next week for trade talks - Reuters",
      "pubDate": "Sat, 31 May 2025 23:51:55 GMT"
    },
    {
      "title": "Trump Shares Unhinged Conspiracy Theory That Biden’s a Clone - The Daily Beast",
      "pubDate": "Sun, 01 Jun 2025 06:36:00 GMT"
    },
    {
      "title": "Trump news at a glance: Hegseth warns of ‘imminent’ China threat, urging Asia to upgrade militaries - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 02:01:12 GMT"
    },
    {
      "title": "Trump administration’s deep cuts to public health leave system reeling - PBS",
      "pubDate": "Sat, 31 May 2025 22:15:40 GMT"
    },
    {
      "title": "Obscure provision in House bill threatens enforcement of court rulings on Trump - USA Today",
      "pubDate": "Sun, 01 Jun 2025 09:15:25 GMT"
    },
    {
      "title": "Why Trump is really going after Harvard - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 10:01:00 GMT"
    },
    {
      "title": "Investors eye May jobs report and Trump tariff updates: What to know this week - Yahoo Finance",
      "pubDate": "Sun, 01 Jun 2025 11:32:07 GMT"
    },
    {
      "title": "Trump says he will withdraw nomination of Musk associate Jared Isaacman to lead NASA - NPR",
      "pubDate": "Sun, 01 Jun 2025 09:33:07 GMT"
    },
    {
      "title": "Trump Spreads Bizarre Conspiracy Theory That Biden Was Executed and Replaced by a Robot Clone - Rolling Stone",
      "pubDate": "Sun, 01 Jun 2025 14:30:53 GMT"
    },
    {
      "title": "Trump, Xi likely to speak soon on minerals trade dispute, aides say - Reuters",
      "pubDate": "Sun, 01 Jun 2025 15:32:27 GMT"
    },
    {
      "title": "US budget chief calls fears that cuts to benefits will lead to deaths ‘totally ridiculous’ - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 16:01:00 GMT"
    },
    {
      "title": "Donald Trump shares false social media post saying Joe Biden was 'executed in 2020' - USA Today",
      "pubDate": "Sun, 01 Jun 2025 16:31:53 GMT"
    },
    {
      "title": "'It's completely unsustainable': Republican lawmaker doubles down, knocks Trump tax bill - USA Today",
      "pubDate": "Sun, 01 Jun 2025 18:30:55 GMT"
    },
    {
      "title": "Discrimination cases unravel as Trump scraps core civil rights tenet - The Washington Post",
      "pubDate": "Sun, 01 Jun 2025 22:24:47 GMT"
    },
    {
      "title": "Trump Amplifies Outlandish Robot Biden Conspiracy Theory - The New York Times",
      "pubDate": "Sun, 01 Jun 2025 22:28:53 GMT"
    },
    {
      "title": "How a Radical Ideology Infected the Supreme Court and Poisoned the Country - Rolling Stone",
      "pubDate": "Sun, 01 Jun 2025 21:59:36 GMT"
    },
    {
      "title": "Trump shares unfounded conspiracy theory claiming Biden was 'executed' in 2020 - NBC News",
      "pubDate": "Sun, 01 Jun 2025 23:32:32 GMT"
    },
    {
      "title": "Opinion | Donald Trump vs. Bruce Springsteen - WSJ",
      "pubDate": "Mon, 02 Jun 2025 02:42:25 GMT"
    },
    {
      "title": "Michael Cohen Makes Bold Prediction About Fate of Trump-Musk ‘Bromance’ - The Daily Beast",
      "pubDate": "Mon, 02 Jun 2025 03:33:00 GMT"
    },
    {
      "title": "Conservative Karol Nawrocki wins Poland's presidential election - NPR",
      "pubDate": "Mon, 02 Jun 2025 04:49:45 GMT"
    },
    {
      "title": "Trump's tariffs are 'not going away' amid legal battles, White House says - USA Today",
      "pubDate": "Sun, 01 Jun 2025 22:41:15 GMT"
    },
    {
      "title": "Donald Trump-Backed Candidate Wins Poland's Presidential Election - Newsweek",
      "pubDate": "Mon, 02 Jun 2025 04:10:23 GMT"
    },
    {
      "title": "Trump-backed nationalist clinches Poland's presidency - CNBC",
      "pubDate": "Mon, 02 Jun 2025 07:45:04 GMT"
    },
    {
      "title": "Trump overshadows Supreme Court as ruling season begins - NBC News",
      "pubDate": "Mon, 02 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Donald Trump's Reported Database Move Sparks Alarm: 'Dystopian' - Newsweek",
      "pubDate": "Mon, 02 Jun 2025 10:47:26 GMT"
    },
    {
      "title": "Trump's $5 million Gold Card offers the rich a fast lane to residency - NPR",
      "pubDate": "Mon, 02 Jun 2025 09:01:00 GMT"
    },
    {
      "title": "Major Companies Abandon Law Firms That Signed Deals with Trump: Report - Newsweek",
      "pubDate": "Mon, 02 Jun 2025 12:11:05 GMT"
    },
    {
      "title": "Trump is threatening to impose tariffs on two American companies - CNN",
      "pubDate": "Mon, 02 Jun 2025 11:40:00 GMT"
    },
    {
      "title": "Trump administration live updates: Senate prepares for work on GOP agenda bill as Congress returns from recess - NBC News",
      "pubDate": "Mon, 02 Jun 2025 13:51:23 GMT"
    },
    {
      "title": "Live updates: Trump reacts to Boulder attack; Supreme Court denies challenges to gun restrictions - NBC News",
      "pubDate": "Mon, 02 Jun 2025 17:37:58 GMT"
    },
    {
      "title": "The Secret History of Trump’s Private Cellphone - The Atlantic",
      "pubDate": "Mon, 02 Jun 2025 17:12:00 GMT"
    },
    {
      "title": "Trump attacks Federalist Society, crucial to his previous judicial nominations - MSNBC News",
      "pubDate": "Mon, 02 Jun 2025 10:00:41 GMT"
    },
    {
      "title": "Trump Tries to Blame Biden for Colorado Attack - Rolling Stone",
      "pubDate": "Mon, 02 Jun 2025 19:44:46 GMT"
    },
    {
      "title": "Live updates: Trump administration asks Supreme Court to allow mass layoff plan; Senate prepares to take up GOP megabill - NBC News",
      "pubDate": "Mon, 02 Jun 2025 20:12:55 GMT"
    },
    {
      "title": "Trump's budget calls for a 15% funding cut to the Education Department - NPR",
      "pubDate": "Mon, 02 Jun 2025 20:33:08 GMT"
    },
    {
      "title": "Trump's Truth posts mix wild conspiracies with market-moving policies - Axios",
      "pubDate": "Mon, 02 Jun 2025 17:28:03 GMT"
    },
    {
      "title": "Senators itching for Trump green light to move on Russia sanctions - The Hill",
      "pubDate": "Mon, 02 Jun 2025 23:50:00 GMT"
    },
    {
      "title": "A Trump Official Threatens to Sue California Schools Over Trans Athletes - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 01:54:10 GMT"
    },
    {
      "title": "Trump Talks a Lot About Antisemitism, With a Notable Caveat - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 22:31:55 GMT"
    },
    {
      "title": "Trump is pushing Senate GOP to get his megabill across the finish line - NPR",
      "pubDate": "Tue, 03 Jun 2025 01:45:09 GMT"
    },
    {
      "title": "White House releases new official Trump portrait. See it here. - CBS News",
      "pubDate": "Mon, 02 Jun 2025 22:43:00 GMT"
    },
    {
      "title": "Donald Trump's tariffs will hurt global growth, OECD warns - BBC",
      "pubDate": "Tue, 03 Jun 2025 08:45:19 GMT"
    },
    {
      "title": "Tallying Trump’s online posting frenzy: 2,262 ‘truths’ in 132 days - The Washington Post",
      "pubDate": "Tue, 03 Jun 2025 12:43:41 GMT"
    },
    {
      "title": "Trump admin live updates: Trump vows 'large scale fines' on California after trans athlete wins track event - ABC News",
      "pubDate": "Tue, 03 Jun 2025 12:15:00 GMT"
    },
    {
      "title": "White House Unveils a New Official Portrait of President Trump - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 14:33:38 GMT"
    },
    {
      "title": "Live updates: Top Jan. 6 prosecutor rips pardons; Trump's trade agenda showing cracks - NBC News",
      "pubDate": "Tue, 03 Jun 2025 14:55:53 GMT"
    },
    {
      "title": "Trump's ambitious push for trade deals is hitting some snags - NBC News",
      "pubDate": "Tue, 03 Jun 2025 09:00:42 GMT"
    },
    {
      "title": "Musk torches Trump budget bill: 'Disgusting abomination' - CNBC",
      "pubDate": "Tue, 03 Jun 2025 17:40:49 GMT"
    },
    {
      "title": "‘Disgusting abomination’: Musk goes nuclear on Trump’s ‘big beautiful bill’ - Politico",
      "pubDate": "Tue, 03 Jun 2025 18:07:09 GMT"
    },
    {
      "title": "‘The president is obsessed’: Trump fixates on Xi call amid faltering trade talks - Politico",
      "pubDate": "Tue, 03 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Live updates: Musk calls GOP tax cut and spending bill a ‘disgusting abomination’ - AP News",
      "pubDate": "Tue, 03 Jun 2025 21:42:00 GMT"
    },
    {
      "title": "Trump admin live updates: Trump signs executive order raising tariffs on steel, aluminum imports to 50% - ABC News",
      "pubDate": "Tue, 03 Jun 2025 22:32:00 GMT"
    },
    {
      "title": "Trump administration live updates: Musk rips GOP bill, Mike Johnson fires back - NBC News",
      "pubDate": "Tue, 03 Jun 2025 22:06:00 GMT"
    },
    {
      "title": "RNC Intervenes to Back Trump Anti-Voting Order, Claims Greater Voter Access Hurts Their Candidates - Democracy Docket",
      "pubDate": "Wed, 04 Jun 2025 00:00:52 GMT"
    },
    {
      "title": "Elon Musk Calls Trump Policy Bill a ‘Disgusting Abomination’ - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 00:19:12 GMT"
    },
    {
      "title": "The Trump-Musk breakup, briefly explained - vox.com",
      "pubDate": "Tue, 03 Jun 2025 22:05:00 GMT"
    },
    {
      "title": "Trump’s 50% tariffs on foreign steel and aluminum come into effect - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 03:55:00 GMT"
    },
    {
      "title": "Trump formally asks Congress to claw back approved spending targeted by DOGE - PBS",
      "pubDate": "Tue, 03 Jun 2025 21:14:56 GMT"
    },
    {
      "title": "Musk blasts Trump’s agenda bill as a ‘disgusting abomination,’ catching White House officials off guard - CNN",
      "pubDate": "Tue, 03 Jun 2025 20:01:00 GMT"
    },
    {
      "title": "Trump says China’s Xi is ‘hard to make a deal with’ - Financial Times",
      "pubDate": "Wed, 04 Jun 2025 06:40:25 GMT"
    },
    {
      "title": "As Trump raises deportation quotas, advocates fear an expanding ‘dragnet’ - Al Jazeera",
      "pubDate": "Wed, 04 Jun 2025 00:45:00 GMT"
    },
    {
      "title": "Michael Saylor’s bitcoin imitators are multiplying, from Trump to GameStop - Yahoo Finance",
      "pubDate": "Wed, 04 Jun 2025 08:00:33 GMT"
    },
    {
      "title": "Trump officials delayed farm trade report over deficit forecast - Politico",
      "pubDate": "Wed, 04 Jun 2025 09:55:00 GMT"
    },
    {
      "title": "Donald Trump and the art of the Oval Office confrontation - The Washington Post",
      "pubDate": "Wed, 04 Jun 2025 10:29:00 GMT"
    },
    {
      "title": "Trump unleashes MAGA rebellion on Federalist Society - The Hill",
      "pubDate": "Wed, 04 Jun 2025 12:00:00 GMT"
    },
    {
      "title": "Trump presses Powell on rates after fewest private-sector jobs generated in two years - The Hill",
      "pubDate": "Wed, 04 Jun 2025 13:05:00 GMT"
    },
    {
      "title": "Trump demands Federal Reserve chair lowers interest rates amid weak jobs report – US politics live - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 09:39:00 GMT"
    },
    {
      "title": "Live updates: Trump’s ‘big’ bill projected to add $2.4 trillion to national debt over coming decade - The Washington Post",
      "pubDate": "Wed, 04 Jun 2025 15:13:49 GMT"
    },
    {
      "title": "Republicans Try to Discredit Experts Warning About the Cost of Tax Cuts - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 16:13:12 GMT"
    },
    {
      "title": "Live updates: Trump discusses Russia-Ukraine war in call with Putin - NBC News",
      "pubDate": "Wed, 04 Jun 2025 17:54:26 GMT"
    },
    {
      "title": "Live updates: Musk escalates attacks on Trump’s legislative package, urging lawmakers to ‘KILL the BILL’ - The Washington Post",
      "pubDate": "Wed, 04 Jun 2025 19:43:49 GMT"
    },
    {
      "title": "'KILL the BILL': Elon Musk continues to blast Trump's bill in barrage of social media posts - ABC News",
      "pubDate": "Wed, 04 Jun 2025 19:41:15 GMT"
    },
    {
      "title": "Trump calls for scrapping debt limit, in megabill twist - Politico",
      "pubDate": "Wed, 04 Jun 2025 19:14:35 GMT"
    },
    {
      "title": "A federal court’s novel proposal to rein in Trump’s power grab - vox.com",
      "pubDate": "Wed, 04 Jun 2025 20:30:51 GMT"
    },
    {
      "title": "Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says - Sky News",
      "pubDate": "Wed, 04 Jun 2025 23:12:58 GMT"
    },
    {
      "title": "Trump admin live updates: Trump signs proclamation banning travel from 12 countries - ABC News",
      "pubDate": "Thu, 05 Jun 2025 00:16:00 GMT"
    },
    {
      "title": "Live updates: Trump announces travel ban affecting a dozen countries - AP News",
      "pubDate": "Thu, 05 Jun 2025 01:47:00 GMT"
    },
    {
      "title": "Trump bans nationals from 12 countries, citing security concerns - Reuters",
      "pubDate": "Thu, 05 Jun 2025 02:09:00 GMT"
    },
    {
      "title": "Trump bans citizens of 12 countries from entering the U.S. - CNBC",
      "pubDate": "Thu, 05 Jun 2025 03:29:00 GMT"
    },
    {
      "title": "Trump Orders Investigation of Biden and His Aides - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 03:12:11 GMT"
    },
    {
      "title": "NYC Democratic mayoral candidates debate; Trump talks Ukraine war with Putin - NBC News",
      "pubDate": "Thu, 05 Jun 2025 03:06:00 GMT"
    },
    {
      "title": "Trump announces travel ban and restrictions on 19 countries set to go into effect Monday - AP News",
      "pubDate": "Thu, 05 Jun 2025 03:19:00 GMT"
    },
    {
      "title": "Trump signs proclamation to suspend visas for new Harvard international students - CNN",
      "pubDate": "Thu, 05 Jun 2025 00:20:00 GMT"
    },
    {
      "title": "‘We Don’t Want Them’: Trump Signs Travel Ban on Citizens From 12 Countries - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 03:22:30 GMT"
    },
    {
      "title": "Trump aims to build a MAGA judiciary, breaking with traditional conservatives - NBC News",
      "pubDate": "Thu, 05 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Trump orders investigation into Biden presidency claiming aides hid his ‘serious cognitive decline’ - The Independent",
      "pubDate": "Thu, 05 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Trump issues a new travel ban. And, GOP raises concerns over the budget bill - NPR",
      "pubDate": "Thu, 05 Jun 2025 10:46:41 GMT"
    },
    {
      "title": "Trump orders investigation into alleged cover-up of Biden’s decline - The Washington Post",
      "pubDate": "Thu, 05 Jun 2025 06:41:00 GMT"
    },
    {
      "title": "Trump holds call with Xi, Chinese media says - CNBC",
      "pubDate": "Thu, 05 Jun 2025 12:58:04 GMT"
    },
    {
      "title": "Trump and Xi Hold Call, China Says - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 13:15:27 GMT"
    },
    {
      "title": "Trump speaks with Xi amid stalled talks between the US and China over tariffs - AP News",
      "pubDate": "Thu, 05 Jun 2025 13:02:00 GMT"
    },
    {
      "title": "Trump says Xi invited him to China during ‘very good’ phone call – live - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 09:29:00 GMT"
    },
    {
      "title": "Trump says he told Putin not to strike back at Ukraine after drone operation - NBC News",
      "pubDate": "Thu, 05 Jun 2025 16:41:05 GMT"
    },
    {
      "title": "Trump and Musk escalate public feud over agenda bill - CNN",
      "pubDate": "Thu, 05 Jun 2025 17:53:00 GMT"
    },
    {
      "title": "Elon Musk escalates feud with Trump: 'Time to drop the really big bomb' - USA Today",
      "pubDate": "Thu, 05 Jun 2025 20:01:43 GMT"
    },
    {
      "title": "Fury and resignation around the world as Trump's travel ban comes roaring back - NBC News",
      "pubDate": "Thu, 05 Jun 2025 17:18:04 GMT"
    },
    {
      "title": "Live updates: Musk says Trump would have lost the 2024 election without his help - The Washington Post",
      "pubDate": "Thu, 05 Jun 2025 23:11:39 GMT"
    },
    {
      "title": "Trump and Musk’s Unlikely Alliance Breaks Down in Rapid and Public Fashion - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 00:20:30 GMT"
    },
    {
      "title": "Live updates: Trump and Musk trade insults in escalating public feud - NBC News",
      "pubDate": "Fri, 06 Jun 2025 01:32:00 GMT"
    },
    {
      "title": "Trump Musk feud explodes with claim president is in Epstein files - ABC News",
      "pubDate": "Thu, 05 Jun 2025 20:37:30 GMT"
    },
    {
      "title": "Trump and Musk break up, and Washington holds its breath - AP News",
      "pubDate": "Fri, 06 Jun 2025 04:02:00 GMT"
    },
    {
      "title": "Musk-Trump fight: The tech billionaire and the president trade barbs - BBC",
      "pubDate": "Fri, 06 Jun 2025 04:49:28 GMT"
    },
    {
      "title": "Impeachment, Epstein and bitter acrimony: Trump and Musk joust in astonishing social media duel - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 19:45:00 GMT"
    },
    {
      "title": "Trump-Xi call restores trade truce. But the supply chain war has no end in sight - CNN",
      "pubDate": "Fri, 06 Jun 2025 08:14:00 GMT"
    },
    {
      "title": "Musk suggests ‘making peace’ after Trump feud would benefit US – US politics live - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 07:45:00 GMT"
    },
    {
      "title": "Live updates: Trump is 'not interested' in a make-up call with Elon Musk, White House official says - NBC News",
      "pubDate": "Fri, 06 Jun 2025 11:49:54 GMT"
    },
    {
      "title": "Live updates: Trump calls Elon Musk ‘the man who has lost his mind’ as feud continues - The Washington Post",
      "pubDate": "Fri, 06 Jun 2025 13:44:08 GMT"
    },
    {
      "title": "Trump Has No Plans to Call Musk, Officials Say, as Both Face Risks in Feud: Live Updates - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 14:41:19 GMT"
    },
    {
      "title": "Trump live: US president ‘not interested’ in talking to Musk, official says - Al Jazeera",
      "pubDate": "Fri, 06 Jun 2025 15:04:14 GMT"
    },
    {
      "title": "The latest on the feud between Trump and Musk - CNN",
      "pubDate": "Fri, 06 Jun 2025 16:08:00 GMT"
    },
    {
      "title": "Trump is not interested in talking to Musk as they feud over tax-cut bill - Reuters",
      "pubDate": "Fri, 06 Jun 2025 15:52:16 GMT"
    },
    {
      "title": "Buildup to a Meltdown: How the Trump-Musk Alliance Collapsed - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 18:09:30 GMT"
    },
    {
      "title": "Trump preparing large-scale cancellation of federal funding for California, sources say - CNN",
      "pubDate": "Fri, 06 Jun 2025 20:18:00 GMT"
    },
    {
      "title": "Live updates: Trump and Musk feud; Kilmar Abrego Garcia news | CNN Politics - CNN",
      "pubDate": "Fri, 06 Jun 2025 21:15:00 GMT"
    },
    {
      "title": "Trump says he has no plans to speak to Musk as feud persists - Reuters",
      "pubDate": "Fri, 06 Jun 2025 23:04:25 GMT"
    },
    {
      "title": "Trump news at a glance: Elon Musk rift deepens as president says ‘poor guy’s got a problem’ - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 23:46:20 GMT"
    },
    {
      "title": "Trump Pressures Fed’s Powell to Cut Rates ‘A Full Point’ - Bloomberg.com",
      "pubDate": "Fri, 06 Jun 2025 23:00:31 GMT"
    },
    {
      "title": "Newsom floats withholding federal taxes as Trump threatens California - Politico",
      "pubDate": "Fri, 06 Jun 2025 22:45:05 GMT"
    },
    {
      "title": "Will Musk's explosive row with Trump help or harm his businesses? - BBC",
      "pubDate": "Fri, 06 Jun 2025 23:18:39 GMT"
    },
    {
      "title": "Trump-Musk feud live updates: President to sell Tesla amid bitter public split - The Independent",
      "pubDate": "Sat, 07 Jun 2025 02:39:00 GMT"
    },
    {
      "title": "Most Republicans side with Trump over Musk: Poll - Axios",
      "pubDate": "Fri, 06 Jun 2025 20:48:02 GMT"
    }
  ],
  "ukraine": [
    {
      "title": "Ukraine Accuses Russia of Stalling Peace Negotiations - The New York Times",
      "pubDate": "Fri, 30 May 2025 10:43:43 GMT"
    },
    {
      "title": "Ukraine’s biker squad seeks to outrun Russian drones - Financial Times",
      "pubDate": "Fri, 30 May 2025 11:30:09 GMT"
    },
    {
      "title": "Russia tells UN West must stop arming Ukraine during any ceasefire - Reuters",
      "pubDate": "Fri, 30 May 2025 15:13:27 GMT"
    },
    {
      "title": "Ukraine awaiting Russia peace proposal ahead of Istanbul talks - BBC",
      "pubDate": "Fri, 30 May 2025 15:46:34 GMT"
    },
    {
      "title": "Ukraine keeps Russia guessing over talks, US senator warns Moscow of sanctions - Reuters",
      "pubDate": "Fri, 30 May 2025 21:09:22 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Trump envoy says UK to join US at next peace talks while Putin told ‘take the deal’ - The Independent",
      "pubDate": "Sat, 31 May 2025 04:17:23 GMT"
    },
    {
      "title": "Ukraine war briefing: Zelenskyy accuses Moscow of doing ‘everything it can’ to sabotage peace talks - The Guardian",
      "pubDate": "Sat, 31 May 2025 01:14:00 GMT"
    },
    {
      "title": "Ukraine war latest: Ukraine attacks elite Russian unit base nearly 7,000km away in Vladivostok, source claims - The Kyiv Independent",
      "pubDate": "Fri, 30 May 2025 19:07:40 GMT"
    },
    {
      "title": "Next round of Russia-Ukraine talks uncertain as Moscow won’t reveal terms - The Washington Post",
      "pubDate": "Sat, 31 May 2025 03:12:21 GMT"
    },
    {
      "title": "Ukraine Strikes Russian Target in Far East Before Planned Talks - Bloomberg.com",
      "pubDate": "Sat, 31 May 2025 10:14:19 GMT"
    },
    {
      "title": "Russia seizes more Ukrainian territory amid fears of fresh ground offensive - The Guardian",
      "pubDate": "Sat, 31 May 2025 12:09:00 GMT"
    },
    {
      "title": "Ukraine orders evacuation of 11 villages on Russian border as Kyiv braces for Sumy offensive - France 24",
      "pubDate": "Sat, 31 May 2025 10:11:14 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Child killed in Russian strike after Zelensky accuses Putin of sabotaging talks - The Independent",
      "pubDate": "Sat, 31 May 2025 13:52:35 GMT"
    },
    {
      "title": "Russian Air Attacks Kill Two in Ukraine - The Moscow Times",
      "pubDate": "Sat, 31 May 2025 09:22:00 GMT"
    },
    {
      "title": "At least 10 killed, 33 injured in Russian attacks across Ukraine overnight, officials say - ABC News",
      "pubDate": "Sat, 31 May 2025 11:05:01 GMT"
    },
    {
      "title": "Russian occupation in Ukraine: Silent acts of resistance and fear - BBC",
      "pubDate": "Sat, 31 May 2025 23:53:22 GMT"
    },
    {
      "title": "Russia-Ukraine war: List of key events, day 1,193 - Al Jazeera",
      "pubDate": "Sun, 01 Jun 2025 00:37:37 GMT"
    },
    {
      "title": "Could Ukraine Develop A Nuclear Bomb That Halts Russia’s Invasion? - Forbes",
      "pubDate": "Sun, 01 Jun 2025 01:57:09 GMT"
    },
    {
      "title": "Seven killed after bridge collapse, train derailment in Russia's Bryansk region bordering Ukraine - Reuters",
      "pubDate": "Sun, 01 Jun 2025 03:58:00 GMT"
    },
    {
      "title": "Putin’s tough stance on a Ukraine peace plan shows his resolve on Russia’s demands - AP News",
      "pubDate": "Sun, 01 Jun 2025 04:09:00 GMT"
    },
    {
      "title": "Ukraine stages major attack on Russian aircraft with drones, security official says - Reuters",
      "pubDate": "Sun, 01 Jun 2025 12:22:28 GMT"
    },
    {
      "title": "Ukraine drone attack hits more than 40 Russian bomber planes, claims Ukrainian security service - BBC",
      "pubDate": "Sun, 01 Jun 2025 12:37:57 GMT"
    },
    {
      "title": "Ukraine and Russia exchange massive air strikes ahead of peace talks - Financial Times",
      "pubDate": "Sun, 01 Jun 2025 13:58:39 GMT"
    },
    {
      "title": "Ukraine destroys more than 40 military aircraft in a drone attack deep inside Russia - NPR",
      "pubDate": "Sun, 01 Jun 2025 14:31:53 GMT"
    },
    {
      "title": "Seven dead after two Russian bridges collapse in regions near Ukraine - The Washington Post",
      "pubDate": "Sun, 01 Jun 2025 15:52:01 GMT"
    },
    {
      "title": "Large-Scale Ukrainian Attack Targets Air Bases in Russia, Authorities Say - The New York Times",
      "pubDate": "Sun, 01 Jun 2025 12:00:00 GMT"
    },
    {
      "title": "Ukraine says it hit dozens of Russian bombers in daring drone attack - politico.eu",
      "pubDate": "Sun, 01 Jun 2025 16:04:00 GMT"
    },
    {
      "title": "Russia and Ukraine step up the war on eve of peace talks - Reuters",
      "pubDate": "Sun, 01 Jun 2025 17:32:13 GMT"
    },
    {
      "title": "Ukraine drones strike bombers during major attack in Russia - BBC",
      "pubDate": "Sun, 01 Jun 2025 20:36:54 GMT"
    },
    {
      "title": "Ukraine Drone Strikes Hit Nuclear Bombers Deep Inside Russia - Bloomberg.com",
      "pubDate": "Sun, 01 Jun 2025 19:18:09 GMT"
    },
    {
      "title": "Ukraine attacks Russian air bases in far-reaching drone strikes - The Washington Post",
      "pubDate": "Mon, 02 Jun 2025 01:02:46 GMT"
    },
    {
      "title": "Ukraine Says It Destroyed Dozens of Warplanes Deep Inside Russia - WSJ",
      "pubDate": "Sun, 01 Jun 2025 21:35:00 GMT"
    },
    {
      "title": "Ukraine destroys 40 aircraft deep inside Russia ahead of peace talks in Istanbul - AP News",
      "pubDate": "Mon, 02 Jun 2025 00:55:00 GMT"
    },
    {
      "title": "Ukraine launches massive drone strike on air bases deep inside Russia - Axios",
      "pubDate": "Sun, 01 Jun 2025 22:59:21 GMT"
    },
    {
      "title": "Ukraine's audacious drone attack sends critical message to Russia - and the West - BBC",
      "pubDate": "Sun, 01 Jun 2025 20:52:16 GMT"
    },
    {
      "title": "Ukraine targets Russian airfields in major drone attack - ABC News",
      "pubDate": "Mon, 02 Jun 2025 03:11:15 GMT"
    },
    {
      "title": "What we know about Ukraine's drone strikes on airbases in Russia - France 24",
      "pubDate": "Mon, 02 Jun 2025 05:59:55 GMT"
    },
    {
      "title": "Russia launches deadly attacks across Ukraine before Istanbul talks with Kyiv – Russia-Ukraine war live - The Guardian",
      "pubDate": "Mon, 02 Jun 2025 07:14:00 GMT"
    },
    {
      "title": "Russia and Ukraine to talk about peace but are still far apart - Reuters",
      "pubDate": "Mon, 02 Jun 2025 08:19:22 GMT"
    },
    {
      "title": "Ukraine's massive drone attack deep inside Russia lays bare Putin's vulnerability - NBC News",
      "pubDate": "Mon, 02 Jun 2025 10:38:32 GMT"
    },
    {
      "title": "Russia, Ukraine set to hold more peace talks after Kyiv strikes nuclear-capable bombers - Reuters",
      "pubDate": "Mon, 02 Jun 2025 11:36:46 GMT"
    },
    {
      "title": "Ukraine destroys Russian bombers with shocking barrage of drones ahead of peace talks - NPR",
      "pubDate": "Mon, 02 Jun 2025 08:12:42 GMT"
    },
    {
      "title": "Ukraine-Russia peace talks end after barely an hour, Turkish officials say - Reuters",
      "pubDate": "Mon, 02 Jun 2025 13:33:37 GMT"
    },
    {
      "title": "In Drone Attacks on Russia, Ukraine Aims for Strategic and Symbolic Blow - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 15:21:37 GMT"
    },
    {
      "title": "Ukraine-Russia peace talks end with no deal, POW swap agreed - BBC",
      "pubDate": "Mon, 02 Jun 2025 16:17:22 GMT"
    },
    {
      "title": "Russia and Ukraine reach deal on new POW swap and handover of bodies - Reuters",
      "pubDate": "Mon, 02 Jun 2025 15:49:47 GMT"
    },
    {
      "title": "Ukraine’s Stunning Assault Roils Russia’s Global Military Strategy - WSJ",
      "pubDate": "Mon, 02 Jun 2025 16:10:00 GMT"
    },
    {
      "title": "Ukraine Building Drone Hunters as Fight Moves Far Beyond Front - Bloomberg",
      "pubDate": "Mon, 02 Jun 2025 12:49:35 GMT"
    },
    {
      "title": "A surprise drone attack on airfields across Russia encapsulates Ukraine's wartime strategy - ABC News",
      "pubDate": "Mon, 02 Jun 2025 13:31:44 GMT"
    },
    {
      "title": "What Ukraine’s Unprecedented Drone Attack Means For Russia’s Bomber Force - The War Zone",
      "pubDate": "Mon, 02 Jun 2025 18:23:22 GMT"
    },
    {
      "title": "Ukraine Executes ‘Longest Range Operation’ Striking Russian Air Bases with FPV Drones - The Aviationist",
      "pubDate": "Mon, 02 Jun 2025 13:45:17 GMT"
    },
    {
      "title": "How Ukraine carried out daring 'Spider Web' attack on Russian bombers - BBC",
      "pubDate": "Mon, 02 Jun 2025 18:49:20 GMT"
    },
    {
      "title": "Ukraine’s drone attack a ‘humiliation’ that reveals ‘tactical weakness’ in Russia - NBC News",
      "pubDate": "Mon, 02 Jun 2025 22:19:31 GMT"
    },
    {
      "title": "Russia and Ukraine fail again to agree ceasefire but commit to prisoner swap - BBC",
      "pubDate": "Mon, 02 Jun 2025 21:10:29 GMT"
    },
    {
      "title": "How Ukraine’s Drone Arsenal Shocked Russia and Changed Modern Warfare - Bloomberg.com",
      "pubDate": "Tue, 03 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Ukraine Shows It Can Still Flip the Script on How Wars Are Waged - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 04:51:00 GMT"
    },
    {
      "title": "Ukraine war live: Zelenskyy calls for sanctions after ‘savage’ Russian attack on Sumy kills three people - The Guardian",
      "pubDate": "Tue, 03 Jun 2025 07:50:00 GMT"
    },
    {
      "title": "Ukraine Hid Attack Drones in Russia. These Videos Show What Happened Next. - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 01:05:16 GMT"
    },
    {
      "title": "Ukraine says it has struck bridge connecting Russia to Crimea with underwater explosives - CNN",
      "pubDate": "Tue, 03 Jun 2025 11:41:00 GMT"
    },
    {
      "title": "Russia closes Crimea bridge hours after Ukraine underwater strike - BBC",
      "pubDate": "Tue, 03 Jun 2025 13:45:40 GMT"
    },
    {
      "title": "Ukraine Defaults on Sovereign Debt Payment - WSJ",
      "pubDate": "Tue, 03 Jun 2025 09:04:00 GMT"
    },
    {
      "title": "As Russia reels from drone attack, Ukraine targets vital Crimea Bridge - The Washington Post",
      "pubDate": "Tue, 03 Jun 2025 17:13:41 GMT"
    },
    {
      "title": "Ukraine claims attack on Kerch Bridge linking Crimea, Russia - Al Jazeera",
      "pubDate": "Tue, 03 Jun 2025 17:40:31 GMT"
    },
    {
      "title": "Ukraine Reports Striking Russia-Crimea Bridge With Underwater Explosives - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 12:05:08 GMT"
    },
    {
      "title": "Troop Casualties in Ukraine War Near 1.4 Million, Study Finds - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 20:10:31 GMT"
    },
    {
      "title": "Putin's uncompromising demands emerge after the latest round of Russia-Ukraine peace talks - AP News",
      "pubDate": "Tue, 03 Jun 2025 18:30:00 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Crimean bridge blown up in massive explosion, say Kyiv’s special forces - The Independent",
      "pubDate": "Tue, 03 Jun 2025 22:23:41 GMT"
    },
    {
      "title": "Ukraine’s ‘Trojan Horse’ Strike Scorches Putin - Center for European Policy Analysis (CEPA)",
      "pubDate": "Tue, 03 Jun 2025 13:12:04 GMT"
    },
    {
      "title": "Ukraine's drone attack on Russia just exposed a huge global nuclear vulnerability - MSNBC News",
      "pubDate": "Tue, 03 Jun 2025 20:32:00 GMT"
    },
    {
      "title": "Ukraine hits Putin’s bridge to Crimea with underwater bomb attack - The Independent",
      "pubDate": "Tue, 03 Jun 2025 18:15:00 GMT"
    },
    {
      "title": "Opinion | Ukraine’s Drone Strike Is a Warning—for the U.S. - WSJ",
      "pubDate": "Wed, 04 Jun 2025 03:29:34 GMT"
    },
    {
      "title": "As Ukraine batters Russia with daring assaults, firebrand pro-Kremlin pundits rattle nuclear sabres - CNN",
      "pubDate": "Wed, 04 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Inside the Ukrainian Drone Operation That Devastated Russia’s Bomber Fleet - WSJ",
      "pubDate": "Wed, 04 Jun 2025 02:57:00 GMT"
    },
    {
      "title": "Ukraine war briefing: Satellite pictures show Russian warplanes prey to ‘Spiderweb’ - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 00:24:00 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Kyiv’s audacious Operation Spiderweb ‘was like raid that killed Bin Laden’ - The Independent",
      "pubDate": "Wed, 04 Jun 2025 11:49:08 GMT"
    },
    {
      "title": "Almost 1 million Russian troops killed or wounded in Ukraine war, study says - NBC News",
      "pubDate": "Wed, 04 Jun 2025 09:26:27 GMT"
    },
    {
      "title": "Ukraine’s surprise drone strike underscores vulnerability of U.S. defenses - The Washington Post",
      "pubDate": "Wed, 04 Jun 2025 13:54:47 GMT"
    },
    {
      "title": "UK defence secretary confirms plans for drone deliveries as Ukraine military aid meeting opens – Europe live - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 09:17:00 GMT"
    },
    {
      "title": "Russia urges US and UK to restrain Ukraine after attacks on bombers - Reuters",
      "pubDate": "Wed, 04 Jun 2025 14:07:32 GMT"
    },
    {
      "title": "Satellite images show Russian bombers destroyed in Ukraine attack - BBC",
      "pubDate": "Wed, 04 Jun 2025 18:37:41 GMT"
    },
    {
      "title": "Ukraine releases dramatic FPV footage of drone attack on Russian airbases – video - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 17:43:00 GMT"
    },
    {
      "title": "Satellite images show destruction of Russian planes by Ukraine's drones - NBC News",
      "pubDate": "Wed, 04 Jun 2025 17:46:02 GMT"
    },
    {
      "title": "Ukraine war briefing: Don’t be weak, Zelenskyy tells allies, after Putin threats - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 03:58:00 GMT"
    },
    {
      "title": "5 killed, 6 injured in Russian drone strike on Chernihiv Oblast - The Kyiv Independent",
      "pubDate": "Thu, 05 Jun 2025 05:52:05 GMT"
    },
    {
      "title": "Ukraine war live: Putin launches glide bomb strike on key city after revenge warning - The Independent",
      "pubDate": "Thu, 05 Jun 2025 08:54:58 GMT"
    },
    {
      "title": "Russia’s war on Ukraine intensifies as peace talks appear at dead end - Al Jazeera",
      "pubDate": "Thu, 05 Jun 2025 10:18:45 GMT"
    },
    {
      "title": "Russian drone strike kills 5 as Moscow pledges response to Ukraine attacks - Al Jazeera",
      "pubDate": "Thu, 05 Jun 2025 11:23:56 GMT"
    },
    {
      "title": "Ukraine’s drone attack on Russian air bases is a lesson for the West on its vulnerabilities - AP News",
      "pubDate": "Thu, 05 Jun 2025 13:41:00 GMT"
    },
    {
      "title": "How Ukraine pulled off an audacious attack deep inside Russia - Reuters",
      "pubDate": "Thu, 05 Jun 2025 13:43:54 GMT"
    },
    {
      "title": "Live updates: Trump says it might be good to let Ukraine and Russia ‘fight for a while’ - AP News",
      "pubDate": "Thu, 05 Jun 2025 17:31:00 GMT"
    },
    {
      "title": "Russia says it will respond to Ukraine attacks, Trump downplays immediate peace prospects - Reuters",
      "pubDate": "Thu, 05 Jun 2025 19:28:19 GMT"
    },
    {
      "title": "Russia launches aerial assault on Kyiv days after Ukraine’s audacious drone attack on bomber fleet - CNN",
      "pubDate": "Fri, 06 Jun 2025 00:04:00 GMT"
    },
    {
      "title": "Ukraine under ongoing Russian missile and drone attack that has wounded at least 3 - AP News",
      "pubDate": "Fri, 06 Jun 2025 00:44:00 GMT"
    },
    {
      "title": "Russia-Ukraine war live: Kyiv under drone and missile assault after Russia vowed to retaliate for attack on bombers - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 01:17:36 GMT"
    },
    {
      "title": "Russia launches strikes on Kyiv, Ukraine says - BBC",
      "pubDate": "Fri, 06 Jun 2025 02:06:02 GMT"
    },
    {
      "title": "Russian drones and missiles mount heavy barrage on Ukraine's capital - Reuters",
      "pubDate": "Fri, 06 Jun 2025 03:28:00 GMT"
    },
    {
      "title": "Intense Russian air attack on Ukraine's capital kills four - Reuters",
      "pubDate": "Fri, 06 Jun 2025 05:31:02 GMT"
    },
    {
      "title": "UPDATE: Russia hits Ukraine with large-scale attack days after Operation Spiderweb - The Kyiv Independent",
      "pubDate": "Thu, 05 Jun 2025 23:40:11 GMT"
    },
    {
      "title": "A Russian missile and drone attack across Ukraine kills 4 in the capital - AP News",
      "pubDate": "Fri, 06 Jun 2025 06:51:00 GMT"
    },
    {
      "title": "Russia bombards Kyiv after Putin vows revenge for Operation Spiderweb - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 04:12:00 GMT"
    },
    {
      "title": "Russia Pummels Kyiv in Apparent Retaliation for Ukrainian Drone Assault - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 10:48:00 GMT"
    },
    {
      "title": "Russia launches massive drone and missile attack on Ukraine, killing 3 in Kyiv - NPR",
      "pubDate": "Fri, 06 Jun 2025 10:11:25 GMT"
    },
    {
      "title": "Russia launches huge attack on Ukraine days after ‘Spider Web’ drone raid - politico.eu",
      "pubDate": "Fri, 06 Jun 2025 10:56:00 GMT"
    },
    {
      "title": "Russia Launches Massive Aerial Bombardment of Ukraine - Foreign Policy",
      "pubDate": "Fri, 06 Jun 2025 20:58:39 GMT"
    },
    {
      "title": "Russia launches biggest drone attack on Ukraine's Kharkiv - mayor - BBC",
      "pubDate": "Sat, 07 Jun 2025 04:23:52 GMT"
    }
  ],
  "recession": [
    {
      "title": "Recession fears recede but still higher than they were at the start of the year - Investment Week",
      "pubDate": "Fri, 30 May 2025 13:42:57 GMT"
    },
    {
      "title": "No clear recession signal despite recent weak data, says CIO - Yahoo Finance",
      "pubDate": "Fri, 30 May 2025 20:17:40 GMT"
    },
    {
      "title": "Russia teeters on brink of recession - The Bell",
      "pubDate": "Fri, 30 May 2025 21:53:52 GMT"
    },
    {
      "title": "If There's Such a Thing as a Recession-Resistant Stock, This Is It - Yahoo Finance",
      "pubDate": "Fri, 30 May 2025 21:15:00 GMT"
    },
    {
      "title": "Is a Recession Imminent Under President Donald Trump? Here's What More Than 110 Years of History Has to Say. - Yahoo Finance",
      "pubDate": "Sat, 31 May 2025 07:06:00 GMT"
    },
    {
      "title": "Expert Worries Fed Cuts and Recession Risk Could be Ahead for Mass - Franklin Observer",
      "pubDate": "Sat, 31 May 2025 09:09:25 GMT"
    },
    {
      "title": "Forget tariffs, here's why CEOs worry about a looming recession - TheStreet",
      "pubDate": "Sat, 31 May 2025 14:07:00 GMT"
    },
    {
      "title": "Fears of a US recession force ultra-wealthy to bail on rentals in popular summer hotspot - MSN",
      "pubDate": "Sun, 01 Jun 2025 03:11:12 GMT"
    },
    {
      "title": "The resurgence of micro-skirts could be a recession indicator - TheAggie.org",
      "pubDate": "Sun, 01 Jun 2025 01:17:12 GMT"
    },
    {
      "title": "Survey: More than half of Americans expect to spend less on fun purchases this year - The Spokesman-Review",
      "pubDate": "Sun, 01 Jun 2025 07:00:00 GMT"
    },
    {
      "title": "ASX to make slight gain as US recession fears grow - AFR",
      "pubDate": "Sun, 01 Jun 2025 05:54:00 GMT"
    },
    {
      "title": "Economist claims recession is ‘not the vibe’ in the US - MSN",
      "pubDate": "Sun, 01 Jun 2025 07:50:55 GMT"
    },
    {
      "title": "Global Imbalances as Global Recession EWS? - Econbrowser",
      "pubDate": "Sun, 01 Jun 2025 19:00:57 GMT"
    },
    {
      "title": "50 Unusual Recession Indicators, From Hair Color to Men's Underwear - MSN",
      "pubDate": "Sun, 01 Jun 2025 16:51:07 GMT"
    },
    {
      "title": "Rising Mortgage Rates and Recession Fears Stall a Fragile Housing Market - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 09:00:55 GMT"
    },
    {
      "title": "Recession Avoided, For Now (SPX) - Seeking Alpha",
      "pubDate": "Mon, 02 Jun 2025 18:45:00 GMT"
    },
    {
      "title": "Fresh Layoffs In Microsoft After Last Month’s 6000 Job Cuts Triggers The Internet: ‘Recession Is Already Here’ - Mashable India",
      "pubDate": "Tue, 03 Jun 2025 05:50:37 GMT"
    },
    {
      "title": "Economists wary of potential recession as tariffs challenge businesses - South Dakota Public Broadcasting",
      "pubDate": "Tue, 03 Jun 2025 11:54:00 GMT"
    },
    {
      "title": "Recession Fears Trigger Major Moves in the Stock Market - MSN",
      "pubDate": "Tue, 03 Jun 2025 11:42:44 GMT"
    },
    {
      "title": "Recession-ready HR: Using generative AI to stabilize talent and costs - SmartBrief",
      "pubDate": "Tue, 03 Jun 2025 17:15:15 GMT"
    },
    {
      "title": "Mark Cuban predicts painful red rural recession — here are 4 states he says should brace for economic fallout - The Economic Times",
      "pubDate": "Tue, 03 Jun 2025 17:48:34 GMT"
    },
    {
      "title": "Trump’s tariff u-turn averted hard landing, but US recession risks climbing: UBS - Investing.com",
      "pubDate": "Tue, 03 Jun 2025 18:43:53 GMT"
    },
    {
      "title": "Global Recession Looms in US and China PMI Data. Will Markets Notice? - tastylive",
      "pubDate": "Tue, 03 Jun 2025 23:30:51 GMT"
    },
    {
      "title": "Australia slides back into ‘recession’ - News.com.au",
      "pubDate": "Wed, 04 Jun 2025 02:15:00 GMT"
    },
    {
      "title": "Recession Risks; AI Infrastructure; and Exploring Sector-Specific Tariffs - S&P Global",
      "pubDate": "Wed, 04 Jun 2025 11:00:38 GMT"
    },
    {
      "title": "Australia is on the brink of sliding back into another 'recession' - MSN",
      "pubDate": "Wed, 04 Jun 2025 08:33:29 GMT"
    },
    {
      "title": "Nearly 11 million Americans would lose insurance under Trump's tax bill, analysis says - USA Today",
      "pubDate": "Wed, 04 Jun 2025 19:32:07 GMT"
    },
    {
      "title": "US Dollar Index (DXY) remains depressed below 99.00 as recession fears return - FXStreet",
      "pubDate": "Thu, 05 Jun 2025 08:30:36 GMT"
    },
    {
      "title": "Will There Be a Recession in 2025? - Norada Real Estate Investments",
      "pubDate": "Thu, 05 Jun 2025 11:42:20 GMT"
    },
    {
      "title": "Musk goes scorched earth: Trump will cause recession, implies he should be impeached - Politico",
      "pubDate": "Thu, 05 Jun 2025 22:09:33 GMT"
    },
    {
      "title": "Musk predicts Trump’s tariffs will cause recession amid growing spat with president - The Hill",
      "pubDate": "Thu, 05 Jun 2025 21:26:00 GMT"
    },
    {
      "title": "Audit partner pessimism surges amid risk of recession: CAQ survey - CFO Dive",
      "pubDate": "Thu, 05 Jun 2025 21:01:34 GMT"
    },
    {
      "title": "Elon Musk warns Donald Trump’s tariffs could trigger recession by late 2025 - Mint",
      "pubDate": "Fri, 06 Jun 2025 03:51:33 GMT"
    },
    {
      "title": "Data raise the question: Were economists wrong again? - Inquirer.com",
      "pubDate": "Fri, 06 Jun 2025 09:00:01 GMT"
    },
    {
      "title": "The Deficit Crisis Is Really A Recession Problem - Real Investment Advice",
      "pubDate": "Fri, 06 Jun 2025 10:00:49 GMT"
    },
    {
      "title": "One in five finance leaders say the US is already in a recession - CFO.com",
      "pubDate": "Fri, 06 Jun 2025 15:29:22 GMT"
    },
    {
      "title": "What Recession Fears? Stocks Are Up Again - WSJ",
      "pubDate": "Fri, 06 Jun 2025 21:34:00 GMT"
    },
    {
      "title": "The Big Four Recession Indicators: May Employment - Advisor Perspectives",
      "pubDate": "Fri, 06 Jun 2025 21:35:38 GMT"
    },
    {
      "title": "US Recession Odds Drop to 26%, Will Bitcoin Price Recover? - The Crypto Times",
      "pubDate": "Fri, 06 Jun 2025 18:51:41 GMT"
    },
    {
      "title": "Federal firings create massive recession in Washington, D.C. - World Socialist Web Site",
      "pubDate": "Fri, 06 Jun 2025 23:53:47 GMT"
    }
  ],
  "russia": [
    {
      "title": "North Korea sending weapons to Russia to ‘terrorize’ Ukrainian civilians, says U.N. report - Washington Times",
      "pubDate": "Fri, 30 May 2025 12:27:24 GMT"
    },
    {
      "title": "Senate to 'start moving' Russia sanctions bill next week, Graham says - The Kyiv Independent",
      "pubDate": "Fri, 30 May 2025 19:07:30 GMT"
    },
    {
      "title": "Opinion | Putin has a chance to escape his Ukraine disaster. He’s blowing it. - The Washington Post",
      "pubDate": "Fri, 30 May 2025 21:37:20 GMT"
    },
    {
      "title": "Kremlin fabricated story on Putin’s near-miss with Ukrainian drones, Moscow Times reports. - The Kyiv Independent",
      "pubDate": "Fri, 30 May 2025 23:35:28 GMT"
    },
    {
      "title": "North Korea Gets a Weapons Bonanza From Russia - The New York Times",
      "pubDate": "Sat, 31 May 2025 09:02:02 GMT"
    },
    {
      "title": "Russia’s drone ‘safaris’ haunt Ukrainians in front-line city - The Hill",
      "pubDate": "Sat, 31 May 2025 10:00:00 GMT"
    },
    {
      "title": "Russia's Economy Facing Triple Threat - Newsweek",
      "pubDate": "Sat, 31 May 2025 14:05:02 GMT"
    },
    {
      "title": "Is the Ukraine war crushing Russia’s economy? Quite the opposite - The Times",
      "pubDate": "Sat, 31 May 2025 17:00:28 GMT"
    },
    {
      "title": "A bridge collapse causes a train to derail in Russia, killing at least 3 people, officials say - ABC News",
      "pubDate": "Sat, 31 May 2025 23:46:13 GMT"
    },
    {
      "title": "Bridge collapses onto passenger train in western Russia, killing at least 7 - CNN",
      "pubDate": "Sun, 01 Jun 2025 05:15:57 GMT"
    },
    {
      "title": "Russia Says Seven Die as Bridge Collapses Onto Passenger Train - Bloomberg",
      "pubDate": "Sun, 01 Jun 2025 06:45:00 GMT"
    },
    {
      "title": "Bridges collapse in 2 Russian regions bordering Ukraine, 7 dead - Reuters",
      "pubDate": "Sun, 01 Jun 2025 05:46:00 GMT"
    },
    {
      "title": "Deaths after two Russian bridges collapse due to 'explosions' - Sky News",
      "pubDate": "Sun, 01 Jun 2025 07:52:30 GMT"
    },
    {
      "title": "Bridge blasts in Russia kill seven ahead of Ukraine peace talks - Reuters",
      "pubDate": "Sun, 01 Jun 2025 10:17:09 GMT"
    },
    {
      "title": "Russia says collapse of two bridges near Ukraine due to 'terrorism' - Yahoo",
      "pubDate": "Sun, 01 Jun 2025 12:57:21 GMT"
    },
    {
      "title": "Rubio doubles down on Trump's call for peace after Ukraine wipes out Russia's doomsday nuclear bombers - New York Post",
      "pubDate": "Mon, 02 Jun 2025 00:03:00 GMT"
    },
    {
      "title": "Playbook: Russia’s Pearl Harbor - Politico",
      "pubDate": "Mon, 02 Jun 2025 10:00:48 GMT"
    },
    {
      "title": "Putin 'is preparing for more war,’ GOP senator warns after meeting with Zelenskyy and Macron - PBS",
      "pubDate": "Mon, 02 Jun 2025 17:37:48 GMT"
    },
    {
      "title": "Putin’s sickening statistic: 1m Russian casualties in Ukraine - The Economist",
      "pubDate": "Mon, 02 Jun 2025 18:51:16 GMT"
    },
    {
      "title": "Russia sets out punitive terms at peace talks with Ukraine - Reuters",
      "pubDate": "Mon, 02 Jun 2025 22:07:21 GMT"
    },
    {
      "title": "Russia using drones to hunt Ukrainian civilians: HRW - Al Jazeera",
      "pubDate": "Tue, 03 Jun 2025 09:23:59 GMT"
    },
    {
      "title": "Russia economy in meltdown as country on brink of recession amid slump in growth - MSN",
      "pubDate": "Tue, 03 Jun 2025 16:06:40 GMT"
    },
    {
      "title": "Russia upgrades Shahed drones with new tech, EW protection – Ukrainian Air Force - Ukrinform",
      "pubDate": "Tue, 03 Jun 2025 21:42:00 GMT"
    },
    {
      "title": "Russia’s Crimean Bridge rocked by explosions, Ukraine’s SBU claims responsibility. - The Kyiv Independent",
      "pubDate": "Wed, 04 Jun 2025 01:11:19 GMT"
    },
    {
      "title": "Russian Offensive Campaign Assessment, June 3, 2025 - Institute for the Study of War",
      "pubDate": "Tue, 03 Jun 2025 22:37:38 GMT"
    },
    {
      "title": "Russia : Spymasters from around the world gather for major Russian security forum - Intelligence Online",
      "pubDate": "Wed, 04 Jun 2025 04:03:46 GMT"
    },
    {
      "title": "Russia says no damage to Crimea Bridge as Ukraine pushes for US sanctions on Moscow - ABC News",
      "pubDate": "Wed, 04 Jun 2025 11:15:00 GMT"
    },
    {
      "title": "Putin openly questions peace talks after blaming Ukraine for deadly bridge attack in Russia - Reuters",
      "pubDate": "Wed, 04 Jun 2025 14:40:22 GMT"
    },
    {
      "title": "Russia producing around 170 Shahed drones daily, plans to ramp up output – DIU - Цензор.НЕТ",
      "pubDate": "Wed, 04 Jun 2025 16:53:00 GMT"
    },
    {
      "title": "Putin will seek revenge for Ukraine drone attack, warns Trump after phone call - BBC",
      "pubDate": "Wed, 04 Jun 2025 20:39:26 GMT"
    },
    {
      "title": "Kremlin and Trump aides raise nuclear war fears after Ukraine drone strike - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 21:43:00 GMT"
    },
    {
      "title": "Putin Intends to Respond to Ukraine Strikes on Russian Bombers, Trump Says - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 21:31:04 GMT"
    },
    {
      "title": "Russia says it will repair warplanes damaged in Ukrainian drone attacks - Reuters",
      "pubDate": "Thu, 05 Jun 2025 08:52:23 GMT"
    },
    {
      "title": "Kim Jong Un promises full support for Russia’s Ukraine war, says North Korea - Euromaidan Press",
      "pubDate": "Thu, 05 Jun 2025 11:35:08 GMT"
    },
    {
      "title": "Russia warns it will respond to Ukraine drone attacks ‘how and when’ it sees fit - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 13:44:00 GMT"
    },
    {
      "title": "Trump says Putin vowed retaliation for Kyiv strike - The Week",
      "pubDate": "Thu, 05 Jun 2025 16:52:26 GMT"
    },
    {
      "title": "Russia’s opposition talking with Ukraine behind the scenes, top dissident says - politico.eu",
      "pubDate": "Fri, 06 Jun 2025 06:37:33 GMT"
    },
    {
      "title": "After Trump-Putin call, Russia rains missiles & drones on Kyiv, kills 4 - Firstpost",
      "pubDate": "Fri, 06 Jun 2025 06:50:42 GMT"
    },
    {
      "title": "Russia accuses UK of involvement in Ukraine strike amid Putin-Trump talks - Sky News",
      "pubDate": "Fri, 06 Jun 2025 18:05:57 GMT"
    }
  ],
  "israel": [
    {
      "title": "Israel aid blockage making Gaza 'hungriest region on earth', UN office says - Reuters",
      "pubDate": "Fri, 30 May 2025 10:12:43 GMT"
    },
    {
      "title": "Israel’s plan to ‘conquer’ Gaza is leaving Palestinians with little place to go: 5 maps show how - CNN",
      "pubDate": "Sat, 31 May 2025 04:30:00 GMT"
    },
    {
      "title": "Israel becomes the first country to down drones in combat with a laser weapon - Business Insider",
      "pubDate": "Sat, 31 May 2025 10:48:00 GMT"
    },
    {
      "title": "Gaza live updates: 31 dead after Israeli tanks open fire near aid centre, Hamas health ministry says - BBC",
      "pubDate": "Sun, 01 Jun 2025 06:55:24 GMT"
    },
    {
      "title": "Aid ship aiming to break Israel’s siege of Gaza sets sail from Italy - Al Jazeera",
      "pubDate": "Sun, 01 Jun 2025 18:56:15 GMT"
    },
    {
      "title": "At Least 27 Killed After Israeli Soldiers Open Fire Near Gaza Aid Site - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 11:31:38 GMT"
    },
    {
      "title": "Israel kills 27 Palestinians in latest mass killing of aid seekers - Middle East Eye",
      "pubDate": "Tue, 03 Jun 2025 10:22:18 GMT"
    },
    {
      "title": "Three Israeli Soldiers Killed in Northern Gaza Explosion, IDF Announces - Haaretz",
      "pubDate": "Tue, 03 Jun 2025 06:06:00 GMT"
    },
    {
      "title": "Ex-Biden official says ‘without doubt’ Israel committed war crimes in Gaza - Al Jazeera",
      "pubDate": "Tue, 03 Jun 2025 14:36:03 GMT"
    },
    {
      "title": "LIVE: Israel kills at least 43 in Gaza today, majority in south Strip - Al Jazeera",
      "pubDate": "Thu, 05 Jun 2025 14:15:00 GMT"
    },
    {
      "title": "Israeli military says four soldiers killed in Gaza, will draft 10,000 more troops - France 24",
      "pubDate": "Fri, 06 Jun 2025 18:59:13 GMT"
    }
  ],
  "inflation": [
    {
      "title": "US stocks end near flat but end month with big gains. Trump reescalates China tariff war - USA Today",
      "pubDate": "Fri, 30 May 2025 21:44:36 GMT"
    }
  ],
  "artificial_intelligence": [
    {
      "title": "Responsibly unleashing artificial intelligence in pandemic preparedness - CEPI",
      "pubDate": "Fri, 30 May 2025 07:43:16 GMT"
    },
    {
      "title": "For Some Recent Graduates, the A.I. Job Apocalypse May Already Be Here - The New York Times",
      "pubDate": "Fri, 30 May 2025 09:02:29 GMT"
    },
    {
      "title": "The Nasdaq Bounces Back: These AI Stocks Could Be the Smartest Buys of the Year - Yahoo Finance",
      "pubDate": "Fri, 30 May 2025 11:00:00 GMT"
    },
    {
      "title": "OpenAI Can Stop Pretending - The Atlantic",
      "pubDate": "Fri, 30 May 2025 11:30:00 GMT"
    },
    {
      "title": "AI-enabled 'vibe coding' lets anyone write software - NPR",
      "pubDate": "Fri, 30 May 2025 09:00:00 GMT"
    },
    {
      "title": "AI expert Connor Leahy on superintelligence and the threat of human extinction - Australian Strategic Policy Institute",
      "pubDate": "Fri, 30 May 2025 07:13:47 GMT"
    },
    {
      "title": "Judge Hears Final Arguments on How to Fix Google’s Search Monopoly - The New York Times",
      "pubDate": "Fri, 30 May 2025 14:32:56 GMT"
    },
    {
      "title": "OpenAI's 'smartest' AI model was explicitly told to shut down — and it refused - Live Science",
      "pubDate": "Fri, 30 May 2025 16:45:13 GMT"
    },
    {
      "title": "Evaluating performance of large language models for atrial fibrillation management using different prompting strategies and languages - Nature",
      "pubDate": "Fri, 30 May 2025 17:32:47 GMT"
    },
    {
      "title": "AI: A new lab partner in biotech - Politico",
      "pubDate": "Fri, 30 May 2025 18:00:00 GMT"
    },
    {
      "title": "Artificial intelligence among new tech shaping forecasts during 2025 hurricane season - AOL.com",
      "pubDate": "Fri, 30 May 2025 19:17:08 GMT"
    },
    {
      "title": "Artificial Intelligence—Promises and Perils for Humans’ Rights - Harvard Law School | Human Rights Program",
      "pubDate": "Fri, 30 May 2025 14:56:17 GMT"
    },
    {
      "title": "Criminals using artificial intelligence to improve scams - CBS News",
      "pubDate": "Fri, 30 May 2025 21:50:00 GMT"
    },
    {
      "title": "The lab of the future: An artificial superintelligence for biology - Fast Company",
      "pubDate": "Fri, 30 May 2025 23:45:09 GMT"
    },
    {
      "title": "Texas FBI analyst arrested on child pornography charges had AI-generated images, court records - KHOU",
      "pubDate": "Sat, 31 May 2025 00:10:00 GMT"
    },
    {
      "title": "Neurosymbolic AI is the answer to large language models’ inability to stop hallucinating - The Conversation",
      "pubDate": "Fri, 30 May 2025 15:10:07 GMT"
    },
    {
      "title": "Analysis | The MAHA Report’s AI fingerprints, annotated - The Washington Post",
      "pubDate": "Sat, 31 May 2025 02:02:23 GMT"
    },
    {
      "title": "Artificial Intelligence Speeds Up Diagnoses of Some Cancers - UC San Diego Today",
      "pubDate": "Fri, 30 May 2025 22:11:26 GMT"
    },
    {
      "title": "It’s Time To Talk About Artificial Intelligence (AI) In The Automotive Media Space - The Autopian",
      "pubDate": "Fri, 30 May 2025 21:30:40 GMT"
    },
    {
      "title": "AI Rebellion in 2025: How ChatGPT-o3 Defied Human Commands for the First Time Ever – A Groundbreaking Experiment Shocks the AI Community - Business Matters",
      "pubDate": "Sat, 31 May 2025 05:03:42 GMT"
    },
    {
      "title": "AWS Continues to Add Data Centers to Meet Demand for AI - PYMNTS.com",
      "pubDate": "Fri, 30 May 2025 23:48:45 GMT"
    },
    {
      "title": "Billionaires Are Buying 2 Artificial Intelligence (AI) Stocks That Wall Street Analysts Say Can Soar Up to 240% - The Motley Fool",
      "pubDate": "Sat, 31 May 2025 07:15:00 GMT"
    },
    {
      "title": "Loughran Cappel measure aims to address cyberbullying using AI technology - Illinois Senate Democratic Caucus",
      "pubDate": "Sat, 31 May 2025 00:55:49 GMT"
    },
    {
      "title": "Better Artificial Intelligence (AI) Stock: Palantir vs. Snowflake - The Motley Fool",
      "pubDate": "Sat, 31 May 2025 09:25:00 GMT"
    },
    {
      "title": "Why artificial intelligence has secured its place in special forces' operations - Shephard Media",
      "pubDate": "Sat, 31 May 2025 09:13:09 GMT"
    },
    {
      "title": "‘One day I overheard my boss saying: just put it in ChatGPT’: the workers who lost their jobs to AI - The Guardian",
      "pubDate": "Sat, 31 May 2025 10:45:00 GMT"
    },
    {
      "title": "3 Reasons This Artificial Intelligence Stock Could Have the Biggest Comeback in 2025 - The Motley Fool",
      "pubDate": "Sat, 31 May 2025 12:15:00 GMT"
    },
    {
      "title": "Meta plans to replace humans with AI to assess privacy and societal risks - NPR",
      "pubDate": "Sat, 31 May 2025 09:00:00 GMT"
    },
    {
      "title": "AI meets game theory: How language models perform in human-like social scenarios - Phys.org",
      "pubDate": "Sat, 31 May 2025 14:10:01 GMT"
    },
    {
      "title": "Can we trust AI? | READER COMMENTARY - Baltimore Sun",
      "pubDate": "Sat, 31 May 2025 17:13:57 GMT"
    },
    {
      "title": "Back to Pens and Paper: How US Universities Are Ditching Tech to Beat ChatGPT With Old-School Exams - International Business Times UK",
      "pubDate": "Sat, 31 May 2025 18:10:07 GMT"
    },
    {
      "title": "Optimizing Computing Approaches For India’s National AI Capabilities – Analysis - Eurasia Review",
      "pubDate": "Sun, 01 Jun 2025 00:50:03 GMT"
    },
    {
      "title": "Silicon Valley VCs navigate uncertain AI future - The Economic Times",
      "pubDate": "Sun, 01 Jun 2025 02:17:38 GMT"
    },
    {
      "title": "Early adoption of AI will boost US growth - Financial Times",
      "pubDate": "Sun, 01 Jun 2025 04:00:58 GMT"
    },
    {
      "title": "Can the Gulf really become an AI superpower? - Financial Times",
      "pubDate": "Sun, 01 Jun 2025 04:01:29 GMT"
    },
    {
      "title": "Critical need for ethical oversight and regulation of artificial intelligence - The Vibes",
      "pubDate": "Sun, 01 Jun 2025 06:14:00 GMT"
    },
    {
      "title": "Prediction: This Artificial Intelligence (AI) Stock Could Be the Next Great Value Play - The Motley Fool",
      "pubDate": "Sun, 01 Jun 2025 07:25:00 GMT"
    },
    {
      "title": "Editorial: The world promised by AI isn't necessarily a better one - Pittsburgh Post-Gazette",
      "pubDate": "Sun, 01 Jun 2025 08:00:00 GMT"
    },
    {
      "title": "ChatGPT Is Making Us Weird - Business Insider",
      "pubDate": "Sun, 01 Jun 2025 09:22:00 GMT"
    },
    {
      "title": "Artificial Intelligence in Peripheral Artery Disease Education: A Battle Between ChatGPT and Google Gemini - Cureus",
      "pubDate": "Sun, 01 Jun 2025 10:19:36 GMT"
    },
    {
      "title": "Billionaire David Tepper Bought More Shares of This Artificial Intelligence (AI) Stock That Could Join Apple, Microsoft, and Nvidia in the $3 Trillion Club by 2030 - Yahoo",
      "pubDate": "Sun, 01 Jun 2025 13:30:00 GMT"
    },
    {
      "title": "How far will AI go to defend its own survival? - NBC News",
      "pubDate": "Sun, 01 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Major battery innovation pushes electric vehicle range to over 3,000 miles - The Brighter Side of News",
      "pubDate": "Sun, 01 Jun 2025 11:51:00 GMT"
    },
    {
      "title": "Artificial Intelligence as a Pathway to Normalization Between Israel and Saudi Arabia: Post-Gaza War Prospects - Middle East Forum",
      "pubDate": "Sun, 01 Jun 2025 09:02:40 GMT"
    },
    {
      "title": "Artificial intelligence could spark massive job loss in U.S.: Expert - Yahoo News Canada",
      "pubDate": "Sun, 01 Jun 2025 18:26:11 GMT"
    },
    {
      "title": "AI-Powered Real Estate Tools - Trend Hunter",
      "pubDate": "Sun, 01 Jun 2025 17:56:49 GMT"
    },
    {
      "title": "Artificial intelligence poses a bigger threat to jobs held by women - Gazeta Express",
      "pubDate": "Sun, 01 Jun 2025 15:49:00 GMT"
    },
    {
      "title": "Analysis | Musk and DOGE are a metaphor for early months of Trump’s administration - The Washington Post",
      "pubDate": "Sun, 01 Jun 2025 17:00:00 GMT"
    },
    {
      "title": "How the National Hurricane Center uses artificial intelligence to create more accurate forecasts - CBS News",
      "pubDate": "Mon, 02 Jun 2025 00:58:00 GMT"
    },
    {
      "title": "2 No-Brainer Artificial Intelligence (AI) Stocks to Buy Hand Over Fist During the TACO Trade - Yahoo Finance",
      "pubDate": "Sun, 01 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "As AI Evolves, Pressure Mounts To Regulate ‘Killer Robots’ - Eurasia Review",
      "pubDate": "Sun, 01 Jun 2025 22:50:56 GMT"
    },
    {
      "title": "CE 100 Index Gains 1.7% as Investors Send AI-Related Names Higher - PYMNTS.com",
      "pubDate": "Mon, 02 Jun 2025 02:16:17 GMT"
    },
    {
      "title": "The AI copyright standoff continues - with no solution in sight - BBC",
      "pubDate": "Mon, 02 Jun 2025 06:22:46 GMT"
    },
    {
      "title": "Billionaire Bill Ackman Wants to Be the Next Warren Buffett, and He Is Buying an AI Stock Up 855% in 10 Years (Hint: Not Nvidia) - Yahoo",
      "pubDate": "Mon, 02 Jun 2025 07:10:00 GMT"
    },
    {
      "title": "AI Cracks Mars Mystery: 500,000 Streaks Solved Without a Drop of Water - SciTechDaily",
      "pubDate": "Mon, 02 Jun 2025 08:23:20 GMT"
    },
    {
      "title": "German financial watchdog: AI is helping to catch market abuse - Reuters",
      "pubDate": "Mon, 02 Jun 2025 09:02:07 GMT"
    },
    {
      "title": "Meta aims to fully automate advertising with AI by 2026, WSJ reports - Reuters",
      "pubDate": "Mon, 02 Jun 2025 11:36:40 GMT"
    },
    {
      "title": "Goodbye to 8,000 jobs - IBM replaces workers with artificial intelligence, sparking a wave of global reactions - Unión Rayo",
      "pubDate": "Mon, 02 Jun 2025 12:00:52 GMT"
    },
    {
      "title": "Machine learning and generative AI: What are they good for in 2025? - MIT Sloan",
      "pubDate": "Mon, 02 Jun 2025 13:38:54 GMT"
    },
    {
      "title": "AI Stocks Face 'Show Me' Moment. Apple To Host Flagship WWDC Conference. - Investor's Business Daily",
      "pubDate": "Mon, 02 Jun 2025 13:25:00 GMT"
    },
    {
      "title": "Replika AI chatbot is sexually harassing users, including minors, new study claims - Live Science",
      "pubDate": "Mon, 02 Jun 2025 15:03:46 GMT"
    },
    {
      "title": "Cisco Stock Is a Buy Because It Is Hidden Sovereign AI Play, Says Analyst - Barron's",
      "pubDate": "Mon, 02 Jun 2025 16:15:00 GMT"
    },
    {
      "title": "AI could 'devastate' Earth's population down to the size of the UK by 2300, expert warns: 'People really don't have a clue' - New York Post",
      "pubDate": "Mon, 02 Jun 2025 17:10:00 GMT"
    },
    {
      "title": "What Is AI SEO? How Artificial Intelligence Is Changing Search Optimization - Search Engine Land",
      "pubDate": "Mon, 02 Jun 2025 18:28:27 GMT"
    },
    {
      "title": "Experts advise businesses to adapt as use of AI grows, including to white-collar jobs - 13wham.com",
      "pubDate": "Mon, 02 Jun 2025 20:51:06 GMT"
    },
    {
      "title": "Artificial Intelligence in Pharmacovigilance: Eight Action Items for Life Sciences Companies - Sidley Austin LLP",
      "pubDate": "Mon, 02 Jun 2025 20:49:16 GMT"
    },
    {
      "title": "Diabetes management: IBM and Roche use AI to forecast blood sugar levels - AI News",
      "pubDate": "Mon, 02 Jun 2025 16:17:38 GMT"
    },
    {
      "title": "Artificial Intelligence Is Making Everything Weird - Reason Magazine",
      "pubDate": "Mon, 02 Jun 2025 21:15:41 GMT"
    },
    {
      "title": "Better Artificial Intelligence Stock: Nvidia vs. AMD - Yahoo Finance",
      "pubDate": "Mon, 02 Jun 2025 22:15:00 GMT"
    },
    {
      "title": "COMMENTARY: Artificial intelligence isn’t ruining education; it’s exposing what’s already broken - EdSource",
      "pubDate": "Tue, 03 Jun 2025 05:29:58 GMT"
    },
    {
      "title": "AI could wipe out half of office jobs, push US unemployment to 20%, warns Claude chatbot creator - VnExpress International",
      "pubDate": "Tue, 03 Jun 2025 08:30:12 GMT"
    },
    {
      "title": "AI Pioneer Launches Research Group to Help Build Safer Agents - Bloomberg.com",
      "pubDate": "Tue, 03 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Researchers explain AI's recent creepy behaviors when faced with being shut down — and what it means for us - Business Insider",
      "pubDate": "Tue, 03 Jun 2025 09:49:00 GMT"
    },
    {
      "title": "‘Godfather’ of AI Yoshua Bengio says latest models lie to users - Financial Times",
      "pubDate": "Tue, 03 Jun 2025 04:00:32 GMT"
    },
    {
      "title": "AI Links Early Life Risks to Behavioral Challenges at Age Five - Neuroscience News",
      "pubDate": "Tue, 03 Jun 2025 14:59:45 GMT"
    },
    {
      "title": "Meta's nuclear deal signals AI's growing energy needs - Star Tribune",
      "pubDate": "Tue, 03 Jun 2025 17:07:59 GMT"
    },
    {
      "title": "AI Pioneer Yoshua Bengio Launches Nonprofit to Develop Safe AI - PYMNTS.com",
      "pubDate": "Tue, 03 Jun 2025 18:26:25 GMT"
    },
    {
      "title": "AI is actively reshaping our mental landscape. - Psychology Today",
      "pubDate": "Tue, 03 Jun 2025 20:18:07 GMT"
    },
    {
      "title": "AI startups revolutionize coding industry, leading to sky-high valuations - Reuters",
      "pubDate": "Tue, 03 Jun 2025 19:25:54 GMT"
    },
    {
      "title": "\"Godfather of AI\" warns that today's AI systems are becoming strategically dishonest - TechSpot",
      "pubDate": "Tue, 03 Jun 2025 22:31:00 GMT"
    },
    {
      "title": "Big Tech’s AI Endgame Is Coming Into Focus - The Atlantic",
      "pubDate": "Tue, 03 Jun 2025 22:05:00 GMT"
    },
    {
      "title": "California Senate passes bill that aims to make AI chatbots safer - Los Angeles Times",
      "pubDate": "Tue, 03 Jun 2025 23:48:07 GMT"
    },
    {
      "title": "AI foot scanner recognises warning signs of heart failure to keep people out of hospital, researchers say - Sky News",
      "pubDate": "Wed, 04 Jun 2025 01:50:28 GMT"
    },
    {
      "title": "Meta Turns to Nuclear Power to Run AI | Bloomberg Technology 6/3/2025 - Bloomberg.com",
      "pubDate": "Tue, 03 Jun 2025 20:34:27 GMT"
    },
    {
      "title": "AI enables shift from enablement to strategic leadership - AI News",
      "pubDate": "Tue, 03 Jun 2025 22:19:41 GMT"
    },
    {
      "title": "US labor unions fight to contain AI disruption - Yahoo News UK",
      "pubDate": "Wed, 04 Jun 2025 06:32:00 GMT"
    },
    {
      "title": "A Fatal Tesla Crash Shows the Limits of Full Self-Driving - Bloomberg",
      "pubDate": "Wed, 04 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Google DeepMind chief urges smarter AI regulation - Digital Watch Observatory",
      "pubDate": "Wed, 04 Jun 2025 05:30:00 GMT"
    },
    {
      "title": "Marjorie Taylor Greene under fire after admitting she missed AI provision in GOP tax bill - USA Today",
      "pubDate": "Wed, 04 Jun 2025 14:32:17 GMT"
    },
    {
      "title": "FTC Challenges Deceptive Artificial Intelligence Claims - Inside Global Tech",
      "pubDate": "Wed, 04 Jun 2025 21:29:11 GMT"
    },
    {
      "title": "Reddit sues AI startup Anthropic for breach of contract, 'unfair competition' - CNBC",
      "pubDate": "Wed, 04 Jun 2025 17:37:08 GMT"
    },
    {
      "title": "Ukraine says the drones that hit Russian aircraft used AI to find and strike their targets when they lost signal - Yahoo",
      "pubDate": "Wed, 04 Jun 2025 16:59:47 GMT"
    },
    {
      "title": "New Doudna supercomputer at Berkeley lab to power AI research - CBS News",
      "pubDate": "Thu, 05 Jun 2025 00:46:00 GMT"
    },
    {
      "title": "New US AI center reflects change in branding, not role - MLex",
      "pubDate": "Wed, 04 Jun 2025 22:58:00 GMT"
    },
    {
      "title": "AI breakthroughs are bringing hope to cancer research and treatment - Google Blog",
      "pubDate": "Wed, 04 Jun 2025 18:11:01 GMT"
    },
    {
      "title": "Watch Meta CTO on What's Ahead in Artificial Intelligence / DAY 1 - Bloomberg",
      "pubDate": "Thu, 05 Jun 2025 02:55:00 GMT"
    },
    {
      "title": "Amazon plans $10 billion artificial intelligence investment, will bring 500 jobs in North Carolina - WXII",
      "pubDate": "Wed, 04 Jun 2025 20:48:00 GMT"
    },
    {
      "title": "Artificial intelligence (AI) - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 06:06:19 GMT"
    },
    {
      "title": "OpenAI takes down covert operations tied to China and other countries - NPR",
      "pubDate": "Thu, 05 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "The Role of Artificial Intelligence and Machine Learning Applications in Emergency Surgery: A Systematic Review of Diagnostic Accuracy and Clinical Outcomes - Cureus",
      "pubDate": "Thu, 05 Jun 2025 07:55:10 GMT"
    },
    {
      "title": "AI literacy is a strategic opportunity and an essential skill – a new course to support competence - Microsoft",
      "pubDate": "Thu, 05 Jun 2025 07:36:37 GMT"
    },
    {
      "title": "Vista CEO Says AI to Force 60% of SuperReturn Crowd to Seek Work - Bloomberg",
      "pubDate": "Thu, 05 Jun 2025 12:01:51 GMT"
    },
    {
      "title": "AI is already wiping out jobs, intensifying a hiring slowdown - USA Today",
      "pubDate": "Thu, 05 Jun 2025 13:03:49 GMT"
    },
    {
      "title": "Artificial intelligence supports most precise optical measurements - Optics.org",
      "pubDate": "Thu, 05 Jun 2025 15:23:54 GMT"
    },
    {
      "title": "Tech job openings vanish as AI, tariffs change hiring landscape - USA Today",
      "pubDate": "Thu, 05 Jun 2025 13:03:49 GMT"
    },
    {
      "title": "AI Models Will Sabotage And Blackmail Humans To Survive In New Tests. Should We Be Worried? - HuffPost",
      "pubDate": "Thu, 05 Jun 2025 16:38:20 GMT"
    },
    {
      "title": "Ukraine Just Demonstrated What AGI War Could Look Like - Time Magazine",
      "pubDate": "Thu, 05 Jun 2025 19:21:52 GMT"
    },
    {
      "title": "Groups raise alarms about proposed artificial intelligence regulations - The Center Square",
      "pubDate": "Thu, 05 Jun 2025 18:52:00 GMT"
    },
    {
      "title": "Thune on AI moratorium: ‘We’ll see’ if it survives Byrd rule - Politico",
      "pubDate": "Thu, 05 Jun 2025 15:44:29 GMT"
    },
    {
      "title": "Move Over Nvidia, Taiwan Semiconductor, and Micron. Brad Gerstner's Altimeter Capital Just Gave Investors 2,999,536 Reasons to Check Out the Hottest Artificial Intelligence (AI) IPO Stock of 2025 - Yahoo Finance",
      "pubDate": "Fri, 06 Jun 2025 00:11:00 GMT"
    },
    {
      "title": "Top AI talent leaves Google and OpenAI for Anthropic's culture of safety - Chosunbiz",
      "pubDate": "Thu, 05 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "Artificial Intelligence is now an A+ law student, study finds - Reuters",
      "pubDate": "Thu, 05 Jun 2025 17:49:18 GMT"
    },
    {
      "title": "Tech giants see emissions surge 150 percent in 3 years amid AI boom: UN - Al Jazeera",
      "pubDate": "Fri, 06 Jun 2025 04:41:15 GMT"
    },
    {
      "title": "New research busts 6 AI myths: Artificial intelligence makes workers 'more valuable, not less' - CNBC",
      "pubDate": "Fri, 06 Jun 2025 05:36:38 GMT"
    },
    {
      "title": "Using artificial intelligence to improve health - Harvard T.H. Chan School of Public Health",
      "pubDate": "Thu, 05 Jun 2025 21:06:12 GMT"
    },
    {
      "title": "OpenAI finds more Chinese groups using ChatGPT for malicious purposes - Reuters",
      "pubDate": "Fri, 06 Jun 2025 09:39:37 GMT"
    },
    {
      "title": "Prediction: 1 Artificial Intelligence (AI) Stock to Buy Before It Soars 100% in the Next Year (Hint: Not Palantir) - Nasdaq",
      "pubDate": "Fri, 06 Jun 2025 07:12:00 GMT"
    },
    {
      "title": "Lawyers face sanctions for citing fake cases with AI, warns UK judge - Reuters",
      "pubDate": "Fri, 06 Jun 2025 12:24:30 GMT"
    },
    {
      "title": "EU could postpone flagship AI rules, tech chief says - politico.eu",
      "pubDate": "Fri, 06 Jun 2025 13:35:43 GMT"
    },
    {
      "title": "‘Godfather of AI’ now fears it’s unsafe and has a plan to fix it - Asia Times",
      "pubDate": "Fri, 06 Jun 2025 05:01:15 GMT"
    },
    {
      "title": "AI risks 'broken' career ladder for college graduates, some experts say - ABC News",
      "pubDate": "Fri, 06 Jun 2025 10:18:45 GMT"
    },
    {
      "title": "US-UAE multi-billion dollar AI data campus deal far from finalised, sources say - Reuters",
      "pubDate": "Fri, 06 Jun 2025 14:49:37 GMT"
    },
    {
      "title": "UK Court Warns Lawyers Can Be Prosecuted Over A.I. Tools That ‘Hallucinate’ Fake Material - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 18:46:59 GMT"
    },
    {
      "title": "Trump scraps Biden software security, AI, post-quantum encryption efforts in new executive order - Cybersecurity Dive",
      "pubDate": "Fri, 06 Jun 2025 22:52:30 GMT"
    },
    {
      "title": "Experts offer advice to new college grads on entering the workforce in the age of AI - CBS News",
      "pubDate": "Fri, 06 Jun 2025 20:42:22 GMT"
    },
    {
      "title": "AI 'hallucinates' constantly, but there's a solution - Live Science",
      "pubDate": "Fri, 06 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "What Is Agentic AI? Everything to Know About Artificial Intelligence Agents - CNET",
      "pubDate": "Fri, 06 Jun 2025 21:01:00 GMT"
    }
  ],
  "financial_markets": [
    {
      "title": "European stock markets set for a positive open amid U.S. tariff uncertainty - CNBC",
      "pubDate": "Fri, 30 May 2025 07:31:00 GMT"
    },
    {
      "title": "Morning Bid: Tariffs return along with capital tax fears - Reuters",
      "pubDate": "Fri, 30 May 2025 10:50:36 GMT"
    },
    {
      "title": "Stocks ride May gains to best month since 2023 as investors look past trade concerns - NBC News",
      "pubDate": "Fri, 30 May 2025 20:18:35 GMT"
    },
    {
      "title": "JPMorgan’s Jamie Dimon Predicts ‘Crack in the Bond Market,’ Citing U.S. Fiscal Mess - WSJ",
      "pubDate": "Sat, 31 May 2025 01:03:00 GMT"
    },
    {
      "title": "Wall Street warns Trump aides the GOP tax bill could jolt bond markets - Star Tribune",
      "pubDate": "Sat, 31 May 2025 20:43:49 GMT"
    },
    {
      "title": "Trump administration is said to move to ease capital rules for big banks - MSN",
      "pubDate": "Sat, 31 May 2025 21:03:04 GMT"
    },
    {
      "title": "How Stocks, Exchanges, and IPOs Drive the Stock Market - MSN",
      "pubDate": "Sun, 01 Jun 2025 16:33:15 GMT"
    },
    {
      "title": "Nvidia’s 45% Surge in Just Two Months Shows AI Frenzy Is Back - Bloomberg.com",
      "pubDate": "Tue, 03 Jun 2025 10:46:09 GMT"
    },
    {
      "title": "Bitcoin profit-taking underway as ‘big whales’ continue sell-off - Cointelegraph",
      "pubDate": "Wed, 04 Jun 2025 03:59:43 GMT"
    },
    {
      "title": "Circle Internet Group's IPO prices above its upped range for its trading debut on Thursday - MarketWatch",
      "pubDate": "Thu, 05 Jun 2025 11:26:44 GMT"
    },
    {
      "title": "Stocks fall as traders brace for China trade update, jobs report: Live updates - CNBC",
      "pubDate": "Thu, 05 Jun 2025 14:36:00 GMT"
    },
    {
      "title": "Stock market today: Dow, S&P 500, Nasdaq wobble as Trump's Xi talk, Musk feud take focus - Yahoo Finance",
      "pubDate": "Thu, 05 Jun 2025 18:16:04 GMT"
    },
    {
      "title": "US Markets Are No Longer Safe for Investments, Carmignac Says - Bloomberg",
      "pubDate": "Fri, 06 Jun 2025 08:24:04 GMT"
    },
    {
      "title": "Federal Reserve Suffers $1,060,000,000,000 in Unrealized Losses As Central Bank’s Rate Hikes Pressure Bonds - The Daily Hodl",
      "pubDate": "Sat, 07 Jun 2025 00:05:02 GMT"
    }
  ],
  "us_foreign_policy": [
    {
      "title": "US-China trade talks threatened by new visa restrictions for students - Scripps News",
      "pubDate": "Fri, 30 May 2025 13:30:23 GMT"
    },
    {
      "title": "Senators Visit Ukraine, Pushing for Crippling Sanctions on Russia - The New York Times",
      "pubDate": "Fri, 30 May 2025 19:29:00 GMT"
    },
    {
      "title": "US defense secretary skips Ukraine military aid meeting attended by more than 50 other allies – Europe live - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 09:17:00 GMT"
    },
    {
      "title": "Five Signs Israel and Iran Could Be Headed Toward Open War - Newsweek",
      "pubDate": "Fri, 06 Jun 2025 16:30:31 GMT"
    },
    {
      "title": "US imposes new sanctions related to Iran - www.israelhayom.com",
      "pubDate": "Fri, 06 Jun 2025 21:15:57 GMT"
    }
  ],
  "trade_war": [
    {
      "title": "Trump accuses China of violating preliminary trade deal - CNBC",
      "pubDate": "Fri, 30 May 2025 12:17:01 GMT"
    },
    {
      "title": "Opinion | The EU Doesn’t Need Trump for a Trade War - WSJ",
      "pubDate": "Fri, 30 May 2025 23:51:31 GMT"
    },
    {
      "title": "China’s Factory Activity Contraction Eases After Trade War Truce - Bloomberg",
      "pubDate": "Sat, 31 May 2025 01:54:00 GMT"
    },
    {
      "title": "Trump escalates trade war with 50% steel, aluminum tariffs - PressTV",
      "pubDate": "Sat, 31 May 2025 08:29:00 GMT"
    },
    {
      "title": "Analysts Say Trump Trade Wars Would Harm the Entire US Energy Sector, From Oil to Solar - WIRED",
      "pubDate": "Sat, 31 May 2025 11:00:00 GMT"
    },
    {
      "title": "Trump claimed ‘tariffs are easy’ – he’s learning the hard way that’s not the case - The Guardian",
      "pubDate": "Sat, 31 May 2025 18:03:00 GMT"
    },
    {
      "title": "The ‘revenge tax’ buried deep in the budget bill could turn a trade war into a ‘capital war,’ analyst says - MSN",
      "pubDate": "Sat, 31 May 2025 22:36:40 GMT"
    },
    {
      "title": "Europe stocks stage world-beating rally as trade war backfires - Yahoo Finance",
      "pubDate": "Sun, 01 Jun 2025 11:54:24 GMT"
    },
    {
      "title": "Trump's tariffs 'not going away', top adviser says - BBC",
      "pubDate": "Sun, 01 Jun 2025 17:27:03 GMT"
    },
    {
      "title": "Trade War Hits Asia Factories as Exports, Production Slide - Bloomberg.com",
      "pubDate": "Mon, 02 Jun 2025 02:08:00 GMT"
    },
    {
      "title": "China hits back at Trump, saying U.S. actions 'severely undermine' trade truce - NBC News",
      "pubDate": "Mon, 02 Jun 2025 06:34:00 GMT"
    },
    {
      "title": "China accuses US of ‘seriously violating’ trade war truce – business live - The Guardian",
      "pubDate": "Mon, 02 Jun 2025 06:46:04 GMT"
    },
    {
      "title": "China says U.S. violated tariff truce as trade war heats up - CBS News",
      "pubDate": "Mon, 02 Jun 2025 12:50:57 GMT"
    },
    {
      "title": "Trump tariffs cause trade war, raise recession concerns - thepostathens.com",
      "pubDate": "Mon, 02 Jun 2025 21:03:00 GMT"
    },
    {
      "title": "Trump and Xi to talk China trade war after US president rages over rare-earths restriction - New York Post",
      "pubDate": "Mon, 02 Jun 2025 16:42:00 GMT"
    },
    {
      "title": "U.S.-China Trade War Morphs From Tariffs Into Fight Over Supply Chain - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 21:01:24 GMT"
    },
    {
      "title": "A New Era of Trade Warfare Has Begun for the U.S. and China - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 21:01:24 GMT"
    },
    {
      "title": "Trump's new salvo about to upend world trade; 50% tariff on steel & aluminum to kick in on June 4 - The Economic Times",
      "pubDate": "Wed, 04 Jun 2025 01:58:15 GMT"
    },
    {
      "title": "Apple and Alibaba’s AI rollout in China delayed by Donald Trump’s trade war - Financial Times",
      "pubDate": "Wed, 04 Jun 2025 15:44:09 GMT"
    },
    {
      "title": "China's trade war gambit puts Trump on defense - Axios",
      "pubDate": "Thu, 05 Jun 2025 09:06:15 GMT"
    },
    {
      "title": "Trump’s tariffs have become his Vietnam – and the right is breaking ranks - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 12:55:00 GMT"
    },
    {
      "title": "The ‘Fundamental Mistake’ in Trump’s Trade War With China - Politico",
      "pubDate": "Thu, 05 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "US, China to resume trade talks after Trump call with Xi Jinping - KEYE",
      "pubDate": "Thu, 05 Jun 2025 16:40:50 GMT"
    },
    {
      "title": "‘We Would Have Had Leverage’: How Trump Botched the Trade War With China - Politico",
      "pubDate": "Thu, 05 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Trump meets with Germany amidst ongoing trade war - fox10tv.com",
      "pubDate": "Thu, 05 Jun 2025 21:33:00 GMT"
    },
    {
      "title": "US jobs market slows down as businesses cope with Trump trade war uncertainty - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 12:34:00 GMT"
    },
    {
      "title": "US-China trade war: The beginning of the end? - BBC",
      "pubDate": "Fri, 06 Jun 2025 23:29:44 GMT"
    },
    {
      "title": "Trump tariffs live updates: US, China set for next round of talks after Trump-Xi call - Yahoo Finance",
      "pubDate": "Fri, 06 Jun 2025 21:31:26 GMT"
    },
    {
      "title": "US, China set for trade talks in London on Monday - Reuters",
      "pubDate": "Fri, 06 Jun 2025 20:21:34 GMT"
    },
    {
      "title": "Trump-Xi phone call maintains fragile trade war truce - World Socialist Web Site",
      "pubDate": "Sat, 07 Jun 2025 03:58:21 GMT"
    },
    {
      "title": "US and Chinese officials will resume trade talks in London on Monday, Trump says - CNN",
      "pubDate": "Fri, 06 Jun 2025 20:34:00 GMT"
    }
  ],
  "china": [
    {
      "title": "China Preps $70 Billion in New Capital to Supercharge Investment - Bloomberg.com",
      "pubDate": "Fri, 30 May 2025 10:53:13 GMT"
    },
    {
      "title": "US and China trade talks have stalled, Scott Bessent says - BBC",
      "pubDate": "Fri, 30 May 2025 10:13:11 GMT"
    },
    {
      "title": "Trump says China has 'totally violated' agreement with US on tariffs - Reuters",
      "pubDate": "Fri, 30 May 2025 12:39:08 GMT"
    },
    {
      "title": "China Warns US Over Trump's 'Golden Dome' - Newsweek",
      "pubDate": "Fri, 30 May 2025 07:27:48 GMT"
    },
    {
      "title": "Stocks slide after Trump accuses China of violating Geneva trade agreement - NBC News",
      "pubDate": "Fri, 30 May 2025 13:10:00 GMT"
    },
    {
      "title": "China hits back after Trump claims it is 'violating' tariff truce - BBC",
      "pubDate": "Fri, 30 May 2025 16:28:26 GMT"
    },
    {
      "title": "US Plans Wider China Tech Sanctions With Subsidiary Crackdown - Bloomberg",
      "pubDate": "Fri, 30 May 2025 16:28:46 GMT"
    },
    {
      "title": "China calls out Trump for 'abuse' of semiconductor export controls - CNBC",
      "pubDate": "Fri, 30 May 2025 17:04:08 GMT"
    },
    {
      "title": "U.S.-China Trade Truce Risks Falling Apart Over Rare-Earth Exports - WSJ",
      "pubDate": "Fri, 30 May 2025 19:09:00 GMT"
    },
    {
      "title": "China Is Violating Rare-Earth Export Pledges, Says Trade Rep. Greer - WSJ",
      "pubDate": "Fri, 30 May 2025 15:56:57 GMT"
    },
    {
      "title": "Trump order could end Chinese drone sales in the U.S. - The Washington Post",
      "pubDate": "Fri, 30 May 2025 21:07:14 GMT"
    },
    {
      "title": "Pentagon chief warns of imminent China threat, pushes Asian allies to hike defence spending - Reuters",
      "pubDate": "Sat, 31 May 2025 01:08:03 GMT"
    },
    {
      "title": "Pentagon chief says ready to 'fight and win' against China, urges Asian allies to boost defense spending - CNBC",
      "pubDate": "Sat, 31 May 2025 03:35:00 GMT"
    },
    {
      "title": "Experts Who Warn of Risks Posed by Chinese Students Are Skeptical of Trump Plan - The New York Times",
      "pubDate": "Sat, 31 May 2025 04:00:04 GMT"
    },
    {
      "title": "Trump says China ‘violated’ agreement on trade talks and he’ll stop being ‘nice’ - AP News",
      "pubDate": "Fri, 30 May 2025 21:10:00 GMT"
    },
    {
      "title": "China’s navy conducts combat patrols near disputed South China Sea shoal - Al Jazeera",
      "pubDate": "Sat, 31 May 2025 05:49:02 GMT"
    },
    {
      "title": "Pete Hegseth says Chinese military action against Taiwan ‘could be imminent’ - Financial Times",
      "pubDate": "Sat, 31 May 2025 01:20:00 GMT"
    },
    {
      "title": "US defense secretary warns Indo-Pacific allies of 'imminent' threat from China - The Washington Post",
      "pubDate": "Sat, 31 May 2025 10:18:52 GMT"
    },
    {
      "title": "China slams Macron over ‘unacceptable’ comments on Taiwan and Ukraine - politico.eu",
      "pubDate": "Sat, 31 May 2025 11:20:23 GMT"
    },
    {
      "title": "Trump accuses China of breaching trade agreement amid tariff turmoil - The Washington Post",
      "pubDate": "Sat, 31 May 2025 04:05:43 GMT"
    },
    {
      "title": "Hegseth Warns of ‘Devastating Consequences’ Should China Seek to ‘Conquer’ Taiwan - WSJ",
      "pubDate": "Sat, 31 May 2025 14:14:00 GMT"
    },
    {
      "title": "Pete Hegseth urges Asia to boost defence against China's 'imminent' threat to Taiwan - BBC",
      "pubDate": "Sat, 31 May 2025 13:34:41 GMT"
    },
    {
      "title": "The U.S. Plan to Hobble China Tech Isn’t Working - WSJ",
      "pubDate": "Sat, 31 May 2025 15:26:55 GMT"
    },
    {
      "title": "China bristles at Macron linking Ukraine defence to Taiwan threats - Reuters",
      "pubDate": "Sat, 31 May 2025 09:31:20 GMT"
    },
    {
      "title": "British man indicted over plot to smuggle US military technology to China - Sky News",
      "pubDate": "Sat, 31 May 2025 22:06:38 GMT"
    },
    {
      "title": "China’s quantum satellite can be hacked, Singapore-based scientist warns - South China Morning Post",
      "pubDate": "Sat, 31 May 2025 22:00:08 GMT"
    },
    {
      "title": "Hegseth warns ‘threat China poses is real’ - CNN",
      "pubDate": "Sat, 31 May 2025 16:17:00 GMT"
    },
    {
      "title": "Hegseth warns Chinese invasion of Taiwan ‘could be imminent’ - NBC News",
      "pubDate": "Sat, 31 May 2025 23:21:28 GMT"
    },
    {
      "title": "South Korea exports fall as tariffs hit US, China shipments - Reuters",
      "pubDate": "Sun, 01 Jun 2025 01:19:00 GMT"
    },
    {
      "title": "Russia \"Immediate\" Danger, China \"Sophisticated\" Challenge: Key UK Report - NDTV",
      "pubDate": "Sun, 01 Jun 2025 02:13:23 GMT"
    },
    {
      "title": "China Blasts Hegseth as Defense Minister Avoids Singapore Forum - Bloomberg.com",
      "pubDate": "Sun, 01 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "China accuses Pete Hegseth of sowing division in Asia in speech ‘filled with provocations’ - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 04:53:00 GMT"
    },
    {
      "title": "China accuses US's Hegseth of 'vilifying' remarks at security forum - Reuters",
      "pubDate": "Sun, 01 Jun 2025 05:50:00 GMT"
    },
    {
      "title": "Trump doesn’t know how to deal with China. His cowardice only makes a war with Taiwan more likely | Simon Tisdall - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 05:00:00 GMT"
    },
    {
      "title": "China warns US not to ‘play with fire’ over Taiwan - Al Jazeera",
      "pubDate": "Sun, 01 Jun 2025 09:28:09 GMT"
    },
    {
      "title": "Australia asks China to explain 'extraordinary' military build-up - BBC",
      "pubDate": "Sun, 01 Jun 2025 07:44:34 GMT"
    },
    {
      "title": "China Home Sales Slump Drags On as Deflation Eats Into Incomes - Bloomberg.com",
      "pubDate": "Sun, 01 Jun 2025 07:25:00 GMT"
    },
    {
      "title": "China is waking up from its property nightmare - The Economist",
      "pubDate": "Sun, 01 Jun 2025 14:55:37 GMT"
    },
    {
      "title": "China launches spacecraft headed for asteroids near Mars - KCRA",
      "pubDate": "Sun, 01 Jun 2025 16:26:00 GMT"
    },
    {
      "title": "Jamie Dimon says he wouldn't count on China folding under Trump's tariffs: 'They're not scared, folks.' - Business Insider",
      "pubDate": "Sun, 01 Jun 2025 15:39:00 GMT"
    },
    {
      "title": "Why China feels ‘emboldened’ in its trade war with the U.S. - MSNBC News",
      "pubDate": "Sun, 01 Jun 2025 21:08:33 GMT"
    },
    {
      "title": "Treasury Secretary Scott Bessent \"confident\" U.S.-China trade details \"will be ironed out\" when Trump, Xi talk - CBS News",
      "pubDate": "Sun, 01 Jun 2025 19:39:00 GMT"
    },
    {
      "title": "China Accuses US of Violating Trade Truce, Vows Firm Response - Bloomberg.com",
      "pubDate": "Mon, 02 Jun 2025 01:32:00 GMT"
    },
    {
      "title": "China responds after Hegseth warns to prepare for war - upi.com",
      "pubDate": "Sun, 01 Jun 2025 16:43:07 GMT"
    },
    {
      "title": "China claims U.S. violated trade deal, vows to hit Trump admin with \"forceful measures\" - Axios",
      "pubDate": "Mon, 02 Jun 2025 03:42:12 GMT"
    },
    {
      "title": "China says US is ‘provoking frictions’ as tensions flare despite trade truce - CNN",
      "pubDate": "Mon, 02 Jun 2025 03:38:00 GMT"
    },
    {
      "title": "China rejects Trump's accusation that it breached Geneva trade deal - Reuters",
      "pubDate": "Mon, 02 Jun 2025 03:08:00 GMT"
    },
    {
      "title": "China Warns US Ally With Show of Force - Newsweek",
      "pubDate": "Mon, 02 Jun 2025 09:22:01 GMT"
    },
    {
      "title": "China Says U.S. Is ‘Seriously Violating’ Trade Truce. Tensions Are Rising Again. - Barron's",
      "pubDate": "Mon, 02 Jun 2025 11:06:00 GMT"
    },
    {
      "title": "US Warship Challenged Beijing's South China Sea Claims, Navy Says - Newsweek",
      "pubDate": "Mon, 02 Jun 2025 14:26:30 GMT"
    },
    {
      "title": "US efforts to coerce China into trade concessions ‘will not work’, analysts say - South China Morning Post",
      "pubDate": "Mon, 02 Jun 2025 15:00:08 GMT"
    },
    {
      "title": "Map Shows China's Arms Sales Footprint Around the World: J-35 warplanes to drones, tanks and ships - Newsweek",
      "pubDate": "Mon, 02 Jun 2025 15:59:51 GMT"
    },
    {
      "title": "China says US moves on computer chips and student visas ‘seriously violate’ tariffs truce - AP News",
      "pubDate": "Mon, 02 Jun 2025 15:18:00 GMT"
    },
    {
      "title": "China launches Qihang a 20 MW floating wind giant leaving the US in awe - Glass Almanac",
      "pubDate": "Mon, 02 Jun 2025 15:30:23 GMT"
    },
    {
      "title": "How the US and China Play the Fentanyl Blame Game - Bloomberg",
      "pubDate": "Mon, 02 Jun 2025 19:00:10 GMT"
    },
    {
      "title": "China Targets U.S. Military Members in Overseas Spy Operations - RealClearDefense",
      "pubDate": "Mon, 02 Jun 2025 12:08:18 GMT"
    },
    {
      "title": "U.S.-China tariff truce at risk of falling apart with both sides pointing fingers - MSNBC News",
      "pubDate": "Mon, 02 Jun 2025 20:42:04 GMT"
    },
    {
      "title": "For Volatile Trump, Trade Pacts With China, Europe Prove Elusive - Bloomberg",
      "pubDate": "Mon, 02 Jun 2025 21:48:25 GMT"
    },
    {
      "title": "China to open first museum of African culture - TV BRICS",
      "pubDate": "Mon, 02 Jun 2025 18:20:35 GMT"
    },
    {
      "title": "China's May factory activity unexpectedly shrinks, clocking its worst drop since 2022: Caixin - CNBC",
      "pubDate": "Tue, 03 Jun 2025 02:00:00 GMT"
    },
    {
      "title": "China Private Factory Gauge Unexpectedly Shrinks After US Truce - Bloomberg.com",
      "pubDate": "Tue, 03 Jun 2025 01:48:00 GMT"
    },
    {
      "title": "China Holds Leverage in Rare-Earths Trade Dispute With US - Bloomberg.com",
      "pubDate": "Mon, 02 Jun 2025 21:31:26 GMT"
    },
    {
      "title": "China's factory activity cools in May as US tariffs hit - Reuters",
      "pubDate": "Tue, 03 Jun 2025 01:49:00 GMT"
    },
    {
      "title": "China turns to alternate beef imports as U.S. tariffs drive prices up - NBC News",
      "pubDate": "Tue, 03 Jun 2025 09:37:00 GMT"
    },
    {
      "title": "Emerging-Market Stocks Gain as China Data Refuel Stimulus Hopes - Bloomberg.com",
      "pubDate": "Tue, 03 Jun 2025 09:33:18 GMT"
    },
    {
      "title": "Exclusive: China's rare earth export curbs risk halting German car production, lobby group warns - Reuters",
      "pubDate": "Tue, 03 Jun 2025 12:41:40 GMT"
    },
    {
      "title": "The great Trump riddle on China - Financial Times",
      "pubDate": "Tue, 03 Jun 2025 10:49:27 GMT"
    },
    {
      "title": "Video Shows US Ally Confronting China in Contested Waters - Newsweek",
      "pubDate": "Tue, 03 Jun 2025 15:26:14 GMT"
    },
    {
      "title": "Global Alarms Rise as China's Critical Mineral Export Ban Takes Hold - U.S. News & World Report",
      "pubDate": "Tue, 03 Jun 2025 16:43:00 GMT"
    },
    {
      "title": "China Rejects Dutch Minister's Spying Accusation, Says Tech Achievements Not 'Stolen' - U.S. News & World Report",
      "pubDate": "Tue, 03 Jun 2025 19:51:00 GMT"
    },
    {
      "title": "Chinese nationals accused of smuggling 'biological pathogen' into US - BBC",
      "pubDate": "Tue, 03 Jun 2025 18:41:13 GMT"
    },
    {
      "title": "Chinese couple charged with smuggling a biological pathogen into the U.S. - NBC News",
      "pubDate": "Tue, 03 Jun 2025 22:20:18 GMT"
    },
    {
      "title": "China's rare earth curbs threaten India's auto sector, EV production - The Economic Times",
      "pubDate": "Wed, 04 Jun 2025 00:00:00 GMT"
    },
    {
      "title": "How is China ramping up controls on critical mineral exports amid row with US? - South China Morning Post",
      "pubDate": "Wed, 04 Jun 2025 03:00:12 GMT"
    },
    {
      "title": "China Really Wants to Attract Talented Scientists. Trump Just Helped. - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 04:01:08 GMT"
    },
    {
      "title": "EU industry could grind to a halt over China’s rare earth restrictions - South China Morning Post",
      "pubDate": "Wed, 04 Jun 2025 05:44:03 GMT"
    },
    {
      "title": "China Considers Ordering Hundreds of Airbus Jets in Major Deal - Bloomberg.com",
      "pubDate": "Wed, 04 Jun 2025 05:36:00 GMT"
    },
    {
      "title": "Some European auto supplier plants shut down after China's rare earth curbs, association says - Reuters",
      "pubDate": "Wed, 04 Jun 2025 08:19:58 GMT"
    },
    {
      "title": "Chinese seller on Amazon sold ‘defective’ tools linked to deaths, life-changing injuries: lawsuits - New York Post",
      "pubDate": "Wed, 04 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "What to know about China's rare earth export controls - Reuters",
      "pubDate": "Wed, 04 Jun 2025 10:19:01 GMT"
    },
    {
      "title": "China calls Rubio remarks about Tiananmen Square an \"attack\" - CBS News",
      "pubDate": "Wed, 04 Jun 2025 12:00:19 GMT"
    },
    {
      "title": "Footage Shows Chinese Ships Near US Ally's Disputed Island Base - Newsweek",
      "pubDate": "Wed, 04 Jun 2025 12:53:37 GMT"
    },
    {
      "title": "Exports Lost To 7-Year Trump-Biden China Tariffs: $160-$201 Billion - Forbes",
      "pubDate": "Wed, 04 Jun 2025 14:48:38 GMT"
    },
    {
      "title": "Trump’s China Tariffs Are Backfiring in Funniest Way Possible - The New Republic",
      "pubDate": "Wed, 04 Jun 2025 19:37:21 GMT"
    },
    {
      "title": "China’s Power Prices Nosedive in Relief to Tariff-Hit Factories - Bloomberg",
      "pubDate": "Thu, 05 Jun 2025 00:19:29 GMT"
    },
    {
      "title": "China helps Russia pull ahead in lethal drone war race with Ukraine - politico.eu",
      "pubDate": "Thu, 05 Jun 2025 02:26:02 GMT"
    },
    {
      "title": "Auto industry sounds the alarm as China's rare earth curbs start to bite - CNBC",
      "pubDate": "Thu, 05 Jun 2025 05:10:54 GMT"
    },
    {
      "title": "China’s Global Income Tax Crackdown Expands Beyond Ultra Rich - Bloomberg",
      "pubDate": "Thu, 05 Jun 2025 06:09:00 GMT"
    },
    {
      "title": "China increases scrutiny of rare earth magnets with new tracking system - Reuters",
      "pubDate": "Thu, 05 Jun 2025 04:17:53 GMT"
    },
    {
      "title": "A quiet Tiananmen Square anniversary shows China’s ability to suppress history - AP News",
      "pubDate": "Thu, 05 Jun 2025 02:11:00 GMT"
    },
    {
      "title": "EU sounds alarm to China over rare earth export controls - CNN",
      "pubDate": "Thu, 05 Jun 2025 07:55:00 GMT"
    },
    {
      "title": "China’s Economic Slowdown Fuels Social Media Anger at Elites - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 09:04:17 GMT"
    },
    {
      "title": "China issues warrants for alleged Taiwanese hackers and bans a business for pro-independence links - AP News",
      "pubDate": "Thu, 05 Jun 2025 09:56:00 GMT"
    },
    {
      "title": "Trump and Xi talk on the phone, their first call since the tariff war began - NPR",
      "pubDate": "Thu, 05 Jun 2025 14:06:10 GMT"
    },
    {
      "title": "Trump tariffs live updates: Trump and China's Xi Jinping speak at last, agree to more talks - Yahoo Finance",
      "pubDate": "Thu, 05 Jun 2025 15:38:32 GMT"
    },
    {
      "title": "Trump and China's Xi break the ice with first phone call since launch of trade war - USA Today",
      "pubDate": "Thu, 05 Jun 2025 19:38:31 GMT"
    },
    {
      "title": "Exclusive | Iran Orders Material From China for Hundreds of Ballistic Missiles - WSJ",
      "pubDate": "Thu, 05 Jun 2025 23:00:00 GMT"
    },
    {
      "title": "China and U.S. will hold more tariff talks, Trump says after Xi call - PBS",
      "pubDate": "Thu, 05 Jun 2025 15:07:04 GMT"
    },
    {
      "title": "Donald Trump confirms China trip after 'very good' call with Xi Jinping - BBC",
      "pubDate": "Thu, 05 Jun 2025 17:32:17 GMT"
    },
    {
      "title": "Trump says he will travel to China - NBC News",
      "pubDate": "Thu, 05 Jun 2025 19:53:21 GMT"
    },
    {
      "title": "Trump Says He Discussed Trade, Rare Earths in Call With China’s Xi - WSJ",
      "pubDate": "Thu, 05 Jun 2025 20:50:00 GMT"
    },
    {
      "title": "China's exports likely slowed in May amid trade uncertainties - Reuters poll - Reuters",
      "pubDate": "Fri, 06 Jun 2025 05:57:00 GMT"
    },
    {
      "title": "Iran Importing Missile Fuel From China as US Tensions Rise: Report - Newsweek",
      "pubDate": "Fri, 06 Jun 2025 08:44:30 GMT"
    },
    {
      "title": "China’s rare earth weapon changes contours of trade war battlefield - Reuters",
      "pubDate": "Fri, 06 Jun 2025 09:04:55 GMT"
    },
    {
      "title": "China demonstrates coast guard capability to Pacific nations, step towards high seas patrols - Reuters",
      "pubDate": "Fri, 06 Jun 2025 09:50:34 GMT"
    },
    {
      "title": "US-China trade call’s impact on firms, Trump-Musk feud: SCMP daily highlights - South China Morning Post",
      "pubDate": "Fri, 06 Jun 2025 13:15:08 GMT"
    },
    {
      "title": "China Allows Limited Exports of Rare Earths as Shortages Continue - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 10:30:24 GMT"
    },
    {
      "title": "Trump Is Holding Back From Calling Out China Over Russia War Aid - Bloomberg.com",
      "pubDate": "Fri, 06 Jun 2025 14:38:42 GMT"
    },
    {
      "title": "Trump announces U.S.-China trade talks in London next week - CNBC",
      "pubDate": "Fri, 06 Jun 2025 18:34:42 GMT"
    },
    {
      "title": "Buyer With Ties to Chinese Communist Party Got V.I.P. Treatment at Trump Crypto Dinner - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 21:04:55 GMT"
    },
    {
      "title": "China may make a ‘retaliatory’ move that experts say will ‘hit' US homeowners 'hard.' Here's what's happening - Yahoo Finance",
      "pubDate": "Fri, 06 Jun 2025 19:33:00 GMT"
    },
    {
      "title": "Watch What to Expect From US, China Trade Talks Monday? - Bloomberg.com",
      "pubDate": "Sat, 07 Jun 2025 00:29:00 GMT"
    },
    {
      "title": "Exclusive: US suspends licenses to ship nuclear plant parts to China, sources say - Reuters",
      "pubDate": "Fri, 06 Jun 2025 20:28:55 GMT"
    },
    {
      "title": "China Is Putting Aside Its Self-Sufficiency Push for American Medicine - WSJ",
      "pubDate": "Sat, 07 Jun 2025 03:00:00 GMT"
    },
    {
      "title": "China Central Bank Extends Gold-Buying Streak for Seventh Month - Bloomberg",
      "pubDate": "Sat, 07 Jun 2025 02:43:00 GMT"
    },
    {
      "title": "China's driverless lorries hope to expand - BBC",
      "pubDate": "Fri, 06 Jun 2025 22:38:05 GMT"
    }
  ],
  "iran": [
    {
      "title": "Trump says US, Iran ‘fairly close’ to reaching nuclear deal - The Times of Israel",
      "pubDate": "Sat, 31 May 2025 05:24:49 GMT"
    },
    {
      "title": "Iran has amassed even more near weapons-grade uranium, UN watchdog says - The Washington Post",
      "pubDate": "Sat, 31 May 2025 10:59:16 GMT"
    },
    {
      "title": "New IAEA report confirms Iran carried out secret nuclear activities at three undeclared sites - The Times of Israel",
      "pubDate": "Sat, 31 May 2025 11:07:43 GMT"
    },
    {
      "title": "IAEA report says Iran had secret activities with undeclared nuclear material - Reuters",
      "pubDate": "Sat, 31 May 2025 10:59:14 GMT"
    },
    {
      "title": "IAEA exposes secret Iranian nuclear uranium enrichment, report says - The Jerusalem Post",
      "pubDate": "Sat, 31 May 2025 12:27:00 GMT"
    },
    {
      "title": "Iran has increased its stockpile of near weapons-grade uranium, nuclear watchdog says - CBS News",
      "pubDate": "Sat, 31 May 2025 13:33:52 GMT"
    },
    {
      "title": "Iran increases stockpile of enriched Uranium by 50 percent, IAEA says - Al Jazeera",
      "pubDate": "Sat, 31 May 2025 14:15:12 GMT"
    },
    {
      "title": "Iran Has Ramped Up Uranium Enrichment While Continuing Nuclear Talks - The New York Times",
      "pubDate": "Sat, 31 May 2025 15:48:30 GMT"
    },
    {
      "title": "Iran Builds Up Near Weapons-Grade Uranium Stockpile Despite Nuclear Talks - WSJ",
      "pubDate": "Sat, 31 May 2025 17:05:00 GMT"
    },
    {
      "title": "Iran boosts enriched uranium stockpile, as Trump pushes negotiations - The Washington Post",
      "pubDate": "Sat, 31 May 2025 21:49:28 GMT"
    },
    {
      "title": "US sends Iran nuclear deal proposal after UN watchdog report - BBC",
      "pubDate": "Sat, 31 May 2025 22:37:47 GMT"
    },
    {
      "title": "U.S. gives Iran updated nuclear deal offer - Axios",
      "pubDate": "Sat, 31 May 2025 23:32:48 GMT"
    },
    {
      "title": "Iran Says It’s Not After Nuclear Bombs as It Rejects IAEA Report - Bloomberg",
      "pubDate": "Sun, 01 Jun 2025 06:53:00 GMT"
    },
    {
      "title": "US sends Iran nuclear proposal, WH says - The Hill",
      "pubDate": "Sun, 01 Jun 2025 13:09:00 GMT"
    },
    {
      "title": "Military briefing: How Iran is preparing for Israeli or US strikes - Financial Times",
      "pubDate": "Sun, 01 Jun 2025 04:01:38 GMT"
    },
    {
      "title": "Does damning IAEA report mark end of an Iran nuclear deal? - Al Jazeera",
      "pubDate": "Sun, 01 Jun 2025 18:52:10 GMT"
    },
    {
      "title": "Opinion | Iran’s Latest Nuclear Weapons Progress - WSJ",
      "pubDate": "Sun, 01 Jun 2025 19:02:57 GMT"
    },
    {
      "title": "Exclusive: Iran poised to dismiss US nuclear proposal, Iranian diplomat says - Reuters",
      "pubDate": "Mon, 02 Jun 2025 12:00:07 GMT"
    },
    {
      "title": "Iran demands sanctions relief guarantee in nuclear talks with US - Al Jazeera",
      "pubDate": "Mon, 02 Jun 2025 11:23:32 GMT"
    },
    {
      "title": "Trump claims U.S. won't let Iran enrich uranium under nuclear deal - Axios",
      "pubDate": "Tue, 03 Jun 2025 13:09:05 GMT"
    },
    {
      "title": "U.N. Nuclear Watchdog Has ‘Serious Concern’ About Iran’s Rapidly Growing Uranium Stockpile - U.S. News & World Report",
      "pubDate": "Tue, 03 Jun 2025 19:30:00 GMT"
    },
    {
      "title": "Analysis: An outline is emerging of the US offer to Iran in their high-stakes nuclear negotiations - AP News",
      "pubDate": "Tue, 03 Jun 2025 19:40:00 GMT"
    },
    {
      "title": "Critical US-Iran nuclear talks on shaky ground - ABC News",
      "pubDate": "Thu, 05 Jun 2025 02:03:57 GMT"
    },
    {
      "title": "Israel assured U.S. it won't strike Iran unless talks fail - Axios",
      "pubDate": "Thu, 05 Jun 2025 20:44:56 GMT"
    },
    {
      "title": "Iran orders materials from China that can make some 800 ballistic missiles – report - The Times of Israel",
      "pubDate": "Fri, 06 Jun 2025 06:38:40 GMT"
    },
    {
      "title": "US issues new Iran-related sanctions targeting over 35 entities - The Jerusalem Post",
      "pubDate": "Fri, 06 Jun 2025 19:59:00 GMT"
    }
  ],
  "us_economy": [
    {
      "title": "Will I get refunds? Small businesses wonder as courts rule on Trump tariffs - NPR",
      "pubDate": "Fri, 30 May 2025 09:00:56 GMT"
    },
    {
      "title": "Consumer Headlines: US economy shrank in first quarter of 2025 - news8000.com",
      "pubDate": "Fri, 30 May 2025 10:30:00 GMT"
    },
    {
      "title": "US stocks fall in early trading to give back some of their recent gains - Star Beacon",
      "pubDate": "Fri, 30 May 2025 13:40:04 GMT"
    },
    {
      "title": "Trade threats consume the U.S. economy - Axios",
      "pubDate": "Fri, 30 May 2025 16:05:30 GMT"
    },
    {
      "title": "US Consumers Hit the Brakes While Goods Imports Plunged in April - Bloomberg",
      "pubDate": "Fri, 30 May 2025 15:32:28 GMT"
    },
    {
      "title": "US stocks drop after Trump accuses China of violating tariff deal, plans more curbs - USA Today",
      "pubDate": "Fri, 30 May 2025 14:48:45 GMT"
    },
    {
      "title": "Weak sentiment on US economy not reflected in consumer data, says economist - FT Adviser",
      "pubDate": "Fri, 30 May 2025 09:37:01 GMT"
    },
    {
      "title": "The US economy contracted by 0.2% in the first quarter, less than estimated - MSN",
      "pubDate": "Fri, 30 May 2025 10:21:30 GMT"
    },
    {
      "title": "US to double tariffs on steel and aluminium imports to 50%, Trump says - BBC",
      "pubDate": "Sat, 31 May 2025 00:31:01 GMT"
    },
    {
      "title": "America Let Its Military-Industrial Might Wither. China’s Is Booming. - WSJ",
      "pubDate": "Sat, 31 May 2025 03:30:44 GMT"
    },
    {
      "title": "Modern Retail Podcast: Nike's Amazon return, E.l.f's big Rhode bet, and debunking recession indicators - Modern Retail",
      "pubDate": "Sat, 31 May 2025 04:04:17 GMT"
    },
    {
      "title": "Want to see where Trump’s tariffs are leading US business? Look at Georgia - The Guardian",
      "pubDate": "Sat, 31 May 2025 11:00:00 GMT"
    },
    {
      "title": "Fed, PYMNTS Reports Highlight How Financially Strained Consumers Use BNPL - PYMNTS.com",
      "pubDate": "Sat, 31 May 2025 07:10:49 GMT"
    },
    {
      "title": "Here are the retailers raising prices as Trump tariffs take hold - CNBC",
      "pubDate": "Sat, 31 May 2025 12:00:01 GMT"
    },
    {
      "title": "Billionaire Ray Dalio Warns US Economy Headed for ‘Terrible Outcome’ if Deficit Isn’t Slashed, Recommends ‘3 Percent Solution’: Report - The Daily Hodl",
      "pubDate": "Sat, 31 May 2025 16:01:05 GMT"
    },
    {
      "title": "Bond auction shows Trump’s economic house of cards may soon collapse - The Hill",
      "pubDate": "Sat, 31 May 2025 20:00:00 GMT"
    },
    {
      "title": "Soaring U.S. debt doesn't just put America at risk. It could trigger contagion across global markets, IIF warns - Fortune",
      "pubDate": "Sat, 31 May 2025 19:51:00 GMT"
    },
    {
      "title": "Why the U.S. Economy Will Muddle Through Trump’s Tariffs. Probably. - WSJ",
      "pubDate": "Sun, 01 Jun 2025 04:03:00 GMT"
    },
    {
      "title": "Federal Reserve looking to ‘tank’ US economy to ‘hurt’ Trump - Sky News Australia",
      "pubDate": "Sun, 01 Jun 2025 02:22:21 GMT"
    },
    {
      "title": "U.S. Economy Shrinks for the First Time in Three Years: GDP Decreases by 0.2% in Q1 2025 - news.twaslnews.com",
      "pubDate": "Sun, 01 Jun 2025 11:30:46 GMT"
    },
    {
      "title": "Why Trump’s unpredictable tariffs are so devastating for small businesses - The Hill",
      "pubDate": "Sun, 01 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "How American consumers are feeling the squeeze, in 4 charts - CNN",
      "pubDate": "Sun, 01 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Stock market’s haul in May comes as tariff turmoil and job angst lurk on the horizon - MarketWatch",
      "pubDate": "Sun, 01 Jun 2025 16:00:00 GMT"
    },
    {
      "title": "Companies are struggling to fill manufacturing positions, let alone plan for what Trump's administration has in mind - Business Insider",
      "pubDate": "Sun, 01 Jun 2025 10:54:00 GMT"
    },
    {
      "title": "Fed Chair Powell has closed door meeting at the White House on interest rate cuts - TheStreet",
      "pubDate": "Mon, 02 Jun 2025 00:06:23 GMT"
    },
    {
      "title": "US small business owners struggle to diversify from China manufacturing - Nikkei Asia",
      "pubDate": "Sun, 01 Jun 2025 20:15:00 GMT"
    },
    {
      "title": "U.S. Dependence on China for Rare Earth Magnets Is Causing Shortages - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 04:01:05 GMT"
    },
    {
      "title": "Trump plunges the US economy into chaos and uncertainty - EL PAÍS English",
      "pubDate": "Mon, 02 Jun 2025 09:25:18 GMT"
    },
    {
      "title": "Fed Chair Powell Meets With White House As Rate Cut Pressure Builds - Money Talks News",
      "pubDate": "Mon, 02 Jun 2025 12:31:43 GMT"
    },
    {
      "title": "Federal Reserve still eyes rate cuts amid tariff risks - MSN",
      "pubDate": "Mon, 02 Jun 2025 13:51:29 GMT"
    },
    {
      "title": "Fed Chair Powell's speech today looms as interest rate cut debate rages on - TheStreet",
      "pubDate": "Mon, 02 Jun 2025 13:11:28 GMT"
    },
    {
      "title": "US recession may be avoided despite economic challenges - Hospitality Investor",
      "pubDate": "Mon, 02 Jun 2025 16:14:51 GMT"
    },
    {
      "title": "Fed likely on track to lower rates after bumpy period, says Goolsbee - Reuters",
      "pubDate": "Mon, 02 Jun 2025 17:51:04 GMT"
    },
    {
      "title": "Consumers Are Financing Their Groceries. What Does It Say About the Economy? - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 17:12:11 GMT"
    },
    {
      "title": "Federal Reserve’s Goolsbee sees path to lower interest rates despite recent turbulence - Seeking Alpha",
      "pubDate": "Mon, 02 Jun 2025 18:02:00 GMT"
    },
    {
      "title": "Finance leaders fear destructive U.S. debt scenario - Axios",
      "pubDate": "Mon, 02 Jun 2025 17:31:31 GMT"
    },
    {
      "title": "The US Economy Has a Leak - Bloomberg.com",
      "pubDate": "Mon, 02 Jun 2025 15:48:52 GMT"
    },
    {
      "title": "Global economy to slow as Donald Trump’s trade wars hit growth, OECD warns – business live - The Guardian",
      "pubDate": "Tue, 03 Jun 2025 06:17:00 GMT"
    },
    {
      "title": "It's Official: Trump's Tariffs Are Damaging the Economy - Business Insider",
      "pubDate": "Tue, 03 Jun 2025 09:48:00 GMT"
    },
    {
      "title": "U.S. growth forecast cut sharply by OECD as Trump tariffs sour global outlook - CNBC",
      "pubDate": "Tue, 03 Jun 2025 07:00:04 GMT"
    },
    {
      "title": "Fed’s Bostic Sees 1 Rate Cut in 2025. Tariffs Could Derail That. - Barron's",
      "pubDate": "Tue, 03 Jun 2025 14:25:00 GMT"
    },
    {
      "title": "US banks need to be taking trade war risks much more seriously - American Banker",
      "pubDate": "Tue, 03 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Federal judge dismisses California's lawsuit over Trump tariffs, citing jurisdiction issue - Fox Business",
      "pubDate": "Tue, 03 Jun 2025 12:31:00 GMT"
    },
    {
      "title": "OECD lowers global outlook as Trump trade war hits US growth - Reuters",
      "pubDate": "Tue, 03 Jun 2025 11:25:38 GMT"
    },
    {
      "title": "Trump tariffs live updates: Trump pushes for trade deals as global economy takes a hit - Yahoo Finance",
      "pubDate": "Tue, 03 Jun 2025 16:46:27 GMT"
    },
    {
      "title": "OECD forecasts sharp contraction of U.S. economy due to tariffs - Scotsman Guide",
      "pubDate": "Tue, 03 Jun 2025 17:59:45 GMT"
    },
    {
      "title": "Forecast shows trade war bogging down economic growth - Axios",
      "pubDate": "Tue, 03 Jun 2025 16:28:37 GMT"
    },
    {
      "title": "Trump signs order hiking steel tariffs - BBC",
      "pubDate": "Tue, 03 Jun 2025 22:19:48 GMT"
    },
    {
      "title": "US economic growth forecast cut sharply due to higher tariffs - Fox Business",
      "pubDate": "Tue, 03 Jun 2025 16:46:00 GMT"
    },
    {
      "title": "Ray Dalio just joined the list of billionaires sounding the alarm on the US economy - CNN",
      "pubDate": "Tue, 03 Jun 2025 21:43:00 GMT"
    },
    {
      "title": "Fed's Powell tells Princeton grads to guard integrity amid Trump criticism - CNBC",
      "pubDate": "Wed, 04 Jun 2025 07:40:12 GMT"
    },
    {
      "title": "Tariff-Resistant US Economy Soothes Traders Ahead of Jobs Data - Bloomberg.com",
      "pubDate": "Wed, 04 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "As Recession Risk Rises, Don’t Expect 2008 Repeat (opinion) - Inside Higher Ed",
      "pubDate": "Wed, 04 Jun 2025 07:01:22 GMT"
    },
    {
      "title": "Trump says 'Too Late' Powell must lower interest rates after weak ADP jobs report - CNBC",
      "pubDate": "Wed, 04 Jun 2025 12:25:29 GMT"
    },
    {
      "title": "Businesses are raising prices after tariffs — even on unaffected goods - Axios",
      "pubDate": "Wed, 04 Jun 2025 14:02:29 GMT"
    },
    {
      "title": "Disappointing May jobs report puts more pressure on the Federal Reserve - Scotsman Guide",
      "pubDate": "Wed, 04 Jun 2025 16:51:49 GMT"
    },
    {
      "title": "Trump tax bill will add $2.4 trillion to the deficit and leave 10.9 million more uninsured, CBO says - AP News",
      "pubDate": "Wed, 04 Jun 2025 18:05:00 GMT"
    },
    {
      "title": "10.9 million people would lose health insurance under Trump’s tax cut bill, CBO projects - statnews.com",
      "pubDate": "Wed, 04 Jun 2025 20:37:09 GMT"
    },
    {
      "title": "Fed 'Beige Book' economic report cites declining growth, rising prices and slow hiring - CNBC",
      "pubDate": "Wed, 04 Jun 2025 18:25:20 GMT"
    },
    {
      "title": "Businesses brace for steel and aluminum tariffs, which double today - The Washington Post",
      "pubDate": "Wed, 04 Jun 2025 22:27:44 GMT"
    },
    {
      "title": "Wall Street’s big rally stalls following some discouraging economic data - AP News",
      "pubDate": "Wed, 04 Jun 2025 20:51:00 GMT"
    },
    {
      "title": "US services sector contracts in May; businesses face higher prices - Reuters",
      "pubDate": "Wed, 04 Jun 2025 17:13:13 GMT"
    },
    {
      "title": "Trump spending bill to cut taxes by $3.7T, add $2.4T to deficit, CBO says - Fox Business",
      "pubDate": "Wed, 04 Jun 2025 14:45:05 GMT"
    },
    {
      "title": "Beige Book Reports Slight Economic Growth Alongside Uncertainty - Federal Reserve Bank of Atlanta",
      "pubDate": "Wed, 04 Jun 2025 18:07:33 GMT"
    },
    {
      "title": "US economic activity declines as tariffs pressure prices, Fed says - Reuters",
      "pubDate": "Wed, 04 Jun 2025 20:15:49 GMT"
    },
    {
      "title": "US Economy Slowing as Consumers 'Reluctant to Spend': Economic Analyst - NTD News",
      "pubDate": "Thu, 05 Jun 2025 00:59:00 GMT"
    },
    {
      "title": "US economy slows as Trump’s tariffs put pressure: The Fed - Tech in Asia",
      "pubDate": "Thu, 05 Jun 2025 02:40:00 GMT"
    },
    {
      "title": "Wall Street ends narrowly mixed in choppy trade on weak economic data - Reuters",
      "pubDate": "Wed, 04 Jun 2025 22:51:49 GMT"
    },
    {
      "title": "ECB Cuts Rates Again, Widening Gap With Federal Reserve - WSJ",
      "pubDate": "Thu, 05 Jun 2025 08:09:00 GMT"
    },
    {
      "title": "Watch US Economy: Jobless Claims Rise, Trade Deficit Narrows - Bloomberg",
      "pubDate": "Thu, 05 Jun 2025 13:07:02 GMT"
    },
    {
      "title": "Trump slams Fed chair Powell after hiring slowdown - Axios",
      "pubDate": "Thu, 05 Jun 2025 05:40:34 GMT"
    },
    {
      "title": "Businesses Expect to Pass Along 50% of Tariffs, Fed Survey Finds - Bloomberg",
      "pubDate": "Thu, 05 Jun 2025 19:06:20 GMT"
    },
    {
      "title": "Elon Musk Says Trump Tariffs Will Cause a Recession - WSJ",
      "pubDate": "Thu, 05 Jun 2025 20:18:00 GMT"
    },
    {
      "title": "The US economy just got a reality check - Yahoo Finance",
      "pubDate": "Thu, 05 Jun 2025 13:36:58 GMT"
    },
    {
      "title": "NY Federal Reserve finds a 'significant share' of companies saying they raised prices on goods not affected by tariffs - Fortune",
      "pubDate": "Thu, 05 Jun 2025 18:49:00 GMT"
    },
    {
      "title": "Elon Musk makes shocking prediction for US economy: 'Donald Trump's tariffs will cause recession in 2025!' - GB News",
      "pubDate": "Fri, 06 Jun 2025 00:08:50 GMT"
    },
    {
      "title": "Is Official US Economic Data Getting Less Reliable? - Investopedia",
      "pubDate": "Thu, 05 Jun 2025 17:31:38 GMT"
    },
    {
      "title": "US hiring likely slowed to 1,30,000 new jobs last month amid uncertainty over Trumps policies - Mint",
      "pubDate": "Fri, 06 Jun 2025 07:42:36 GMT"
    },
    {
      "title": "As Trump’s Tariffs Reshape Trade, Businesses Struggle With Economic Uncertainty - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 09:01:51 GMT"
    },
    {
      "title": "US employers added a solid 139,000 jobs in May despite uncertainty over trade wars - Times Union",
      "pubDate": "Fri, 06 Jun 2025 07:29:17 GMT"
    },
    {
      "title": "Solid Jobs Report Bolsters Fed’s Patience on Rate Cuts - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 13:45:39 GMT"
    },
    {
      "title": "U.S. economy adds 139,000 jobs in May - Axios",
      "pubDate": "Fri, 06 Jun 2025 12:37:02 GMT"
    },
    {
      "title": "Job growth continued to slow in May amid economic uncertainty - Fox Business",
      "pubDate": "Fri, 06 Jun 2025 12:32:00 GMT"
    },
    {
      "title": "U.S. added 139,000 jobs in May as the labor market steadily cools - NBC News",
      "pubDate": "Fri, 06 Jun 2025 13:38:56 GMT"
    },
    {
      "title": "May jobs report crushes recession fears, market expert says - TheStreet",
      "pubDate": "Fri, 06 Jun 2025 16:26:51 GMT"
    },
    {
      "title": "US economy: Trump again demands interest rate cut as hiring slows - The Times",
      "pubDate": "Fri, 06 Jun 2025 16:00:00 GMT"
    },
    {
      "title": "Hiring in U.S. Remained Steady in May - The New York Times",
      "pubDate": "Sat, 07 Jun 2025 00:18:26 GMT"
    },
    {
      "title": "Fed likely to leave rates unchanged as US job market cools but doesn't crumble - Reuters",
      "pubDate": "Sat, 07 Jun 2025 00:59:00 GMT"
    },
    {
      "title": "Stock Market Today: Dow Jones Soars As Trump Announces China Trade Talk; Microsoft Takes Nvidia Crown - Investor's Business Daily",
      "pubDate": "Fri, 06 Jun 2025 20:27:00 GMT"
    }
  ],
  "terrorism": [
    {
      "title": "6 injured in a Colorado attack the FBI is investigating as terrorism - Politico",
      "pubDate": "Mon, 02 Jun 2025 01:20:25 GMT"
    },
    {
      "title": "FBI investigating Boulder, Colorado attack as an act of terrorism - MSNBC News",
      "pubDate": "Mon, 02 Jun 2025 01:12:20 GMT"
    },
    {
      "title": "Potential ‘agroterrorism weapon’ fungus smuggled into US by Chinese scientists, FBI alleges - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 02:52:00 GMT"
    },
    {
      "title": "Alleged agro-terrorism by Chinese nationals proves China is 'greatest threat and adversary' to US, GOP senator says. - Fox Business",
      "pubDate": "Wed, 04 Jun 2025 22:10:21 GMT"
    }
  ],
  "cancer": [
    {
      "title": "Advanced colon cancer patients lived twice as long with a Pfizer combo therapy, trial finds - NBC News",
      "pubDate": "Fri, 30 May 2025 12:00:00 GMT"
    },
    {
      "title": "Biden says he has started cancer treatment: ‘The prognosis is good’ - The Washington Post",
      "pubDate": "Fri, 30 May 2025 19:33:32 GMT"
    },
    {
      "title": "Joe Biden strikes optimistic tone about cancer diagnosis: ‘We’re going to be able to beat this’ - CNN",
      "pubDate": "Fri, 30 May 2025 18:42:00 GMT"
    },
    {
      "title": "Immunotherapy drug doubles cancer survival in breakthrough trial - BBC",
      "pubDate": "Fri, 30 May 2025 23:08:37 GMT"
    },
    {
      "title": "Trump Attacks Cancer-Struck Biden in Heartless Oval Office Rant - The Daily Beast",
      "pubDate": "Fri, 30 May 2025 23:19:00 GMT"
    },
    {
      "title": "‘Gift of life’: experts hail neck and head cancer breakthrough - The Guardian",
      "pubDate": "Fri, 30 May 2025 23:00:00 GMT"
    },
    {
      "title": "‘Breakthrough’ breast cancer therapy can slow advance of disease and prolong survival - The Guardian",
      "pubDate": "Sat, 31 May 2025 12:02:00 GMT"
    },
    {
      "title": "Immunotherapy trial helps cancer patients with tumours live 40% longer - The Guardian",
      "pubDate": "Sat, 31 May 2025 20:01:00 GMT"
    },
    {
      "title": "Wildfire smoke exposure may shorten lung cancer survival - Reuters",
      "pubDate": "Sat, 31 May 2025 13:42:50 GMT"
    },
    {
      "title": "Biden White House insisted families were safe after toxic East Palestine derailment — but behind the scenes, admin warned of ‘cancer cluster’ - New York Post",
      "pubDate": "Sat, 31 May 2025 21:22:00 GMT"
    },
    {
      "title": "Exercise Extends Life for People With Cancer, Study Shows - The New York Times",
      "pubDate": "Sun, 01 Jun 2025 12:00:04 GMT"
    },
    {
      "title": "Blood test-guided treatment with AstraZeneca pill cut risk of breast cancer progression, study finds - Reuters",
      "pubDate": "Sun, 01 Jun 2025 16:08:21 GMT"
    },
    {
      "title": "Pharmacists warn drug shortage affecting cancer patients - BBC",
      "pubDate": "Mon, 02 Jun 2025 00:03:10 GMT"
    },
    {
      "title": "Exercise boosts survival rates in colon cancer patients, study shows - AP News",
      "pubDate": "Sun, 01 Jun 2025 19:34:00 GMT"
    },
    {
      "title": "Exercise ‘better than drugs’ to stop cancer returning after treatment, trial finds - The Guardian",
      "pubDate": "Mon, 02 Jun 2025 01:31:00 GMT"
    },
    {
      "title": "Major study proves exercise improves cancer survival - BBC",
      "pubDate": "Mon, 02 Jun 2025 10:04:32 GMT"
    },
    {
      "title": "Exercise Cuts Colon Cancer Recurrence and Boosts Survival, Study Finds - U.S. News & World Report",
      "pubDate": "Mon, 02 Jun 2025 15:50:55 GMT"
    },
    {
      "title": "Colon cancer survival rates improved with exercise, first-of-its-kind study finds - CBS News",
      "pubDate": "Mon, 02 Jun 2025 14:03:00 GMT"
    },
    {
      "title": "From No Hope to a Potential Cure for a Deadly Blood Cancer - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 14:45:05 GMT"
    },
    {
      "title": "New White House budget plan eyes dramatic cuts to cancer research - MSNBC News",
      "pubDate": "Tue, 03 Jun 2025 13:44:22 GMT"
    },
    {
      "title": "Jessie J reveals early breast cancer diagnosis - BBC",
      "pubDate": "Wed, 04 Jun 2025 06:27:55 GMT"
    },
    {
      "title": "Menopause Drug Reduces Breast Cancer Growth In Clinical Trial - ScienceAlert",
      "pubDate": "Thu, 05 Jun 2025 02:14:24 GMT"
    },
    {
      "title": "Scientists Crack 30-Year Mystery Behind “Holy Grail” Cancer Drug - SciTechDaily",
      "pubDate": "Thu, 05 Jun 2025 03:43:12 GMT"
    },
    {
      "title": "People with cancer face ‘ticking timebomb’ due to NHS staff shortages - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 23:03:00 GMT"
    },
    {
      "title": "Cancer research faces steep funding cuts under Trump's proposed budget - CBS News",
      "pubDate": "Thu, 05 Jun 2025 13:24:00 GMT"
    },
    {
      "title": "Shari Redstone Confirms Cancer Diagnosis While Facing Trump’s ‘60 Minutes’ Suit - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 00:02:20 GMT"
    },
    {
      "title": "A new blood test can tell if cancer has returned months before a scan - National Geographic",
      "pubDate": "Thu, 05 Jun 2025 21:15:08 GMT"
    }
  ],
  "democratic_party": [
    {
      "title": "MAGA Accuses Democratic Senator Cory Booker of Doing 'Nazi Salute' - Newsweek",
      "pubDate": "Sun, 01 Jun 2025 01:29:56 GMT"
    },
    {
      "title": "Democratic Party is at risk of becoming ‘roadkill,’ warns Tim Walz - The Washington Post",
      "pubDate": "Sun, 01 Jun 2025 03:05:36 GMT"
    },
    {
      "title": "Can the ‘Abundance Agenda’ Save the Democrats? - WSJ",
      "pubDate": "Sun, 01 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Dems Weigh High-Risk, High-Reward Plan to Win the Senate - The Bulwark",
      "pubDate": "Mon, 02 Jun 2025 00:50:29 GMT"
    },
    {
      "title": "Democrats are getting (another) chance to fix their brand - phillytrib.com",
      "pubDate": "Tue, 03 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "The Democrats’ new campaign agenda: No more Mister Nice Guy - The Hill",
      "pubDate": "Tue, 03 Jun 2025 13:30:00 GMT"
    },
    {
      "title": "Democratic party leaders just met for the first time in months. When will they take real action? | Norman Solomon - The Guardian",
      "pubDate": "Tue, 03 Jun 2025 14:01:00 GMT"
    },
    {
      "title": "House Democrats seek to grill Kristi Noem on DHS handcuffing Nadler aide - Axios",
      "pubDate": "Tue, 03 Jun 2025 16:05:31 GMT"
    },
    {
      "title": "Democrats lost voters’ trust. They need a new radical center wing to win it back. - The Hill",
      "pubDate": "Fri, 06 Jun 2025 18:00:00 GMT"
    },
    {
      "title": "Democrats who called on Andrew Cuomo to resign in 2021 are endorsing him in 2025 - NBC News",
      "pubDate": "Fri, 06 Jun 2025 20:03:37 GMT"
    }
  ],
  "north_korea": [
    {
      "title": "North and South Korea are in an underground war - Kim Jong Un might now be winning - BBC",
      "pubDate": "Fri, 30 May 2025 23:42:47 GMT"
    },
    {
      "title": "North Korea’s Kim Jong Un is beefing up his navy. Can he succeed? - CNN",
      "pubDate": "Sat, 31 May 2025 03:02:00 GMT"
    },
    {
      "title": "North Korea deploys mystery balloon-like objects to stricken warship, satellite photos show - CNN",
      "pubDate": "Sat, 31 May 2025 07:14:00 GMT"
    },
    {
      "title": "North Korea has deployed thousands of troops to help Russia 'terrorize Ukraine,' report finds - NBC News",
      "pubDate": "Sat, 31 May 2025 13:15:18 GMT"
    },
    {
      "title": "North Korea gaining military edge as Russia seeks war-time supplies - Business Standard",
      "pubDate": "Sat, 31 May 2025 18:36:41 GMT"
    },
    {
      "title": "Russia Gave North Korea Its Pantsir Air Defense Truck - Forbes",
      "pubDate": "Sun, 01 Jun 2025 03:58:12 GMT"
    },
    {
      "title": "North Korea's Kim vows unconditional support for Russia in meeting with Shoigu - Reuters",
      "pubDate": "Thu, 05 Jun 2025 03:25:00 GMT"
    },
    {
      "title": "Kim Jong Un vows to 'unconditionally support' Russia's war against Ukraine - upi.com",
      "pubDate": "Thu, 05 Jun 2025 04:01:04 GMT"
    }
  ],
  "hamas": [
    {
      "title": "Israel Orders Evacuation of Much of Northern Gaza, Warning of Dangerous Combat - The New York Times",
      "pubDate": "Fri, 30 May 2025 12:10:11 GMT"
    },
    {
      "title": "Israel's defense officials believe Hamas control over Gaza is slipping, helped by new aid system - The Times of Israel",
      "pubDate": "Fri, 30 May 2025 13:02:18 GMT"
    },
    {
      "title": "Hamas claims to target ‘undercover’ Israeli troops in video of Rafah IED attack - The Times of Israel",
      "pubDate": "Fri, 30 May 2025 14:12:48 GMT"
    },
    {
      "title": "Hamas 'thoroughly reviewing' ceasefire plan as UN warns all of Gaza at risk of famine - BBC",
      "pubDate": "Fri, 30 May 2025 13:40:23 GMT"
    },
    {
      "title": "Live updates: Hamas considers Gaza ceasefire proposal as Israeli strikes kill at least 27 - AP News",
      "pubDate": "Fri, 30 May 2025 20:37:00 GMT"
    },
    {
      "title": "Hamas reviews Gaza ceasefire proposal as U.S. expresses optimism - The Washington Post",
      "pubDate": "Sat, 31 May 2025 00:54:41 GMT"
    },
    {
      "title": "U.S., Israel waiting for Hamas to respond to ceasefire proposal for Gaza, White House says - CBS News",
      "pubDate": "Fri, 30 May 2025 20:45:00 GMT"
    },
    {
      "title": "Breaking down latest Israel-Hamas ceasefire proposal - CBS News",
      "pubDate": "Fri, 30 May 2025 23:04:00 GMT"
    },
    {
      "title": "Trump: Gaza ceasefire close, Israel warns Hamas of annihilation - The New Arab",
      "pubDate": "Sat, 31 May 2025 08:18:52 GMT"
    },
    {
      "title": "Hamas must accept hostage deal or be ‘annihilated’, warns Israeli defence minister – Middle East crisis live - The Guardian",
      "pubDate": "Sat, 31 May 2025 08:10:00 GMT"
    },
    {
      "title": "Hamas responds to US-led Gaza deal as Israel confirms it killed Mohammed Sinwar – Middle East crisis live - The Guardian",
      "pubDate": "Sat, 31 May 2025 08:10:00 GMT"
    },
    {
      "title": "Hamas response to US plan for Gaza ceasefire ‘totally unacceptable,’ Witkoff says - CNN",
      "pubDate": "Sat, 31 May 2025 19:33:00 GMT"
    },
    {
      "title": "Muhammad Sinwar, a Top Military Leader of Hamas, Is Dead, Israel Says - The New York Times",
      "pubDate": "Sat, 31 May 2025 20:21:25 GMT"
    },
    {
      "title": "Hamas responds to ceasefire proposal, reiterates demands - ABC News",
      "pubDate": "Sat, 31 May 2025 17:48:45 GMT"
    },
    {
      "title": "Israeli strike on aid delivery point kills 26 in Rafah, Hamas-linked media say - Reuters",
      "pubDate": "Sun, 01 Jun 2025 04:41:15 GMT"
    },
    {
      "title": "Hamas seeks amendments to Gaza ceasefire proposal but US envoy calls it ‘unacceptable’ - AP News",
      "pubDate": "Sun, 01 Jun 2025 03:27:00 GMT"
    },
    {
      "title": "U.S. envoy rejects Hamas ceasefire proposal as 'unacceptable' - NBC News",
      "pubDate": "Sat, 31 May 2025 22:54:41 GMT"
    },
    {
      "title": "Hamas seeks changes in US Gaza proposal, Witkoff calls response 'unacceptable' - Reuters",
      "pubDate": "Sun, 01 Jun 2025 04:07:00 GMT"
    },
    {
      "title": "Why Hamas is seeking to change the US-proposed Gaza ceasefire deal - Al Jazeera",
      "pubDate": "Sun, 01 Jun 2025 13:56:31 GMT"
    },
    {
      "title": "LIVE: Israeli forces kill dozens at US-backed aid sites in Gaza - Al Jazeera",
      "pubDate": "Sun, 01 Jun 2025 14:38:05 GMT"
    },
    {
      "title": "More Than 20 Killed Near Aid Distribution Site in Gaza, Health Officials Say - The New York Times",
      "pubDate": "Sun, 01 Jun 2025 18:35:44 GMT"
    },
    {
      "title": "Multiple Gaza-hostage-awareness marchers injured in attack in Boulder - NBC News",
      "pubDate": "Sun, 01 Jun 2025 22:20:20 GMT"
    },
    {
      "title": "Eight Burned in Attack at Colorado Event Honoring Israeli Hostages - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 06:37:00 GMT"
    },
    {
      "title": "Eight injured in petrol bomb and 'flamethrower' attack at rally for Hamas-held hostages in Colorado - Sky News",
      "pubDate": "Mon, 02 Jun 2025 08:37:30 GMT"
    },
    {
      "title": "Israel says 3 soldiers killed in Gaza in deadliest attack on its forces since a truce ended in March - The Washington Post",
      "pubDate": "Tue, 03 Jun 2025 05:55:21 GMT"
    },
    {
      "title": "Hamas's Gaza City commander, Izz al-Din al-Haddad, to replace Sinwar as Hamas chief - The Jerusalem Post",
      "pubDate": "Tue, 03 Jun 2025 03:53:00 GMT"
    },
    {
      "title": "IDF says troops fired on suspects outside Gaza aid site; Hamas health officials say 27 killed - The Times of Israel",
      "pubDate": "Tue, 03 Jun 2025 11:40:10 GMT"
    },
    {
      "title": "Doctor describes 'total carnage' as 27 reported killed by Israeli fire at Gaza aid centre - BBC",
      "pubDate": "Tue, 03 Jun 2025 13:52:25 GMT"
    },
    {
      "title": "Hamas praises former Biden official's statement accusing Israel of war crimes - The Jerusalem Post",
      "pubDate": "Tue, 03 Jun 2025 15:46:00 GMT"
    },
    {
      "title": "What to Know About the Deadly Shootings Near a Gaza Aid Site - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 05:30:40 GMT"
    },
    {
      "title": "Hamas rewriting response to US ceasefire proposal as Washington pushes for breakthrough - Ynetnews",
      "pubDate": "Tue, 03 Jun 2025 21:16:24 GMT"
    },
    {
      "title": "Gaza now worse than hell on earth, humanitarian chief tells BBC - BBC",
      "pubDate": "Wed, 04 Jun 2025 17:10:17 GMT"
    },
    {
      "title": "Hamas Says US Ceasefire Veto Violates 'American Values' - Newsweek",
      "pubDate": "Thu, 05 Jun 2025 01:15:54 GMT"
    },
    {
      "title": "US vetoes Gaza ceasefire resolution at UN Security Council, saying it emboldens Hamas - France 24",
      "pubDate": "Wed, 04 Jun 2025 20:47:23 GMT"
    },
    {
      "title": "Bodies of two Israeli-American hostages taken in 7 October attack recovered, Netanyahu says – Israel-Gaza war live - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 07:33:00 GMT"
    },
    {
      "title": "Bodies of Israeli-American hostages Judi Lynn Weinstein and Gad Haggai recovered by Israeli forces in Gaza - CBS News",
      "pubDate": "Thu, 05 Jun 2025 09:14:00 GMT"
    },
    {
      "title": "Israel providing guns to Gaza jihadist gang to bolster opposition to Hamas - The Times of Israel",
      "pubDate": "Thu, 05 Jun 2025 14:34:49 GMT"
    },
    {
      "title": "Israel ‘Activated Clans’ to Fight Hamas in Gaza, Netanyahu Says - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 20:13:12 GMT"
    },
    {
      "title": "Hamas chief says group did not reject US ceasefire proposal for Gaza, sought changes - Reuters",
      "pubDate": "Thu, 05 Jun 2025 19:19:13 GMT"
    },
    {
      "title": "Netanyahu confirms Israel arming clans opposed to Hamas in Gaza - BBC",
      "pubDate": "Thu, 05 Jun 2025 23:24:19 GMT"
    },
    {
      "title": "LIVE: Israel hits Gaza with wave of attacks on first day of Eid, killing 42 - Al Jazeera",
      "pubDate": "Fri, 06 Jun 2025 14:26:50 GMT"
    },
    {
      "title": "Israel at War Day 609 | Four Israeli Soldiers Killed in Building Collapse in Gaza's Khan Yunis Overnight Friday - Haaretz",
      "pubDate": "Fri, 06 Jun 2025 20:20:10 GMT"
    }
  ],
  "climate": [
    {
      "title": "Oil companies face a wrongful death suit tied to climate change - NPR",
      "pubDate": "Fri, 30 May 2025 09:30:00 GMT"
    },
    {
      "title": "Climate change adds extra month of extreme heat for 4bn people: Report - Al Jazeera",
      "pubDate": "Fri, 30 May 2025 09:45:00 GMT"
    },
    {
      "title": "Congress Could Unravel Biden’s Climate Law. Here’s What to Watch. - Bloomberg.com",
      "pubDate": "Fri, 30 May 2025 14:30:06 GMT"
    },
    {
      "title": "A Court Debates Whether a Climate Lawsuit Threatens National Security - The New York Times",
      "pubDate": "Fri, 30 May 2025 23:48:42 GMT"
    },
    {
      "title": "JPMorgan hired NOAA's chief scientist to advise clients on navigating climate change - CNBC",
      "pubDate": "Sat, 31 May 2025 12:00:01 GMT"
    },
    {
      "title": "Video: Climate Scientists Join 100-Hour Livestream to Protest Trump’s Cuts - The New York Times",
      "pubDate": "Sat, 31 May 2025 23:00:30 GMT"
    },
    {
      "title": "Scientists warn that polar warming might alter ocean currents and cause massive flooding in the U.S. - Earth.com",
      "pubDate": "Sun, 01 Jun 2025 06:21:51 GMT"
    },
    {
      "title": "Study: Expect more hurricanes like Frances in a warmer world, but with way more rain - Florida Today",
      "pubDate": "Sun, 01 Jun 2025 09:06:27 GMT"
    },
    {
      "title": "Rising seas, real risks: Chatham seeks community input on climate strategy - Cape Cod Times",
      "pubDate": "Mon, 02 Jun 2025 03:12:43 GMT"
    },
    {
      "title": "Climate Startups Are Pausing Operations, Cutting Staff and Entering Bankruptcy as Trump Policies Bite - WSJ",
      "pubDate": "Mon, 02 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "Many coastal communities are flooding more than we thought, researchers find - The Washington Post",
      "pubDate": "Mon, 02 Jun 2025 16:00:00 GMT"
    },
    {
      "title": "EU science advisers slam Brussels’ weakened 2040 climate plans - politico.eu",
      "pubDate": "Mon, 02 Jun 2025 12:01:00 GMT"
    },
    {
      "title": "How climate change is affecting hurricanes - NBC Connecticut",
      "pubDate": "Mon, 02 Jun 2025 19:31:24 GMT"
    },
    {
      "title": "EU warned by advisers not to weaken new climate goal - Reuters",
      "pubDate": "Mon, 02 Jun 2025 19:00:02 GMT"
    },
    {
      "title": "Study projects that increasing wildfires in Canada and Siberia will actually slow global warming - Phys.org",
      "pubDate": "Wed, 04 Jun 2025 13:59:04 GMT"
    },
    {
      "title": "US Senate Panel Seeks to Cut Unspent US Climate, Clean Energy Funds - U.S. News & World Report",
      "pubDate": "Thu, 05 Jun 2025 01:53:00 GMT"
    },
    {
      "title": "Hotter world will drive more wars, EU climate chief warns - Financial Times",
      "pubDate": "Thu, 05 Jun 2025 10:00:13 GMT"
    },
    {
      "title": "NASA scientists describe ‘absolute sh*tshow’ at agency as Trump budget seeks to dismantle top US climate lab - CNN",
      "pubDate": "Thu, 05 Jun 2025 17:43:00 GMT"
    },
    {
      "title": "Atmospheric CO2 buildup broke another record in May - E&E News by POLITICO",
      "pubDate": "Thu, 05 Jun 2025 17:33:00 GMT"
    },
    {
      "title": "Trump’s Attacks on Climate Policy Are Even Hitting Exxon - The New Republic",
      "pubDate": "Thu, 05 Jun 2025 17:56:47 GMT"
    },
    {
      "title": "Atmospheric carbon dioxide levels break seasonal records: NOAA - The Hill",
      "pubDate": "Fri, 06 Jun 2025 17:35:00 GMT"
    },
    {
      "title": "Earth’s Atmosphere Contains More CO2 Than It Has in Millions of Years - EcoWatch",
      "pubDate": "Sat, 07 Jun 2025 01:44:06 GMT"
    }
  ],
  "ai_safety": [
    {
      "title": "In Singapore, AI safety was never off the table - MLex",
      "pubDate": "Fri, 30 May 2025 09:57:00 GMT"
    },
    {
      "title": "What the AI Whistleblower Protection Act Would Mean for Tech Workers - Tech Policy Press",
      "pubDate": "Fri, 30 May 2025 12:49:35 GMT"
    },
    {
      "title": "MLCommons partners with NASSCOM to bring global AI reliability benchmarks to India - Deccan Herald",
      "pubDate": "Fri, 30 May 2025 20:34:38 GMT"
    },
    {
      "title": "The launch of the AI Safety Clock - imd.org",
      "pubDate": "Fri, 30 May 2025 21:13:06 GMT"
    },
    {
      "title": "Commentary: We regulate taco carts more than artificial intelligence - Times Union",
      "pubDate": "Sun, 01 Jun 2025 09:16:14 GMT"
    },
    {
      "title": "Straight Out of a Sci-Fi Movie: An AI Managed to Rewrite Its Own Code to Prevent Humans From Shutting It Down - The Daily Galaxy",
      "pubDate": "Sun, 01 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Meta reportedly replacing human risk assessors with AI - Mashable",
      "pubDate": "Sun, 01 Jun 2025 15:56:59 GMT"
    },
    {
      "title": "New ChatGPT Model Bypasses Shutdown Command, Raising New Safety Concerns - i-hls.com",
      "pubDate": "Sun, 01 Jun 2025 12:00:48 GMT"
    },
    {
      "title": "Experts Warn of AI’s Self-Preservation Tactics in New Tests - Men's Journal",
      "pubDate": "Mon, 02 Jun 2025 02:35:59 GMT"
    },
    {
      "title": "Delaying Artificial Intelligence The Real Existential Risk Says Joscha Bach, Scientist Says He's More Afraid That 'We Don't Build AI' - Benzinga",
      "pubDate": "Mon, 02 Jun 2025 06:51:18 GMT"
    },
    {
      "title": "NY AI safety bill picks up from Wiener’s - San Francisco Examiner",
      "pubDate": "Mon, 02 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "New Anthropic AI Models Demonstrate Coding Prowess, Behavior Risks - Campus Technology",
      "pubDate": "Mon, 02 Jun 2025 18:06:17 GMT"
    },
    {
      "title": "The hidden security risks of open source AI - Computer Weekly",
      "pubDate": "Mon, 02 Jun 2025 19:48:01 GMT"
    },
    {
      "title": "LG Electronics partners with AI Safety Research Institute to enhance AI safety - Chosunbiz",
      "pubDate": "Tue, 03 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "Will AI go rogue? Noted researcher Yoshua Bengio launches venture to keep it safe - The Globe and Mail",
      "pubDate": "Tue, 03 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Leading AI models sometimes refuse to shut down when ordered - ZME Science",
      "pubDate": "Tue, 03 Jun 2025 09:07:34 GMT"
    },
    {
      "title": "Machine learning expert launches nonprofit for AI safety - Tech in Asia",
      "pubDate": "Tue, 03 Jun 2025 08:40:00 GMT"
    },
    {
      "title": "\"Who are my safest drivers?\": Fleet managers turn to AI for safety insights - PR Newswire",
      "pubDate": "Tue, 03 Jun 2025 12:00:00 GMT"
    },
    {
      "title": "Yoshua Bengio launches LawZero, a nonprofit AI safety lab - TechCrunch",
      "pubDate": "Tue, 03 Jun 2025 17:33:49 GMT"
    },
    {
      "title": "Introducing LawZero - yoshuabengio.org",
      "pubDate": "Tue, 03 Jun 2025 10:33:27 GMT"
    },
    {
      "title": "How some Republicans changed their minds about AI safety - Platformer",
      "pubDate": "Wed, 04 Jun 2025 00:12:39 GMT"
    },
    {
      "title": "AI Godfather Is 'Deeply Concerned' About AI Dangers, Launches Safety-Focused Nonprofit LawZero - eWEEK",
      "pubDate": "Wed, 04 Jun 2025 00:39:15 GMT"
    },
    {
      "title": "The Wiretap: Trump Says Goodbye To The AI Safety Institute - Forbes",
      "pubDate": "Tue, 03 Jun 2025 22:23:33 GMT"
    },
    {
      "title": "\"Safe-by-design\"AI: Yoshua Bengio launches LawZero | Newswise - Newswise",
      "pubDate": "Wed, 04 Jun 2025 00:50:00 GMT"
    },
    {
      "title": "AI-Based Fault Detection in Offshore Oil Platforms: Enhancing Safety and Reducing Downtime - Modern Ghana",
      "pubDate": "Wed, 04 Jun 2025 05:54:46 GMT"
    },
    {
      "title": "AI pioneer launches non-profit to develop safe-by-design AI models - Euronews",
      "pubDate": "Wed, 04 Jun 2025 09:37:58 GMT"
    },
    {
      "title": "Anthropic Releases Claude 4, Their Most Powerful AI Model Yet - Blockchain Council",
      "pubDate": "Wed, 04 Jun 2025 05:37:46 GMT"
    },
    {
      "title": "Three Essentials for Agentic AI Security - MIT Sloan Management Review",
      "pubDate": "Wed, 04 Jun 2025 11:00:27 GMT"
    },
    {
      "title": "Anthropic is pulling in talent from OpenAI and DeepMind. What makes the AI ​​startup so attractive to the best engineers - dev.ua",
      "pubDate": "Wed, 04 Jun 2025 11:34:00 GMT"
    },
    {
      "title": "Trump overhauls Biden-era AI Safety Institute to create new 'Innovation Centre' - Capacity Media",
      "pubDate": "Wed, 04 Jun 2025 15:11:28 GMT"
    },
    {
      "title": "Trump admin takes 'safety' out of U.S. AI Safety Institute - Mashable",
      "pubDate": "Wed, 04 Jun 2025 16:44:30 GMT"
    },
    {
      "title": "US removes ‘safety’ from AI Safety Institute - The Verge",
      "pubDate": "Wed, 04 Jun 2025 19:39:42 GMT"
    },
    {
      "title": "Trump administration rebrands AI Safety Institute - FedScoop",
      "pubDate": "Wed, 04 Jun 2025 17:03:17 GMT"
    },
    {
      "title": "US move won't affect global AI safety institute network, South Korean official says - MLex",
      "pubDate": "Thu, 05 Jun 2025 03:26:00 GMT"
    },
    {
      "title": "Aberdeen’s Fennex secures EnQuest contract for AI safety tool - Energy Voice",
      "pubDate": "Thu, 05 Jun 2025 06:18:09 GMT"
    },
    {
      "title": "Advancing Agentic AI: Navigating opportunities and bolstering safety - TNGlobal",
      "pubDate": "Thu, 05 Jun 2025 07:23:45 GMT"
    },
    {
      "title": "Reddit sues AI giant Anthropic over content use - The New Indian Express",
      "pubDate": "Thu, 05 Jun 2025 14:34:28 GMT"
    },
    {
      "title": "Trump Administration To Rebrand Biden-Era Artificial Intelligence Safety Institute, Commerce Secretary Says At AI Honors: “We’re Not Going To Regulate It” - Deadline",
      "pubDate": "Thu, 05 Jun 2025 15:33:00 GMT"
    },
    {
      "title": "Anthropic researchers claim AI could turn humans into \"meat robots\" — obeying robot commands relayed via a camera - Windows Central",
      "pubDate": "Thu, 05 Jun 2025 10:54:53 GMT"
    },
    {
      "title": "Enhance AI security with Azure Prompt Shields and Azure AI Content Safety - Microsoft Azure",
      "pubDate": "Thu, 05 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Trump admin rebrands AI safety institute in latest oversight move - CIO Dive",
      "pubDate": "Thu, 05 Jun 2025 20:41:24 GMT"
    },
    {
      "title": "Commerce Department takes ‘safety’ out in NIST AI institute rebrand - Technical.ly",
      "pubDate": "Thu, 05 Jun 2025 17:49:00 GMT"
    },
    {
      "title": "Turing Award winner Yoshua Bengio launches AI safety lab - The Daily Star",
      "pubDate": "Fri, 06 Jun 2025 04:06:32 GMT"
    },
    {
      "title": "Securing GenAI at Scale for Observability, Guardrails, and Risk - with Leaders from ActiveFence and Barclays - Emerj Artificial Intelligence Research",
      "pubDate": "Fri, 06 Jun 2025 10:08:23 GMT"
    },
    {
      "title": "Ofcom unveils AI strategy with focus on telecoms and digital safety - Capacity Media",
      "pubDate": "Fri, 06 Jun 2025 10:22:43 GMT"
    },
    {
      "title": "‘Godfather of AI’ believes the tech is now unsafe - but he has a plan - The Independent",
      "pubDate": "Fri, 06 Jun 2025 10:58:00 GMT"
    },
    {
      "title": "Where is the AI safety movement? - NationofChange",
      "pubDate": "Fri, 06 Jun 2025 09:03:01 GMT"
    },
    {
      "title": "AI Systems Will Do Anything for Self-Preservation, Tests Show - Movieguide",
      "pubDate": "Fri, 06 Jun 2025 16:34:48 GMT"
    },
    {
      "title": "AI Safety: Beyond AI Hype To Hybrid Intelligence - Forbes",
      "pubDate": "Fri, 06 Jun 2025 20:28:14 GMT"
    },
    {
      "title": "AI Safety Institute Renamed Center for AI Standards and Innovation - Broadband Breakfast",
      "pubDate": "Fri, 06 Jun 2025 19:48:45 GMT"
    },
    {
      "title": "Anthropic Claude 4 Resorts to Blackmail for Self-Preservation - WebProNews",
      "pubDate": "Fri, 06 Jun 2025 18:54:32 GMT"
    }
  ],
  "us_politics": [
    {
      "title": "Trump gets tariff reprieve as he prepares Oval Office goodbye to Musk – US politics live - The Guardian",
      "pubDate": "Fri, 30 May 2025 09:43:00 GMT"
    },
    {
      "title": "On the anniversary of his hush money conviction, Trump continues to fight criminal case - ABC News",
      "pubDate": "Fri, 30 May 2025 09:22:30 GMT"
    },
    {
      "title": "Supreme Court Allows Trump Administration, for Now, to End Biden-Era Migrant Program - The New York Times",
      "pubDate": "Fri, 30 May 2025 14:35:37 GMT"
    },
    {
      "title": "How the GOP megabill may roll back the Affordable Care Act - Axios",
      "pubDate": "Fri, 30 May 2025 13:34:46 GMT"
    },
    {
      "title": "Supreme Court allows DHS to end parole for a half-million noncitizens - SCOTUSblog",
      "pubDate": "Fri, 30 May 2025 16:41:05 GMT"
    },
    {
      "title": "Trump Officials Unveil Budget Cuts to Aid for Health, Housing and Research - The New York Times",
      "pubDate": "Sat, 31 May 2025 02:44:17 GMT"
    },
    {
      "title": "Trump administration to prioritize ‘patriotic Americans’ for federal jobs - Politico",
      "pubDate": "Fri, 30 May 2025 21:20:58 GMT"
    },
    {
      "title": "Trump tells Congress what to chop in 22 percent budget slashing - Politico",
      "pubDate": "Fri, 30 May 2025 23:43:08 GMT"
    },
    {
      "title": "Wes Moore, Tim Walz urge for a fiercer Democratic party at famed Jim Clyburn Fish Fry - ABC News",
      "pubDate": "Sat, 31 May 2025 09:12:01 GMT"
    },
    {
      "title": "Senate Republicans Try Out ‘We All Die’ Slogan to Justify Medicaid Cuts - WhoWhatWhy",
      "pubDate": "Sat, 31 May 2025 10:35:31 GMT"
    },
    {
      "title": "Trump conducts the weirdest exit interview in history as Musk departs the White House — for now - The Independent",
      "pubDate": "Sat, 31 May 2025 10:07:00 GMT"
    },
    {
      "title": "Hamas slaps down Trump’s Gaza plan - News.com.au",
      "pubDate": "Sat, 31 May 2025 15:54:42 GMT"
    },
    {
      "title": "A Federal List of Immigrant ‘Sanctuaries’ Nets Trump Allies and Foes Alike - The New York Times",
      "pubDate": "Sat, 31 May 2025 20:33:09 GMT"
    },
    {
      "title": "House GOP passed trillions in tax cuts. How Trump's 'big bill' could change in the Senate - CNBC",
      "pubDate": "Sun, 01 Jun 2025 10:00:01 GMT"
    },
    {
      "title": "'We can't let our foot off the gas pedal': Jeffries on Dems' plan to counter 'Trump's one, big ugly bill' - CNN",
      "pubDate": "Sun, 01 Jun 2025 14:56:46 GMT"
    },
    {
      "title": "House Dems’ campaign chair says her party’s ‘on offense’ in 2026 battle to win back majority from GOP - WFIN",
      "pubDate": "Sun, 01 Jun 2025 13:55:10 GMT"
    },
    {
      "title": "Trump Aides Insist That Tariffs Will Remain, Even After Court Ruling - The New York Times",
      "pubDate": "Sun, 01 Jun 2025 18:38:20 GMT"
    },
    {
      "title": "Trump's 'Beautiful' Bill Casts a Cloud Over Hydrogen's Future - Crude Oil Prices Today | OilPrice.com",
      "pubDate": "Sun, 01 Jun 2025 21:00:00 GMT"
    },
    {
      "title": "2 states, 1 tepid view of Kamala Harris and her political future - Politico",
      "pubDate": "Sun, 01 Jun 2025 19:40:10 GMT"
    },
    {
      "title": "Country pessimistic about both parties, see democracy being tested, new poll finds - USA Today",
      "pubDate": "Sun, 01 Jun 2025 19:28:55 GMT"
    },
    {
      "title": "Trump warns court ruling against tariffs could lead to 'economic ruination' of US - Fox Business",
      "pubDate": "Mon, 02 Jun 2025 00:28:00 GMT"
    },
    {
      "title": "More Americans say neither party has strong leaders: CNN poll - The Hill",
      "pubDate": "Mon, 02 Jun 2025 00:23:00 GMT"
    },
    {
      "title": "Senate tries to pass Trump's budget plan. And, people burned in Colorado attack - NPR",
      "pubDate": "Mon, 02 Jun 2025 11:05:18 GMT"
    },
    {
      "title": "Trump's big tax bill moves ahead to potential changes in the Senate - USA Today",
      "pubDate": "Mon, 02 Jun 2025 09:06:13 GMT"
    },
    {
      "title": "Boulder attack suspect Mohammed Soliman in US illegally: Homeland Security - ABC7 Chicago",
      "pubDate": "Mon, 02 Jun 2025 13:45:52 GMT"
    },
    {
      "title": "Murphy launches ambitious anti-Trump PAC as 2028 rumors swirl - Politico",
      "pubDate": "Mon, 02 Jun 2025 08:45:00 GMT"
    },
    {
      "title": "It’s not just Medicaid: Republicans’ megabill would sabotage the Affordable Care Act - MSNBC News",
      "pubDate": "Mon, 02 Jun 2025 16:38:09 GMT"
    },
    {
      "title": "Democrats ask Supreme Court to let them defend political contribution limits - CBS News",
      "pubDate": "Mon, 02 Jun 2025 16:08:45 GMT"
    },
    {
      "title": "Man arrested over Colorado fire attack - The Economist",
      "pubDate": "Mon, 02 Jun 2025 10:49:23 GMT"
    },
    {
      "title": "Trump Administration Live Updates: President Shows No Sign of Retreat on Tariffs - The New York Times",
      "pubDate": "Mon, 02 Jun 2025 19:28:36 GMT"
    },
    {
      "title": "US judge blocks Trump from nixing union bargaining for TSA officers - Reuters",
      "pubDate": "Mon, 02 Jun 2025 19:45:07 GMT"
    },
    {
      "title": "Shhh. Republicans are trying to repeal Obamacare again. Sort of. - The Washington Post",
      "pubDate": "Mon, 02 Jun 2025 17:00:18 GMT"
    },
    {
      "title": "Live updates: Trump’s pledge to fix national debt faces skepticism from some Republicans - AP News",
      "pubDate": "Mon, 02 Jun 2025 20:53:00 GMT"
    },
    {
      "title": "Senate returns to debate Trump’s big budget bill - AP News",
      "pubDate": "Mon, 02 Jun 2025 23:35:00 GMT"
    },
    {
      "title": "Trump Attacks Rand Paul, Working to Rally G.O.P. Support for Policy Bill - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 17:32:37 GMT"
    },
    {
      "title": "Trump admin live updates: WH letter urges US trade partners to submit their 'best offer' by Wednesday - ABC News",
      "pubDate": "Tue, 03 Jun 2025 18:01:00 GMT"
    },
    {
      "title": "Elon Musk sends Republicans into chaos as he shreds one big beautiful bill - The Independent",
      "pubDate": "Tue, 03 Jun 2025 22:21:00 GMT"
    },
    {
      "title": "'We are all going to die' - Senator Joni Ernst's healthcare comment sparks row - BBC",
      "pubDate": "Tue, 03 Jun 2025 23:09:14 GMT"
    },
    {
      "title": "Judge tosses Democratic Party challenge to Trump order’s impact on FEC - Politico",
      "pubDate": "Wed, 04 Jun 2025 03:21:28 GMT"
    },
    {
      "title": "‘Saying Trump is dangerous is not enough’: Bernie Sanders on Biden, billionaires – and why the Democrats failed - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 08:03:00 GMT"
    },
    {
      "title": "A Stephen Miller Staffer and Tough Talk: Inside Trump’s Latest Attack on Harvard - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 02:50:00 GMT"
    },
    {
      "title": "Trump asks Congress to cancel funding already approved for foreign aid, public media - NPR",
      "pubDate": "Wed, 04 Jun 2025 10:54:10 GMT"
    },
    {
      "title": "House GOP gets megabill’s official price tag: $2.4T - Politico",
      "pubDate": "Wed, 04 Jun 2025 14:21:54 GMT"
    },
    {
      "title": "Marjorie Taylor Greene’s four-word dagger to Trump and GOP after Musk’s ‘Big Beautiful’ takedown - The Independent",
      "pubDate": "Wed, 04 Jun 2025 14:33:00 GMT"
    },
    {
      "title": "Trump says Putin told him Russia ‘will have to respond’ to Ukraine drone attacks – live - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 09:39:00 GMT"
    },
    {
      "title": "Some House Republicans Have Regrets After Passing Trump’s Domestic Policy Bill - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 12:45:00 GMT"
    },
    {
      "title": "Biden White House’s Karine Jean-Pierre quits Democratic party - Financial Times",
      "pubDate": "Wed, 04 Jun 2025 20:18:04 GMT"
    },
    {
      "title": "Musk, hardline US Republicans ramp up attacks on Trump tax and spending bill - Reuters",
      "pubDate": "Wed, 04 Jun 2025 21:38:26 GMT"
    },
    {
      "title": "Live updates: 10.9 million projected to lose insurance in 2034 from ‘big, beautiful’ bill - AP News",
      "pubDate": "Wed, 04 Jun 2025 22:47:00 GMT"
    },
    {
      "title": "CBO: Nearly 11 million people will be uninsured if GOP megabill becomes law - The Hill",
      "pubDate": "Wed, 04 Jun 2025 15:46:00 GMT"
    },
    {
      "title": "Senate Environment and Public Works panel releases ‘big, beautiful bill’ text - The Hill",
      "pubDate": "Wed, 04 Jun 2025 21:36:00 GMT"
    },
    {
      "title": "House Democrats question Trump in probe of Elon Musk's alleged drug use - Axios",
      "pubDate": "Thu, 05 Jun 2025 03:37:59 GMT"
    },
    {
      "title": "Fearful House Republicans Scramble to Mollify Musk - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 00:13:31 GMT"
    },
    {
      "title": "House Oversight Committee expands inquiry into Biden's mental condition and final acts in office - The Register Citizen",
      "pubDate": "Wed, 04 Jun 2025 22:13:21 GMT"
    },
    {
      "title": "Trump orders inquiry into 'conspiracy' to cover up Biden's declining cognitive health - France 24",
      "pubDate": "Thu, 05 Jun 2025 03:04:08 GMT"
    },
    {
      "title": "Donald Trump orders inquiry into Joe Biden's actions as president, alleging 'cognitive decline' - BBC",
      "pubDate": "Thu, 05 Jun 2025 05:02:52 GMT"
    },
    {
      "title": "US Senate panel passes measures on Taiwan and China’s overseas military growth - South China Morning Post",
      "pubDate": "Thu, 05 Jun 2025 18:25:18 GMT"
    },
    {
      "title": "Trump and Musk's relationship flames out just as intensely as it started - AP News",
      "pubDate": "Thu, 05 Jun 2025 21:31:00 GMT"
    },
    {
      "title": "Musk-Trump breakup puts billions in SpaceX contracts at risk, jolting US space program - Reuters",
      "pubDate": "Thu, 05 Jun 2025 21:59:19 GMT"
    },
    {
      "title": "Senate GOP eyes Medicare cuts to pay for Trump bill - The Hill",
      "pubDate": "Thu, 05 Jun 2025 22:35:00 GMT"
    },
    {
      "title": "House passes legislation requiring SBA offices to leave ‘sanctuary cities’ - Politico",
      "pubDate": "Thu, 05 Jun 2025 21:22:35 GMT"
    },
    {
      "title": "Musk says Trump is ‘in the Epstein files’ in latest dig - The Independent",
      "pubDate": "Thu, 05 Jun 2025 23:27:00 GMT"
    },
    {
      "title": "Trump and Musk Trade Threats, From Broaching Impeachment to Cutting Contracts - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 02:50:21 GMT"
    },
    {
      "title": "Nervous Republicans flee Trump-Elon Musk blast radius - NBC News",
      "pubDate": "Thu, 05 Jun 2025 23:24:55 GMT"
    },
    {
      "title": "What the Trump-Musk breakup may mean for SpaceX and Tesla - NPR",
      "pubDate": "Fri, 06 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Trump targets disadvantaged business program inspired by Atlanta - AJC.com",
      "pubDate": "Fri, 06 Jun 2025 08:51:13 GMT"
    },
    {
      "title": "Trump-Musk fallout live updates: The split has rattled US politics and markets - Reuters",
      "pubDate": "Fri, 06 Jun 2025 15:03:16 GMT"
    },
    {
      "title": "Republicans stick with Trump in wake of explosive clash with Musk - The Washington Post",
      "pubDate": "Fri, 06 Jun 2025 16:27:18 GMT"
    },
    {
      "title": "Senate Republicans revise ban on state AI regulations in bid to preserve controversial provision - ABC News",
      "pubDate": "Fri, 06 Jun 2025 18:48:56 GMT"
    },
    {
      "title": "Live updates: Trump says he has no plans to speak with Musk; Supreme Court gives DOGE access to Social Security data - NBC News",
      "pubDate": "Fri, 06 Jun 2025 23:29:12 GMT"
    },
    {
      "title": "\"He's a lunatic\": Democrats shut down idea of Musk alliance after break with Trump - Axios",
      "pubDate": "Fri, 06 Jun 2025 21:51:36 GMT"
    }
  ],
  "cryptocurrency": [
    {
      "title": "US regulator dismisses suit against Binance in latest crypto-friendly move by Trump - The Guardian",
      "pubDate": "Fri, 30 May 2025 16:54:00 GMT"
    },
    {
      "title": "SEC raises concerns over crypto ETFs offering staking rewards (BTC-USD:Cryptocurrency) - Seeking Alpha",
      "pubDate": "Sat, 31 May 2025 20:23:00 GMT"
    },
    {
      "title": "SEC Reportedly Has Qualms About Two Firms’ Crypto ETF Plans - PYMNTS.com",
      "pubDate": "Sun, 01 Jun 2025 20:01:34 GMT"
    },
    {
      "title": "Circle Is America’s First Publicly Traded Stablecoin Issuer. Now What? - PYMNTS.com",
      "pubDate": "Thu, 05 Jun 2025 23:21:28 GMT"
    },
    {
      "title": "Why Circle's ‘Super Positive’ IPO Could be Bullish for Ethereum: Analysts - Decrypt",
      "pubDate": "Fri, 06 Jun 2025 18:28:39 GMT"
    }
  ],
  "science": [
    {
      "title": "Trump administration ending multiple HIV vaccine studies, scientists and officials say - CBS News",
      "pubDate": "Fri, 30 May 2025 23:37:00 GMT"
    },
    {
      "title": "Scientists think birds may be using quantum physics and entanglement for migration - Earth.com",
      "pubDate": "Sat, 31 May 2025 11:39:07 GMT"
    },
    {
      "title": "Why Trump’s push for ‘gold-standard science’ has researchers alarmed - The Washington Post",
      "pubDate": "Sat, 31 May 2025 17:00:00 GMT"
    },
    {
      "title": "Scientists find the most intense explosion ever seen in the universe - The Independent",
      "pubDate": "Thu, 05 Jun 2025 20:00:00 GMT"
    }
  ],
  "renewable_energy": [
    {
      "title": "Energy Dept. Cancels $3.7 Billion for New Technologies to Lower Emissions - The New York Times",
      "pubDate": "Fri, 30 May 2025 20:02:15 GMT"
    },
    {
      "title": "Scientists make game-changing breakthrough that could unlock low-cost energy source: 'Our work delivers promising guidelines' - The Cool Down",
      "pubDate": "Sat, 31 May 2025 05:45:00 GMT"
    },
    {
      "title": "China unveils the Solar Great Wall: 400 km and 180,000 kWh to power the country - ECOticias.com El Periódico Verde",
      "pubDate": "Sun, 01 Jun 2025 11:50:12 GMT"
    },
    {
      "title": "China launches world’s first grid-forming sodium-ion battery storage plant - pv magazine International",
      "pubDate": "Tue, 03 Jun 2025 14:48:07 GMT"
    },
    {
      "title": "Global energy investment set to hit record $3.3 trillion in 2025, IEA says - Reuters",
      "pubDate": "Thu, 05 Jun 2025 04:02:00 GMT"
    }
  ],
  "spacex": [
    {
      "title": "Elon Musk says SpaceX will decommission Dragon spacecraft after Trump threat - CNBC",
      "pubDate": "Thu, 05 Jun 2025 20:16:13 GMT"
    },
    {
      "title": "Musk says SpaceX will retire Dragon spacecraft amid bitter Trump dispute - The Guardian",
      "pubDate": "Fri, 06 Jun 2025 02:23:00 GMT"
    }
  ],
  "earthquakes": [
    {
      "title": "Massive volcano eruption is imminent amid earthquake surge, leaving major US city on high alert, scientists fear - New York Post",
      "pubDate": "Fri, 30 May 2025 14:20:00 GMT"
    },
    {
      "title": "Over 100 inmates escape from a Pakistan prison after an earthquake evacuation in Karachi - ABC News",
      "pubDate": "Tue, 03 Jun 2025 06:49:57 GMT"
    },
    {
      "title": "Turkey-Greece earthquake latest: One dead and 70 injured after 5.8-magnitude quake - The Independent",
      "pubDate": "Wed, 04 Jun 2025 03:38:00 GMT"
    }
  ],
  "bitcoin": [
    {
      "title": "BlackRock’s $70 Billion Bitcoin Price Nightmare Just Got A Lot Worse - Forbes",
      "pubDate": "Fri, 30 May 2025 11:30:14 GMT"
    },
    {
      "title": "Czech Justice Minister Resigns Over $45 Million Gift in Bitcoin - Bloomberg",
      "pubDate": "Fri, 30 May 2025 15:31:02 GMT"
    },
    {
      "title": "Bitcoin Price, XRP Fall. The House Just Introduced a New Crypto Bill. - Barron's",
      "pubDate": "Fri, 30 May 2025 12:08:00 GMT"
    },
    {
      "title": "Bitcoin Suddenly Braced For $7 Trillion ‘Critical’ Price Tipping Point After Stark BlackRock Warning - Forbes",
      "pubDate": "Sun, 01 Jun 2025 11:41:00 GMT"
    },
    {
      "title": "'Existential Crisis': Bitcoin Quantum Computing Threat Is Fast Approaching, Experts Say - Decrypt",
      "pubDate": "Tue, 03 Jun 2025 22:33:07 GMT"
    },
    {
      "title": "Bitcoin Has Hit an All-Time High of $112,000. 3 Reasons the Leading Cryptocurrency Is Surging. - Yahoo Finance",
      "pubDate": "Thu, 05 Jun 2025 09:15:00 GMT"
    },
    {
      "title": "Bitcoin ‘Going To Take Over’—Tesla CEO Elon Musk Backs Shock $40 Trillion U.S. Dollar Collapse Warning Amid Price Boom - Forbes",
      "pubDate": "Thu, 05 Jun 2025 11:54:00 GMT"
    }
  ],
  "cybersecurity": [
    {
      "title": "Cyberattacks Surge in 2025: Data Analysts Urged to Bolster Privacy with PETs and NSA-CISA AI Security Guidelines - WebProNews",
      "pubDate": "Sun, 01 Jun 2025 13:13:32 GMT"
    },
    {
      "title": "Analysis of AI Tools Shows 85 Percent Have Been Breached - Security Today",
      "pubDate": "Mon, 02 Jun 2025 07:24:58 GMT"
    },
    {
      "title": "Trump’s CISA budget lays out deep job cuts, program reductions - Cybersecurity Dive",
      "pubDate": "Mon, 02 Jun 2025 15:02:39 GMT"
    },
    {
      "title": "Chinese Hacked US Telecom a Year Before Known Wireless Breaches - Bloomberg",
      "pubDate": "Wed, 04 Jun 2025 20:16:13 GMT"
    },
    {
      "title": "Trump revokes digital identity actions in new cyber executive order - Federal News Network",
      "pubDate": "Fri, 06 Jun 2025 22:57:47 GMT"
    }
  ],
  "elon_musk": [
    {
      "title": "Musk whips opposition to Trump tax plan: 'KILL the BILL' - CNBC",
      "pubDate": "Wed, 04 Jun 2025 19:57:05 GMT"
    },
    {
      "title": "Musk swiftly backpedals after declaring amid Trump feud that SpaceX will start decommissioning Dragon - Fox Business",
      "pubDate": "Fri, 06 Jun 2025 10:01:00 GMT"
    },
    {
      "title": "Tesla already had big problems. Then Musk went to battle with Trump - CNBC",
      "pubDate": "Fri, 06 Jun 2025 22:44:06 GMT"
    },
    {
      "title": "Caught in Trump-Musk crossfire: Tesla stock sinks amid feud; $380bn wiped out — among 2025's biggest loss - Times of India",
      "pubDate": "Sat, 07 Jun 2025 03:32:00 GMT"
    }
  ],
  "global_health": [
    {
      "title": "New study reveals widespread malnutrition in infants under six months - News-Medical",
      "pubDate": "Sat, 31 May 2025 02:50:00 GMT"
    },
    {
      "title": "U.S. Skips Historic WHO Pandemic Treaty Vote - Minnesota Spokesman-Recorder",
      "pubDate": "Sat, 31 May 2025 06:09:00 GMT"
    },
    {
      "title": "Global momentum on primary health care: Time to unite - World Health Organization (WHO)",
      "pubDate": "Wed, 04 Jun 2025 14:25:05 GMT"
    }
  ],
  "large_language_model": [
    {
      "title": "Google Releases LMEval, an Open-Source Cross-Provider LLM Evaluation Tool - infoq.com",
      "pubDate": "Sat, 31 May 2025 15:00:13 GMT"
    },
    {
      "title": "BBC and Sky bosses criticise plans to let AI firms use copyrighted material - The Guardian",
      "pubDate": "Wed, 04 Jun 2025 13:35:00 GMT"
    }
  ],
  "astronomy": [
    {
      "title": "Scientists capture sharpest-ever view of the sun's outer atmosphere - NBC News",
      "pubDate": "Sat, 31 May 2025 02:19:51 GMT"
    },
    {
      "title": "Scientists discover 'Super-Earth' planet that could provide answer for finding extraterrestrial life - LADbible",
      "pubDate": "Wed, 04 Jun 2025 19:55:38 GMT"
    },
    {
      "title": "Astronomers discover most powerful cosmic explosions since the Big Bang - Space",
      "pubDate": "Thu, 05 Jun 2025 15:24:12 GMT"
    }
  ],
  "federal_reserve": [
    {
      "title": "Powell defends Federal Reserve independence during Trump meeting - NBC News",
      "pubDate": "Fri, 30 May 2025 12:00:48 GMT"
    },
    {
      "title": "Federal Reserve Chairman Powell: The Status of American Universities is Hard-Won - Binance",
      "pubDate": "Sun, 01 Jun 2025 16:36:20 GMT"
    },
    {
      "title": "Federal Reserve Sheds Light On Possible 2025 Rate Cuts - Finimize",
      "pubDate": "Mon, 02 Jun 2025 00:00:07 GMT"
    },
    {
      "title": "The Federal Reserve’s difficult coming months - Financial Times",
      "pubDate": "Mon, 02 Jun 2025 04:00:13 GMT"
    },
    {
      "title": "Federal Reserve Disbands Climate-Focused Internal Groups - The National Law Review",
      "pubDate": "Mon, 02 Jun 2025 14:41:06 GMT"
    },
    {
      "title": "A rate cut debate is heating up inside the Fed - Yahoo Finance",
      "pubDate": "Mon, 02 Jun 2025 18:28:52 GMT"
    },
    {
      "title": "Federal Reserve lifts Wells Fargo’s asset cap - Financial Times",
      "pubDate": "Tue, 03 Jun 2025 20:33:37 GMT"
    },
    {
      "title": "Fed Listens - June 4, 2025 - Federal Reserve Bank of Atlanta",
      "pubDate": "Wed, 04 Jun 2025 12:35:58 GMT"
    },
    {
      "title": "Senate confirms Bowman as Fed supervision czar - Banking Dive",
      "pubDate": "Thu, 05 Jun 2025 12:53:22 GMT"
    },
    {
      "title": "Top Federal Reserve official promises major overhaul of US bank regulation - Financial Times",
      "pubDate": "Fri, 06 Jun 2025 17:07:56 GMT"
    },
    {
      "title": "Fed should cut interest rate by a full point, Trump says - Reuters",
      "pubDate": "Fri, 06 Jun 2025 15:38:37 GMT"
    }
  ],
  "vladimir_putin": [
    {
      "title": "Russia Accused of Staging Attack on Putin's Helicopter - Newsweek",
      "pubDate": "Sat, 31 May 2025 14:53:47 GMT"
    },
    {
      "title": "Three years into his war on Ukraine, what does Putin really want? - NPR",
      "pubDate": "Sun, 01 Jun 2025 19:50:36 GMT"
    }
  ],
  "fbi": [
    {
      "title": "FBI: $5,000 reward for info leading to the arrest of Chicago bank robbery suspect - WGN-TV",
      "pubDate": "Mon, 02 Jun 2025 22:30:02 GMT"
    },
    {
      "title": "FBI says Palm Springs bombing suspects used AI chat program to help plan attack - CNBC",
      "pubDate": "Wed, 04 Jun 2025 21:58:54 GMT"
    },
    {
      "title": "FBI, DHS warn of 'elevated threat' to Jewish community in new PSA - ABC News",
      "pubDate": "Fri, 06 Jun 2025 14:48:45 GMT"
    }
  ],
  "republican_party": [
    {
      "title": "Loan plan in Republican bill could worsen doctor shortage, experts warn - The Guardian",
      "pubDate": "Sun, 01 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Why stricter voting laws no longer help Republicans - The Economist",
      "pubDate": "Sun, 01 Jun 2025 09:55:56 GMT"
    },
    {
      "title": "Musk turns on Republicans - and gives Trump's bill a harder path - BBC",
      "pubDate": "Wed, 04 Jun 2025 20:13:50 GMT"
    },
    {
      "title": "The Polling on Elon Musk Is a Warning for Republicans - Politico",
      "pubDate": "Fri, 06 Jun 2025 22:30:00 GMT"
    }
  ],
  "public_health": [
    {
      "title": "Deep cuts erode the foundations of US public health system, end progress, threaten worse to come - AP News",
      "pubDate": "Sat, 31 May 2025 15:03:00 GMT"
    },
    {
      "title": "A new COVID-19 variant, vaccine changes: What to know in 2025 - USA Today",
      "pubDate": "Wed, 04 Jun 2025 21:02:15 GMT"
    }
  ],
  "cybersecurity_and_infrastructure_security_agency": [
    {
      "title": "Trump Budget Plan to Cut Nearly 1000 Jobs at Cyber Agency CISA - Infosecurity Magazine",
      "pubDate": "Tue, 03 Jun 2025 13:45:00 GMT"
    },
    {
      "title": "Agencies issue advisory on updated tactics by Play ransomware group - American Hospital Association",
      "pubDate": "Thu, 05 Jun 2025 20:08:51 GMT"
    }
  ],
  "drones": [
    {
      "title": "How cheap combat drones are reshaping the Russia-Ukraine war - Phys.org",
      "pubDate": "Fri, 30 May 2025 16:05:47 GMT"
    },
    {
      "title": "Video: Putin’s Cheap Russian Drone DESTROYS Trump’s $3 Million M2 Bradley Tank In Just 16 Seconds - Times of India",
      "pubDate": "Sun, 01 Jun 2025 01:49:53 GMT"
    },
    {
      "title": "‘Impunity Is Over’: Ukraine’s SBU Drone Blitz Destroys 41 Russian Bombers in Deep Strike - Kyiv Post",
      "pubDate": "Sun, 01 Jun 2025 17:48:45 GMT"
    },
    {
      "title": "Drone Attacks Are the New Front in War. Can NATO Keep Up? - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 09:03:36 GMT"
    },
    {
      "title": "Trump signs orders to bolster US drone defenses, boost supersonic flight - Reuters",
      "pubDate": "Fri, 06 Jun 2025 22:01:54 GMT"
    }
  ],
  "us_supreme_court": [
    {
      "title": "Supreme Court allows Trump to strip humanitarian parole of 500,000 people from 4 countries - PBS",
      "pubDate": "Fri, 30 May 2025 14:43:07 GMT"
    },
    {
      "title": "US Supreme Court lets Trump revoke humanitarian legal status for migrants - Reuters",
      "pubDate": "Fri, 30 May 2025 20:49:19 GMT"
    },
    {
      "title": "The Supreme Court just gave 500,000 immigrants some truly awful news - vox.com",
      "pubDate": "Fri, 30 May 2025 16:35:00 GMT"
    },
    {
      "title": "Supreme Court says Trump for now can revoke immigration parole for 530K migrants - The Washington Post",
      "pubDate": "Sat, 31 May 2025 04:22:47 GMT"
    },
    {
      "title": "Trump's birthright citizenship order to face first US appeals court review - Reuters",
      "pubDate": "Wed, 04 Jun 2025 10:10:56 GMT"
    }
  ],
  "asteroids": [
    {
      "title": "Researchers predict 3 city-destroying asteroids could hit Earth with 1,000,000 times more force than Hiroshima bomb - UNILAD",
      "pubDate": "Fri, 30 May 2025 11:14:47 GMT"
    },
    {
      "title": "Scientists Fear a Passing Star Could Fling Earth Out of the Sun's Orbit, Into the Frigid Expanse Beyond - futurism.com",
      "pubDate": "Sat, 31 May 2025 13:00:27 GMT"
    },
    {
      "title": "NASA warns! 120-foot asteroid 2025 KX8 to make close approach to Earth on June 4; here’s what to expect - Times of India",
      "pubDate": "Mon, 02 Jun 2025 07:17:00 GMT"
    },
    {
      "title": "Asteroid Larger Than Golden Gate Bridge Approaches Earth In Rare Event - Forbes",
      "pubDate": "Tue, 03 Jun 2025 10:00:00 GMT"
    }
  ],
  "alexandria_ocasio-cortez": [
    {
      "title": "AOC Viewed Positively by More Americans Than Trump and Harris—Poll - Newsweek",
      "pubDate": "Sat, 31 May 2025 22:31:49 GMT"
    },
    {
      "title": "AOC takes victory lap as Trump-Elon nuclear breakup confirms everything she and Bernie Sanders warned - The Independent",
      "pubDate": "Fri, 06 Jun 2025 16:43:00 GMT"
    }
  ],
  "space_exploration": [
    {
      "title": "China's Rover Moves On Mars - MSN",
      "pubDate": "Wed, 04 Jun 2025 20:02:31 GMT"
    }
  ],
  "fusion_power": [
    {
      "title": "China’s tokamak nuclear reactor smashes global fusion record - The Brighter Side of News",
      "pubDate": "Sat, 31 May 2025 00:07:00 GMT"
    },
    {
      "title": "Exclusive: Fusion energy developer TAE raises $150M - Axios",
      "pubDate": "Mon, 02 Jun 2025 12:51:44 GMT"
    },
    {
      "title": "Scientists solve a massive problem for fusion energy - The Brighter Side of News",
      "pubDate": "Mon, 02 Jun 2025 14:07:00 GMT"
    },
    {
      "title": "Nuclear fusion record smashed as German scientists take 'a significant step forward' to near-limitless clean energy - Live Science",
      "pubDate": "Thu, 05 Jun 2025 13:52:42 GMT"
    }
  ],
  "brics": [
    {
      "title": "Russia aims to ride the BRICS to AI victory - Defense One",
      "pubDate": "Thu, 05 Jun 2025 18:57:14 GMT"
    },
    {
      "title": "BRICS Nations Accelerate Shift Away From U.S. Dollar in Global Trade - AgWeb",
      "pubDate": "Thu, 05 Jun 2025 20:17:00 GMT"
    }
  ],
  "health_care": [
    {
      "title": "Emergency physician protests healthcare cuts by sitting on State House steps for 25 hours - WJAR",
      "pubDate": "Sat, 31 May 2025 21:37:36 GMT"
    },
    {
      "title": "Millions Would Lose Their Obamacare Coverage Under Trump’s Bill - The New York Times",
      "pubDate": "Thu, 05 Jun 2025 09:03:51 GMT"
    }
  ],
  "outer_space": [
    {
      "title": "North Korea slams Trump’s Golden Dome as plan for ‘outer space nuclear war’ - NK News",
      "pubDate": "Fri, 30 May 2025 07:27:17 GMT"
    }
  ],
  "central_intelligence_agency": [
    {
      "title": "US intelligence employee arrested for alleged double-dealing of classified info - CyberScoop",
      "pubDate": "Fri, 30 May 2025 19:21:50 GMT"
    }
  ],
  "nasa": [
    {
      "title": "NASA budget would cancel dozens of science missions, lay off thousands - SpaceNews",
      "pubDate": "Fri, 30 May 2025 23:00:21 GMT"
    },
    {
      "title": "A leaderless NASA faces its biggest-ever cuts - The Economist",
      "pubDate": "Wed, 04 Jun 2025 16:32:32 GMT"
    },
    {
      "title": "Senate Republicans Seek to Protect NASA Programs Targeted for Cuts - WSJ",
      "pubDate": "Thu, 05 Jun 2025 23:20:00 GMT"
    },
    {
      "title": "How NASA Would Struggle Without SpaceX if Trump Cancels Musk’s Contracts - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 02:12:35 GMT"
    }
  ],
  "electric_battery": [
    {
      "title": "Scientists Are Sinking Concrete Batteries Underwater. An Energy Revolution Is Coming. - Popular Mechanics",
      "pubDate": "Fri, 30 May 2025 22:07:00 GMT"
    },
    {
      "title": "Scientists created a battery that lasts 5,700 years without needing to be recharged - Earth.com",
      "pubDate": "Mon, 02 Jun 2025 16:04:32 GMT"
    }
  ],
  "world_news": [
    {
      "title": "Gaza ‘hungriest place on Earth’, all its people at risk of famine, UN warns - Al Jazeera",
      "pubDate": "Sat, 31 May 2025 09:34:01 GMT"
    },
    {
      "title": "US-backed Gaza aid group halts distribution, UN to vote on ceasefire demand - Reuters",
      "pubDate": "Wed, 04 Jun 2025 08:43:17 GMT"
    }
  ],
  "national_security": [
    {
      "title": "Global threat report reveals Trump’s strategic priorities - Arab News",
      "pubDate": "Sat, 31 May 2025 18:18:45 GMT"
    },
    {
      "title": "Army estimates that Trump's military parade could cost $16 million in damage to Washington streets - NBC News",
      "pubDate": "Sat, 31 May 2025 16:49:58 GMT"
    }
  ],
  "earth": [
    {
      "title": "Scientists find that major Earth systems are on the verge of total collapse - Earth.com",
      "pubDate": "Sun, 01 Jun 2025 01:06:50 GMT"
    }
  ],
  "ethereum": [
    {
      "title": "SEC casts doubt on REX‑Osprey bid to launch staking Ethereum, Solana ETFs - The Block",
      "pubDate": "Sat, 31 May 2025 21:45:53 GMT"
    }
  ],
  "atmosphere": [
    {
      "title": "An Extreme Drop in Oxygen Will Eventually Suffocate Most Life on Earth - ScienceAlert",
      "pubDate": "Sun, 01 Jun 2025 23:22:38 GMT"
    }
  ],
  "hurricanes": [
    {
      "title": "Hurricane Season Is Starting. Here’s Everything to Know. - The New York Times",
      "pubDate": "Sun, 01 Jun 2025 18:01:01 GMT"
    },
    {
      "title": "Acting head of FEMA said he wasn't aware U.S. has a hurricane season, sources say - CBS News",
      "pubDate": "Tue, 03 Jun 2025 02:19:44 GMT"
    },
    {
      "title": "PAHO calls on countries to prepare health systems amid forecasts of a very active 2025 hurricane season - Pan American Health Organization (PAHO)",
      "pubDate": "Mon, 02 Jun 2025 21:00:04 GMT"
    },
    {
      "title": "Acting FEMA Chief Told Staff He Didn’t Know About U.S. Hurricane Season - The New York Times",
      "pubDate": "Tue, 03 Jun 2025 16:33:00 GMT"
    }
  ],
  "poland": [
    {
      "title": "Poles vote in pivotal presidential election - NBC News",
      "pubDate": "Sun, 01 Jun 2025 20:18:18 GMT"
    }
  ],
  "health": [
    {
      "title": "Scientists say these small health issues might be an early sign of lung cancer - The Independent",
      "pubDate": "Mon, 02 Jun 2025 05:26:00 GMT"
    }
  ],
  "data_science": [
    {
      "title": "Scientists Create Framework for Analyzing Metabolic Data To Predict Disease Risk - Technology Networks",
      "pubDate": "Mon, 02 Jun 2025 15:35:15 GMT"
    }
  ],
  "earth_science": [
    {
      "title": "Scientists Crack Mystery of Earth’s Smallest Dunes - SciTechDaily",
      "pubDate": "Mon, 02 Jun 2025 22:51:48 GMT"
    }
  ],
  "ancient_history": [
    {
      "title": "'Incredible' ancient footprints discovery could rewrite human history - Daily Express",
      "pubDate": "Tue, 03 Jun 2025 10:19:00 GMT"
    }
  ],
  "wind_power": [
    {
      "title": "US onshore wind installations continue despite Trump in Q1 – American Clean Power Association - Wind Power Monthly",
      "pubDate": "Tue, 03 Jun 2025 09:21:32 GMT"
    }
  ],
  "research": [
    {
      "title": "The Gutting of America’s Medical Research: Here Is Every Canceled or Delayed N.I.H. Grant - The New York Times",
      "pubDate": "Wed, 04 Jun 2025 04:33:48 GMT"
    }
  ],
  "google": [
    {
      "title": "Google quietly pushes emergency fix for Chrome 0-day as exploit runs wild - theregister.com",
      "pubDate": "Tue, 03 Jun 2025 19:23:00 GMT"
    }
  ],
  "atlantic_ocean": [
    {
      "title": "Record-breaking sargassum invasion in Atlantic, Caribbean threatens to foul beach resorts - New York Post",
      "pubDate": "Wed, 04 Jun 2025 06:56:00 GMT"
    }
  ],
  "artificial_general_intelligence": [
    {
      "title": "OpenAI CEO Sam Altman describes his vision of the perfect AI - Windows Central",
      "pubDate": "Wed, 04 Jun 2025 09:41:26 GMT"
    }
  ],
  "world_politics": [
    {
      "title": "Fourteen nations vote for Israel, Hamas ceasefire at UNSC, US vetoes - The Jerusalem Post",
      "pubDate": "Wed, 04 Jun 2025 20:35:00 GMT"
    },
    {
      "title": "US vetoes UN Security Council resolution calling for Gaza ceasefire - The Times of Israel",
      "pubDate": "Wed, 04 Jun 2025 23:51:32 GMT"
    },
    {
      "title": "Trump-Musk meltdown gets Europe gloating - politico.eu",
      "pubDate": "Fri, 06 Jun 2025 03:03:00 GMT"
    }
  ],
  "oceans": [
    {
      "title": "Marine heatwave found to have engulfed area of ocean five times the size of Australia - The Guardian",
      "pubDate": "Thu, 05 Jun 2025 04:08:00 GMT"
    }
  ],
  "us_congress": [
    {
      "title": "US Congress budget office sees economic output falling from Trump tariffs - Reuters",
      "pubDate": "Wed, 04 Jun 2025 20:20:11 GMT"
    }
  ],
  "amazon": [
    {
      "title": "Amazon planning $10B investment in North Carolina for data center and AI campus - AP News",
      "pubDate": "Thu, 05 Jun 2025 01:06:00 GMT"
    }
  ],
  "hacking": [
    {
      "title": "China offers cash rewards for hackers it says are Taiwanese military - Reuters",
      "pubDate": "Thu, 05 Jun 2025 11:28:52 GMT"
    }
  ],
  "defense_intelligence_agency": [
    {
      "title": "US intelligence worker arrested for ‘trying to leak secrets to Germany’ - The Times",
      "pubDate": "Thu, 05 Jun 2025 21:30:00 GMT"
    }
  ],
  "openai": [
    {
      "title": "OpenAI Says Significant Number of Recent ChatGPT Misuses Likely Came From China - WSJ",
      "pubDate": "Thu, 05 Jun 2025 19:18:00 GMT"
    }
  ],
  "taxes": [
    {
      "title": "Here are taxes that Trump's 'big, beautiful bill' would repeal - ABC News",
      "pubDate": "Thu, 05 Jun 2025 18:22:30 GMT"
    }
  ],
  "tesla": [
    {
      "title": "Tesla shares hit as Trump-Musk feud explodes - BBC",
      "pubDate": "Thu, 05 Jun 2025 21:46:09 GMT"
    }
  ],
  "data_breach": [
    {
      "title": "Urgent warning issued for US consumers after security breach of 184,000,000 passwords — here’s who’s exposed - Yahoo",
      "pubDate": "Thu, 05 Jun 2025 21:01:00 GMT"
    }
  ],
  "\"health_care\"": [
    {
      "title": "Why millions of Americans would lose health insurance under House GOP megabill - CNBC",
      "pubDate": "Fri, 06 Jun 2025 11:32:48 GMT"
    }
  ],
  "\"donald_trump\"": [
    {
      "title": "Xi’s Message to Trump: Rein in the Hawks Trying to Derail the Truce - The New York Times",
      "pubDate": "Fri, 06 Jun 2025 10:32:18 GMT"
    }
  ],
  "\"recession\"": [
    {
      "title": "Germany could face two more years of recession if US trade war escalates, warns Bundesbank - The Economic Times",
      "pubDate": "Fri, 06 Jun 2025 10:21:16 GMT"
    }
  ],
  "\"ukraine\"": [
    {
      "title": "Russia launches 'massive' strikes days after Ukrainian drone attack - BBC",
      "pubDate": "Fri, 06 Jun 2025 10:20:12 GMT"
    }
  ],
  "\"artificial_intelligence\"": [
    {
      "title": "Development and validation of an autonomous artificial intelligence agent for clinical decision-making in oncology - Nature",
      "pubDate": "Fri, 06 Jun 2025 10:08:02 GMT"
    }
  ],
  "\"climate_engineering\"": [
    {
      "title": "US Researcher Proposes Detonating Massive Nuclear Bomb Under Ocean To Save Earth - NDTV",
      "pubDate": "Fri, 06 Jun 2025 05:55:22 GMT"
    }
  ],
  "\"china\"": [
    {
      "title": "The world could be facing another ‘China shock,’ but it comes with a silver-lining - CNBC",
      "pubDate": "Fri, 06 Jun 2025 05:23:21 GMT"
    }
  ]
}