{
  "israel": [
    {
      "title": "LIVE: Israel kills over 70 in Gaza as 549 killed seeking aid in past month - Al Jazeera",
      "pubDate": "Fri, 27 Jun 2025 05:06:04 GMT"
    },
    {
      "title": "‘The stars aligned’: Why Israel set out for a war against Iran, and what it achieved - The Times of Israel",
      "pubDate": "Fri, 27 Jun 2025 06:11:15 GMT"
    },
    {
      "title": "LIVE: Israel draws condemnation for Gaza aid site killings - Al Jazeera",
      "pubDate": "Fri, 27 Jun 2025 14:53:37 GMT"
    },
    {
      "title": "Israel strikes Lebanon in one of biggest attacks since November ceasefire - The Washington Post",
      "pubDate": "Sat, 28 Jun 2025 02:37:26 GMT"
    },
    {
      "title": "Live updates: Iran to hold state funeral for officials killed by Israeli strikes - CNN",
      "pubDate": "Sat, 28 Jun 2025 11:10:00 GMT"
    },
    {
      "title": "Updates: Israel kills 60 in Gaza, medics search for survivors in al-Tuffah - Al Jazeera",
      "pubDate": "Sat, 28 Jun 2025 20:20:34 GMT"
    },
    {
      "title": "At least 66 children dead of malnutrition in Gaza as Israel tightens siege - Al Jazeera",
      "pubDate": "Sun, 29 Jun 2025 01:18:45 GMT"
    },
    {
      "title": "Tens of thousands flee Gaza City after Israel warns of major offensive - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 17:29:00 GMT"
    },
    {
      "title": "Israeli strike on Iranian prison killed more than 70, says Iran state-affiliated media - CNN",
      "pubDate": "Sun, 29 Jun 2025 12:51:00 GMT"
    },
    {
      "title": "Israel’s Attack on Evin Prison Killed 71, Iranian State Media Report - The New York Times",
      "pubDate": "Mon, 30 Jun 2025 06:01:00 GMT"
    },
    {
      "title": "Israel in ‘advanced talks’ for deal to end hostilities with Syria, says senior official - The Times of Israel",
      "pubDate": "Mon, 30 Jun 2025 14:24:11 GMT"
    },
    {
      "title": "Israel eyes ties with Syria and Lebanon after Iran war - Reuters",
      "pubDate": "Mon, 30 Jun 2025 12:01:46 GMT"
    },
    {
      "title": "Israel acknowledges Palestinian civilians harmed at Gaza aid sites, says 'lessons learned' - Reuters",
      "pubDate": "Mon, 30 Jun 2025 18:09:51 GMT"
    },
    {
      "title": "Israeli strike on cafe near Gaza City port kills dozens, hospital official says - CNN",
      "pubDate": "Tue, 01 Jul 2025 00:04:00 GMT"
    },
    {
      "title": "Israel’s Netanyahu Says He Will Meet With Trump Next Week - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 12:19:18 GMT"
    },
    {
      "title": "Israel’s 12-day war with Iran was a test of technological dominance - The Times of Israel",
      "pubDate": "Tue, 01 Jul 2025 18:37:00 GMT"
    },
    {
      "title": "LIVE: Over 30 Palestinians killed as Trump says Israel agrees to Gaza truce - Al Jazeera",
      "pubDate": "Wed, 02 Jul 2025 08:15:00 GMT"
    },
    {
      "title": "Israel kills more than 300 Palestinians in 48 hours as ceasefire in balance - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 06:53:34 GMT"
    }
  ],
  "iran": [
    {
      "title": "US gained nothing from strikes, Iran's supreme leader says - BBC",
      "pubDate": "Thu, 26 Jun 2025 21:18:31 GMT"
    },
    {
      "title": "Secrets on Iran nuclear strike spill into open as Pentagon defends bombing - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Thu, 26 Jun 2025 21:26:57 GMT"
    },
    {
      "title": "Obliterated? Damaged? Inoperable? What's known about Iran's nuclear facilities - NPR",
      "pubDate": "Thu, 26 Jun 2025 22:06:56 GMT"
    },
    {
      "title": "Iran's hackers keep a low profile after Israeli and US strikes - Reuters",
      "pubDate": "Fri, 27 Jun 2025 10:07:41 GMT"
    },
    {
      "title": "Israel-Iran live updates: Trump says he would bomb Iran again 'without a question' - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Fri, 27 Jun 2025 16:46:00 GMT"
    },
    {
      "title": "After U.S. and Israeli Strikes, Could Iran Make a Nuclear Bomb? - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 20:40:53 GMT"
    },
    {
      "title": "A week of shifting descriptions of Iran attack spark ongoing questions about extent of damage and goals - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Sat, 28 Jun 2025 18:45:08 GMT"
    },
    {
      "title": "Iran crackdown deepens with speedy executions and arrests - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Sat, 28 Jun 2025 23:37:30 GMT"
    },
    {
      "title": "Iran holds first state funerals for military leaders, nuclear scientists killed in Israeli strikes - CBS News",
      "pubDate": "Sat, 28 Jun 2025 23:15:30 GMT"
    },
    {
      "title": "Iran will likely be able to produce enriched uranium ‘in a matter of months’, IAEA chief says - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 01:06:00 GMT"
    },
    {
      "title": "Iran could begin enriching uranium again in months, says UN nuclear watchdog chief - Sky News",
      "pubDate": "Sun, 29 Jun 2025 12:49:18 GMT"
    },
    {
      "title": "Iran says 71 killed in Israeli strike on Evin Prison - Reuters",
      "pubDate": "Sun, 29 Jun 2025 15:16:47 GMT"
    },
    {
      "title": "U.N. Inspector Says Iran Could Enrich Nuclear Fuel in ‘Matter of Months’ - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 20:33:13 GMT"
    },
    {
      "title": "CIA chief says strike on metal conversion site set Iran nuclear program back by years - The Times of Israel",
      "pubDate": "Mon, 30 Jun 2025 03:38:10 GMT"
    },
    {
      "title": "Over 1,500 Explosion-induced Earthquakes Recorded Amid 12-day US-Israeli Strikes On Iran - Iran Front Page - Iran Front Page",
      "pubDate": "Mon, 30 Jun 2025 06:55:07 GMT"
    },
    {
      "title": "CIA: US strikes set Iran's nuclear program back years - Українські Національні Новини",
      "pubDate": "Mon, 30 Jun 2025 03:01:25 GMT"
    },
    {
      "title": "Satellite imagery reveals ongoing work at Iranian nuclear site bombed by US - CNN",
      "pubDate": "Mon, 30 Jun 2025 19:26:00 GMT"
    },
    {
      "title": "Iran: More than 900 killed in war with Israel - The Hill",
      "pubDate": "Mon, 30 Jun 2025 21:44:00 GMT"
    },
    {
      "title": "Fordo Nuclear Site Work Taking Place in Iran, Satellate Images Show - The New York Times",
      "pubDate": "Mon, 30 Jun 2025 18:23:45 GMT"
    },
    {
      "title": "Iran assesses the damage and lashes out after Israeli and US strikes damage its nuclear sites - AP News",
      "pubDate": "Tue, 01 Jul 2025 12:26:00 GMT"
    },
    {
      "title": "Iranian authorities make sweeping arrests in wake of war with Israel - The Washington Post",
      "pubDate": "Tue, 01 Jul 2025 19:17:15 GMT"
    },
    {
      "title": "Iran Suspends Cooperation With U.N. Nuclear Watchdog - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 11:51:22 GMT"
    },
    {
      "title": "After US and Israeli strikes, some nuclear experts say Iran could be more dangerous - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Wed, 02 Jul 2025 23:22:38 GMT"
    },
    {
      "title": "Pentagon Again Shifts Assessment of Damage to Iran’s Nuclear Program - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 22:51:46 GMT"
    },
    {
      "title": "US says its strikes degraded Iran’s nuclear programme by one to two years - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 01:02:15 GMT"
    }
  ],
  "donald_trump": [
    {
      "title": "Live updates: Senate receives classified briefing after Pentagon says Iran strikes went as planned - CNN",
      "pubDate": "Thu, 26 Jun 2025 22:17:00 GMT"
    },
    {
      "title": "Trump claims Iran’s nuclear program has been ‘obliterated.’ Senate Republicans aren’t entirely convinced. - Politico",
      "pubDate": "Thu, 26 Jun 2025 23:02:46 GMT"
    },
    {
      "title": "Trump Threatens to Sue The Times and CNN Over Iran Reporting - The New York Times",
      "pubDate": "Thu, 26 Jun 2025 21:09:47 GMT"
    },
    {
      "title": "Trump tariffs: Nike says US trade policies could cost it $1bn - BBC",
      "pubDate": "Fri, 27 Jun 2025 01:38:03 GMT"
    },
    {
      "title": "Trump pushes for passage of his massive tax and immigration bill - The Washington Post",
      "pubDate": "Fri, 27 Jun 2025 03:00:00 GMT"
    },
    {
      "title": "Donald Trump says US-China trade truce has been ‘signed’ - Financial Times",
      "pubDate": "Thu, 26 Jun 2025 23:53:21 GMT"
    },
    {
      "title": "Trump hosts event to rally Republicans behind his megabill - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Thu, 26 Jun 2025 23:14:48 GMT"
    },
    {
      "title": "Trump administration officials brief senators on U.S. strikes in Iran; Defense Secretary Hegseth criticizes media - NBC News",
      "pubDate": "Fri, 27 Jun 2025 02:04:00 GMT"
    },
    {
      "title": "Outrage as Trump compares Iran strikes to Japan atomic bombing - BBC",
      "pubDate": "Fri, 27 Jun 2025 06:50:07 GMT"
    },
    {
      "title": "Trump’s vow to ‘save’ Netanyahu from his corruption trial unnerves some Israelis - PBS",
      "pubDate": "Thu, 26 Jun 2025 22:59:19 GMT"
    },
    {
      "title": "Trump administration eliminating warning period for fining those in the US illegally: Exclusive - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Fri, 27 Jun 2025 09:10:50 GMT"
    },
    {
      "title": "US Senate Republicans seek agreement on Trump tax-cut, spending bill - Reuters",
      "pubDate": "Fri, 27 Jun 2025 10:28:59 GMT"
    },
    {
      "title": "US supreme court expected to rule on birthright citizenship and other outstanding cases on last day of term – live updates - The Guardian",
      "pubDate": "Fri, 27 Jun 2025 09:58:00 GMT"
    },
    {
      "title": "Another mysterious anti-Trump sculpture appears on the National Mall - The Washington Post",
      "pubDate": "Fri, 27 Jun 2025 06:16:30 GMT"
    },
    {
      "title": "Trump approval underwater, voters say US is on wrong track: Poll - The Hill",
      "pubDate": "Fri, 27 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Supreme Court curbs injunctions that blocked Trump's birthright citizenship plan - NBC News",
      "pubDate": "Fri, 27 Jun 2025 14:13:49 GMT"
    },
    {
      "title": "Supreme Court hands Trump major win, limits judges’ ability to block birthright citizenship order nationwide - Politico",
      "pubDate": "Fri, 27 Jun 2025 14:15:34 GMT"
    },
    {
      "title": "Trump hails 'win' as Supreme Court curbs judges' power to block his orders - live updates - BBC",
      "pubDate": "Fri, 27 Jun 2025 15:11:15 GMT"
    },
    {
      "title": "Supreme Court limits ability of judges to stop Trump - CNN",
      "pubDate": "Fri, 27 Jun 2025 16:47:00 GMT"
    },
    {
      "title": "Trump says supreme court limiting judges’ powers is ‘monumental victory’ as liberal justices dissent – live - The Guardian",
      "pubDate": "Fri, 27 Jun 2025 09:58:00 GMT"
    },
    {
      "title": "Trump terminates trade talks with Canada - NBC News",
      "pubDate": "Fri, 27 Jun 2025 20:04:33 GMT"
    },
    {
      "title": "Trump Eyes Cuts to Top Spy Agency as He Downplays Iran Intel - Bloomberg",
      "pubDate": "Fri, 27 Jun 2025 18:44:32 GMT"
    },
    {
      "title": "Trump shrugs off July tariff deadline: 'We can do whatever we want' - CNBC",
      "pubDate": "Fri, 27 Jun 2025 20:06:33 GMT"
    },
    {
      "title": "Trump Says U.S. Ending Trade Talks With Canada Over Digital Services Taxes - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 22:51:47 GMT"
    },
    {
      "title": "Trump administration exploring $30 billion civilian nuclear deal for Iran - NBC News",
      "pubDate": "Sat, 28 Jun 2025 02:16:00 GMT"
    },
    {
      "title": "What is birthright citizenship and what happens after the Supreme Court ruling? - NPR",
      "pubDate": "Sat, 28 Jun 2025 00:29:14 GMT"
    },
    {
      "title": "Trump news at a glance: president boasts of ‘monumental’ win after supreme court curtails power of federal judges - The Guardian",
      "pubDate": "Sat, 28 Jun 2025 00:30:16 GMT"
    },
    {
      "title": "WATCH: Trump says U.S. approved observers must inspect Iran’s nuclear program, would bomb again - PBS",
      "pubDate": "Fri, 27 Jun 2025 20:01:21 GMT"
    },
    {
      "title": "Trump says he would consider bombing Iran again, drops sanctions relief plan - Reuters",
      "pubDate": "Fri, 27 Jun 2025 22:58:15 GMT"
    },
    {
      "title": "Trump says he'll expect next Fed chair to cut rates - Axios",
      "pubDate": "Sat, 28 Jun 2025 03:49:54 GMT"
    },
    {
      "title": "A fourth judge has blocked a Trump executive order targeting elite law firms - NPR",
      "pubDate": "Fri, 27 Jun 2025 23:36:21 GMT"
    },
    {
      "title": "Donald Trump Suffers Major Legal Blow: 'Grave Constitutional Violations' - Newsweek",
      "pubDate": "Sat, 28 Jun 2025 09:02:31 GMT"
    },
    {
      "title": "Trump victorious again as US Supreme Court wraps up its term - Reuters",
      "pubDate": "Sat, 28 Jun 2025 05:06:29 GMT"
    },
    {
      "title": "Trump pushes Thune to crack down on wind and solar in megabill - Politico",
      "pubDate": "Sat, 28 Jun 2025 02:37:31 GMT"
    },
    {
      "title": "Trump denies reports US looking at $30B nuclear deal with Iran: ‘These people are SICK’ - The Hill",
      "pubDate": "Sat, 28 Jun 2025 12:29:00 GMT"
    },
    {
      "title": "Trump halts trade talks with Canada, defending interests of U.S. tech firms - The Washington Post",
      "pubDate": "Sat, 28 Jun 2025 03:44:13 GMT"
    },
    {
      "title": "Trump says U.S. will cease trade negotiations with Canada - Axios",
      "pubDate": "Sat, 28 Jun 2025 12:07:14 GMT"
    },
    {
      "title": "Trump wins as Supreme Court curbs judges, but may yet lose on birthright citizenship - Reuters",
      "pubDate": "Sat, 28 Jun 2025 10:07:54 GMT"
    },
    {
      "title": "Trump on a high after 'tremendous' wins at home and abroad - BBC",
      "pubDate": "Sat, 28 Jun 2025 13:48:38 GMT"
    },
    {
      "title": "Trump Issues Blistering Response After Iran Threatens U.S. - Time Magazine",
      "pubDate": "Sat, 28 Jun 2025 17:13:22 GMT"
    },
    {
      "title": "Trump says he will move aggressively to undo nationwide blocks on his agenda - The Washington Post",
      "pubDate": "Sat, 28 Jun 2025 20:30:18 GMT"
    },
    {
      "title": "Elon Musk slams Trump's megabill just as Senate prepares to hold critical vote - USA Today",
      "pubDate": "Sat, 28 Jun 2025 20:40:37 GMT"
    },
    {
      "title": "Live updates: Senate Republicans seek to advance Donald Trump megabill; Dems dig heels in - The Hill",
      "pubDate": "Sat, 28 Jun 2025 21:48:00 GMT"
    },
    {
      "title": "Senate begins vote to open debate on Trump’s spending bill — with support still unclear - CNN",
      "pubDate": "Sat, 28 Jun 2025 23:39:00 GMT"
    },
    {
      "title": "Trump torches Fed, Biden – calls debanking ‘very dangerous’ for U.S. economy - InsuranceNewsNet",
      "pubDate": "Sat, 28 Jun 2025 14:08:14 GMT"
    },
    {
      "title": "Trump threatens Tillis with primary challenge - Politico",
      "pubDate": "Sun, 29 Jun 2025 02:25:46 GMT"
    },
    {
      "title": "Trump's 'big, beautiful bill' clears key Senate hurdle after high drama - CNBC",
      "pubDate": "Sun, 29 Jun 2025 03:22:00 GMT"
    },
    {
      "title": "Senate votes to move forward on Trump’s ‘big, beautiful bill,’ though measure’s fate remains in question - CNN",
      "pubDate": "Sun, 29 Jun 2025 04:03:00 GMT"
    },
    {
      "title": "Elon Musk renews his criticism of Trump’s big bill as Senate Republicans scramble to pass it - AP News",
      "pubDate": "Sun, 29 Jun 2025 03:38:00 GMT"
    },
    {
      "title": "Trump slams Israel's prosecutors over Netanyahu corruption trial - Reuters",
      "pubDate": "Sun, 29 Jun 2025 05:24:00 GMT"
    },
    {
      "title": "Trump Urges Israel-Gaza Ceasefire: 'Make the Deal' - Newsweek",
      "pubDate": "Sun, 29 Jun 2025 06:58:34 GMT"
    },
    {
      "title": "Senate Republicans advance Trump's tax and spending cuts bill after dramatic late-night vote - AP News",
      "pubDate": "Sun, 29 Jun 2025 04:56:00 GMT"
    },
    {
      "title": "Trump calls for Gaza deal, slams Netanyahu trial - NPR",
      "pubDate": "Sun, 29 Jun 2025 09:09:24 GMT"
    },
    {
      "title": "Trump agenda survives key Senate vote but final outcome still uncertain - USA Today",
      "pubDate": "Sun, 29 Jun 2025 03:45:00 GMT"
    },
    {
      "title": "Trump Is Wrong About Birthright Citizenship. History Proves It. - Politico",
      "pubDate": "Sun, 29 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Big Trump wins, boomerang appeals define Supreme Court term - CNN",
      "pubDate": "Sun, 29 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "Republicans race to meet Trump’s July 4 deadline for agenda bill - CNN",
      "pubDate": "Sun, 29 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Senate advances massive bill for Trump's agenda after GOP leaders sway holdouts - NBC News",
      "pubDate": "Sun, 29 Jun 2025 16:01:00 GMT"
    },
    {
      "title": "Trump threatens to cut off New York City funds if Mamdani ‘doesn’t behave’ - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 17:30:00 GMT"
    },
    {
      "title": "Musk Reignites Feud, Labels Trump Bill 'Insane, Destructive' - Time Magazine",
      "pubDate": "Sun, 29 Jun 2025 17:22:43 GMT"
    },
    {
      "title": "Republican Sen. Thom Tillis will not seek reelection next year after Trump attacks - NPR",
      "pubDate": "Sun, 29 Jun 2025 19:12:00 GMT"
    },
    {
      "title": "Trump reiterates Iran nuclear talking points despite swirling questions - Al Jazeera",
      "pubDate": "Sun, 29 Jun 2025 17:39:50 GMT"
    },
    {
      "title": "Trump suggests he’ll target journalists to find out who leaked negative report on Iran strikes - New York Post",
      "pubDate": "Sun, 29 Jun 2025 14:38:00 GMT"
    },
    {
      "title": "It took 16 hours to read Trump’s 940-page, foot-high bill aloud. Now the long debate begins - AP News",
      "pubDate": "Sun, 29 Jun 2025 21:50:00 GMT"
    },
    {
      "title": "Bitcoin (BTC) Price Climbs After Trump Tells GOP Not to Worry About Deficit Spending - CoinDesk",
      "pubDate": "Sun, 29 Jun 2025 22:53:44 GMT"
    },
    {
      "title": "Debate is underway in the Senate on Trump’s big bill. It may go all night - AP News",
      "pubDate": "Mon, 30 Jun 2025 00:58:00 GMT"
    },
    {
      "title": "Trump news at a glance: president pushes Republicans to back big bill amid forecast losses to healthcare - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 02:05:11 GMT"
    },
    {
      "title": "WATCH LIVE: Senate debates Trump’s budget package after reading full text of 940-page bill - PBS",
      "pubDate": "Sun, 29 Jun 2025 16:50:59 GMT"
    },
    {
      "title": "Trump aims to change the nation and further cement his power as deadline looms for ‘big, beautiful bill’ - CNN",
      "pubDate": "Mon, 30 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "Intercepted call of Iranian officials downplays damage of U.S. attack - The Washington Post",
      "pubDate": "Mon, 30 Jun 2025 00:48:38 GMT"
    },
    {
      "title": "Trump says ‘getting along well’ with China, downplays ‘aggressive’ acts - South China Morning Post",
      "pubDate": "Sun, 29 Jun 2025 22:38:13 GMT"
    },
    {
      "title": "Trump admin live updates: Senate to begin 'One Big Beautiful Bill' vote-a-rama Monday - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Mon, 30 Jun 2025 07:32:00 GMT"
    },
    {
      "title": "Treasury yields tick lower as Trump's spending bill in focus - CNBC",
      "pubDate": "Mon, 30 Jun 2025 08:15:37 GMT"
    },
    {
      "title": "Senate GOP looks to pass marathon final test on Trump’s ‘big, beautiful bill’ - The Hill",
      "pubDate": "Mon, 30 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Trump Calls for Israel-Hamas Ceasefire - Time Magazine",
      "pubDate": "Mon, 30 Jun 2025 10:58:47 GMT"
    },
    {
      "title": "Trump-Fueled Bitcoin Mania Leaves Most of Crypto in the Dust - Bloomberg.com",
      "pubDate": "Mon, 30 Jun 2025 07:42:12 GMT"
    },
    {
      "title": "Opinion | The real reason Republicans are rushing to pass the Trump megabill - MSNBC News",
      "pubDate": "Mon, 30 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Senate Democrat: GOP budget math ‘as fake as Donald Trump’s tan’ - The Hill",
      "pubDate": "Mon, 30 Jun 2025 13:29:00 GMT"
    },
    {
      "title": "Trump’s ‘Big’ Policy Bill Threatens U.S. Clean Energy Future - Council on Foreign Relations",
      "pubDate": "Mon, 30 Jun 2025 15:14:07 GMT"
    },
    {
      "title": "Senate inches toward a vote on Trump’s sweeping domestic policy bill - CNN",
      "pubDate": "Mon, 30 Jun 2025 16:01:00 GMT"
    },
    {
      "title": "Live updates: White House urges GOP to ‘stay tough’ as Senate debates amendments to Trump’s bill - The Washington Post",
      "pubDate": "Mon, 30 Jun 2025 17:39:48 GMT"
    },
    {
      "title": "Live updates: Congress sprints to pass Trump’s big bill before July 4 deadline - AP News",
      "pubDate": "Mon, 30 Jun 2025 18:27:00 GMT"
    },
    {
      "title": "Trump expected to sign executive order to lift some sanctions on Syria - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 18:44:00 GMT"
    },
    {
      "title": "Murdoch Paper Warns: Trump Just Put His Own Presidency at Risk - The Daily Beast",
      "pubDate": "Mon, 30 Jun 2025 12:06:00 GMT"
    },
    {
      "title": "Musk threatens to primary members of Congress who vote for Trump's megabill - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Mon, 30 Jun 2025 20:57:39 GMT"
    },
    {
      "title": "Trump drops lawsuit against Iowa pollster Ann Selzer, Des Moines Register - NBC News",
      "pubDate": "Mon, 30 Jun 2025 22:00:30 GMT"
    },
    {
      "title": "Trump Insults America—Again - The Atlantic",
      "pubDate": "Mon, 30 Jun 2025 21:52:00 GMT"
    },
    {
      "title": "Elon Musk vows campaigns against every Republican who votes for Trump’s agenda - The Independent",
      "pubDate": "Mon, 30 Jun 2025 22:30:00 GMT"
    },
    {
      "title": "Trump blames AT&T for tech issues in a call, AT&T says its network did not cause disruption - Reuters",
      "pubDate": "Tue, 01 Jul 2025 00:43:00 GMT"
    },
    {
      "title": "Musk vows to punish lawmakers who back Trump's spending bill - Reuters",
      "pubDate": "Mon, 30 Jun 2025 22:42:32 GMT"
    },
    {
      "title": "Senate plods along as Republicans negotiate key portions of Trump's bill: Live updates - USA Today",
      "pubDate": "Tue, 01 Jul 2025 02:35:14 GMT"
    },
    {
      "title": "Iran-linked hackers threaten to release Trump aides' emails - Reuters",
      "pubDate": "Tue, 01 Jul 2025 03:31:00 GMT"
    },
    {
      "title": "Trump complains about US-Japan trade talks as Bessent warns of higher tariffs - Reuters",
      "pubDate": "Tue, 01 Jul 2025 03:46:00 GMT"
    },
    {
      "title": "Musk shreds Trump's tax bill as 'DEBT SLAVERY,' vows to unseat Republicans who back it - CNBC",
      "pubDate": "Mon, 30 Jun 2025 20:38:58 GMT"
    },
    {
      "title": "Trump's \"Head Back To South Africa\" Threat Gets A Dare From Musk - NDTV",
      "pubDate": "Tue, 01 Jul 2025 07:09:59 GMT"
    },
    {
      "title": "Trump admin live updates: Trump hits back after Musk criticizes megabill - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Tue, 01 Jul 2025 08:42:16 GMT"
    },
    {
      "title": "Trump threatens Japan with new tariffs, claiming it won’t buy America’s rice - CNN",
      "pubDate": "Tue, 01 Jul 2025 03:40:00 GMT"
    },
    {
      "title": "Trump threatens Musk’s subsidies and contracts in latest social media spat - politico.eu",
      "pubDate": "Tue, 01 Jul 2025 10:06:10 GMT"
    },
    {
      "title": "Trump suggests slashing Tesla subsidies, Musk says 'cut it all' - Reuters",
      "pubDate": "Tue, 01 Jul 2025 12:12:34 GMT"
    },
    {
      "title": "Live updates: Trump expresses hope Senate could pass his massive legislation today - The Washington Post",
      "pubDate": "Tue, 01 Jul 2025 13:38:40 GMT"
    },
    {
      "title": "Trump wavers on July 4 megabill deadline - Politico",
      "pubDate": "Tue, 01 Jul 2025 13:56:28 GMT"
    },
    {
      "title": "Live updates: Thune says Republicans close to clinching deal to pass Trump’s legislative package - The Washington Post",
      "pubDate": "Tue, 01 Jul 2025 15:08:40 GMT"
    },
    {
      "title": "Trump escalates feud with Musk, threatens Tesla, SpaceX support - Reuters",
      "pubDate": "Tue, 01 Jul 2025 15:58:54 GMT"
    },
    {
      "title": "Live updates: Senate passes GOP bill after marathon vote; Trump visits 'Alligator Alcatraz' and feuds with Elon Musk - NBC News",
      "pubDate": "Tue, 01 Jul 2025 17:32:24 GMT"
    },
    {
      "title": "Trump threatens to arrest Mamdani if he doesn't cooperate with ICE - Axios",
      "pubDate": "Tue, 01 Jul 2025 17:49:22 GMT"
    },
    {
      "title": "Live updates: Senate passes Trump’s agenda bill after marathon voting session | CNN Politics - CNN",
      "pubDate": "Tue, 01 Jul 2025 20:41:00 GMT"
    },
    {
      "title": "Trump says DOGE 'might have to go back and eat' Elon Musk after his criticism of the GOP bill - NBC News",
      "pubDate": "Tue, 01 Jul 2025 15:30:16 GMT"
    },
    {
      "title": "Trump tours 'Alligator Alcatraz,' a day before its first arrivals are expected - NPR",
      "pubDate": "Tue, 01 Jul 2025 12:47:21 GMT"
    },
    {
      "title": "Trump seizes on ‘moral character’ loophole as way to revoke citizenship - The Guardian",
      "pubDate": "Tue, 01 Jul 2025 15:00:00 GMT"
    },
    {
      "title": "Trump says Israel has agreed to conditions for Gaza ceasefire; Hamas hasn't responded - CBS News",
      "pubDate": "Tue, 01 Jul 2025 22:56:47 GMT"
    },
    {
      "title": "Trump falsely questions Zohran Mamdani's citizenship, threatens to arrest him over ICE operations - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Tue, 01 Jul 2025 20:15:00 GMT"
    },
    {
      "title": "Trump says he will 'have a lot of fun' with Zohran Mamdani if he's elected New York mayor - USA Today",
      "pubDate": "Tue, 01 Jul 2025 16:01:55 GMT"
    },
    {
      "title": "Trump Falsely Claims Mamdani Is an Illegal Immigrant and Threatens to Arrest Him - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 23:14:39 GMT"
    },
    {
      "title": "Trump again brings up the idea of deporting US citizens for crimes - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Tue, 01 Jul 2025 20:55:05 GMT"
    },
    {
      "title": "Trump news at a glance: a senator quits, the ‘big beautiful bill’ loses its name – but senate still passes Trump’s megabill - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 02:55:54 GMT"
    },
    {
      "title": "Trump threatens to arrest anti-Israel New York City mayoral candidate Mamdani - The Times of Israel",
      "pubDate": "Tue, 01 Jul 2025 20:39:00 GMT"
    },
    {
      "title": "DOGE eats Musk? Billionaire entrepreneur's companies at risk as he reignites feud with Trump - AP News",
      "pubDate": "Tue, 01 Jul 2025 20:35:00 GMT"
    },
    {
      "title": "Donald Trump threatens Japan with tariff up to 35% as deadline looms - BBC",
      "pubDate": "Wed, 02 Jul 2025 04:33:45 GMT"
    },
    {
      "title": "Trump says US could reach trade deal with India, casts doubt on deal with Japan - Reuters",
      "pubDate": "Wed, 02 Jul 2025 03:42:00 GMT"
    },
    {
      "title": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 05:34:31 GMT"
    },
    {
      "title": "Live updates: House GOP set to tackle Senate’s work on Trump megabill - The Hill",
      "pubDate": "Wed, 02 Jul 2025 12:36:00 GMT"
    },
    {
      "title": "Live updates: House leaders scramble to secure GOP votes to pass Trump’s bill ahead of July 4 - The Washington Post",
      "pubDate": "Wed, 02 Jul 2025 14:17:01 GMT"
    },
    {
      "title": "Trump announces Vietnam trade deal, 20% tariff on its imports to U.S. - CNBC",
      "pubDate": "Wed, 02 Jul 2025 14:31:10 GMT"
    },
    {
      "title": "Trump asks Supreme Court to permit firings on consumer safety board - Politico",
      "pubDate": "Wed, 02 Jul 2025 17:08:00 GMT"
    },
    {
      "title": "Trump announces Vietnam trade deal, says US given ‘total access’ to their markets - Fox Business",
      "pubDate": "Wed, 02 Jul 2025 15:33:00 GMT"
    },
    {
      "title": "Donald Trump live: ‘One Big Beautiful Bill’ to face tight vote in US House - Al Jazeera",
      "pubDate": "Wed, 02 Jul 2025 19:32:39 GMT"
    },
    {
      "title": "Live updates: House in limbo on vote over Trump's sweeping tax bill package - USA Today",
      "pubDate": "Wed, 02 Jul 2025 19:53:47 GMT"
    },
    {
      "title": "Live updates: Trump-backed ‘big beautiful’ bill moves to House after Senate Republicans make changes - NBC News",
      "pubDate": "Wed, 02 Jul 2025 21:40:17 GMT"
    },
    {
      "title": "Trump begins summer on a hot streak - The Hill",
      "pubDate": "Wed, 02 Jul 2025 22:00:00 GMT"
    },
    {
      "title": "Trump Is Using a July 4 Deadline as a Tool to Pass His Policy Bill - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 22:46:46 GMT"
    },
    {
      "title": "Inside Trump’s Charm Offensive as He Woos Holdout Republicans - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 23:37:50 GMT"
    },
    {
      "title": "Trump’s Finances Were Shaky. Then He Began to Capitalize on His Comeback. - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 20:42:55 GMT"
    },
    {
      "title": "Trump says Powell should resign ‘immediately’ in latest attack on Fed chair - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 02:31:02 GMT"
    },
    {
      "title": "Trump's budget bill: Here are the sticking points as House holdouts stall spending plan - BBC",
      "pubDate": "Thu, 03 Jul 2025 00:05:41 GMT"
    },
    {
      "title": "Trump's budget bill: House tests support in crucial vote - BBC",
      "pubDate": "Thu, 03 Jul 2025 00:05:41 GMT"
    },
    {
      "title": "Trump’s tax and spending megabill is bad news for New York hospitals, officials say - Gothamist",
      "pubDate": "Wed, 02 Jul 2025 22:40:00 GMT"
    },
    {
      "title": "Trump Policy Bill Stalls as Johnson Works to Wear Down G.O.P. Resistance - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 06:01:41 GMT"
    },
    {
      "title": "Trump speaks with GOP holdouts blocking his megabill in early-morning call - The Hill",
      "pubDate": "Thu, 03 Jul 2025 06:08:00 GMT"
    },
    {
      "title": "Trump says he will put 20% tariff on Vietnam's exports - Reuters",
      "pubDate": "Thu, 03 Jul 2025 07:22:12 GMT"
    },
    {
      "title": "Live updates: House advances Trump agenda bill, setting up a final vote - NBC News",
      "pubDate": "Thu, 03 Jul 2025 08:21:43 GMT"
    },
    {
      "title": "Trump's mega-bill heads for final vote in overnight US House session - BBC",
      "pubDate": "Thu, 03 Jul 2025 09:24:47 GMT"
    },
    {
      "title": "Trump Wants the World to Squeeze Out China. He’s Starting With Vietnam. - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 12:46:28 GMT"
    },
    {
      "title": "Live updates: Trump agenda bill moves closer to passage; Hakeem Jeffries slams Republicans in hourslong speech - NBC News",
      "pubDate": "Thu, 03 Jul 2025 13:15:00 GMT"
    },
    {
      "title": "Live updates: Jeffries delays an inevitable vote on Trump's big bill with hours-long protest speech - AP News",
      "pubDate": "Thu, 03 Jul 2025 15:42:00 GMT"
    },
    {
      "title": "House Republicans expected to pass Trump's massive tax and policy bill by July 4 - NPR",
      "pubDate": "Thu, 03 Jul 2025 09:28:09 GMT"
    },
    {
      "title": "Jeffries uses ‘magic minute’ as part of resistance plan against Trump tax bill - USA Today",
      "pubDate": "Thu, 03 Jul 2025 16:20:07 GMT"
    },
    {
      "title": "Live updates: House passes Trump’s signature bill, sending it to the president’s desk - AP News",
      "pubDate": "Thu, 03 Jul 2025 18:43:00 GMT"
    },
    {
      "title": "Live updates: House passes Trump's mega bill, securing a big win for the GOP agenda - USA Today",
      "pubDate": "Thu, 03 Jul 2025 18:39:24 GMT"
    },
    {
      "title": "Supreme Court lets Trump admin deport men detained in shipping container for 6 weeks to South Sudan - Politico",
      "pubDate": "Thu, 03 Jul 2025 21:12:00 GMT"
    },
    {
      "title": "Major win for Trump as Congress passes 'big, beautiful bill' - BBC",
      "pubDate": "Thu, 03 Jul 2025 21:41:13 GMT"
    },
    {
      "title": "Live updates: Trump plans to sign the tax bill Friday after House passage - The Washington Post",
      "pubDate": "Thu, 03 Jul 2025 23:11:59 GMT"
    },
    {
      "title": "Trump Scores Big Victory As 'One Big Beautiful Bill' Clears Congress - NDTV",
      "pubDate": "Thu, 03 Jul 2025 18:44:14 GMT"
    },
    {
      "title": "Trump signs executive order calling for foreign tourists to pay higher national park fees - CBS News",
      "pubDate": "Fri, 04 Jul 2025 01:45:00 GMT"
    },
    {
      "title": "July 3, 2025 - Congress passes Trump’s sweeping domestic policy bill - CNN",
      "pubDate": "Fri, 04 Jul 2025 02:33:00 GMT"
    },
    {
      "title": "Trump kicks off 4 July celebrating tax-and-spending bill and promising UFC fight at White House - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 04:17:00 GMT"
    },
    {
      "title": "Trump eyes simple tariff rates over complex talks, says letters going out Friday - Reuters",
      "pubDate": "Fri, 04 Jul 2025 04:33:00 GMT"
    },
    {
      "title": "Donald Trump tightens grip on power with ‘big beautiful’ policy triumph - Financial Times",
      "pubDate": "Fri, 04 Jul 2025 04:00:47 GMT"
    },
    {
      "title": "Trump shows his dominance over Congress in passing the 'big, beautiful bill' - NBC News",
      "pubDate": "Fri, 04 Jul 2025 09:00:00 GMT"
    },
    {
      "title": "Trump ignored GOP warnings to gamble on a politically risky bill - The Washington Post",
      "pubDate": "Fri, 04 Jul 2025 03:58:46 GMT"
    },
    {
      "title": "Trump says he is about to raise tariffs as high as 70% on some countries - CNN",
      "pubDate": "Fri, 04 Jul 2025 12:56:00 GMT"
    },
    {
      "title": "Inside the 24 hours that Trump willed his agenda bill over the finish line - CNN",
      "pubDate": "Fri, 04 Jul 2025 11:09:00 GMT"
    },
    {
      "title": "Trump expects Hamas decision on ‘final’ peace proposal in hours - The Hill",
      "pubDate": "Fri, 04 Jul 2025 14:14:00 GMT"
    },
    {
      "title": "Trump Administration Live Updates: President to Sign Sweeping Domestic Policy Bill Into Law - The New York Times",
      "pubDate": "Fri, 04 Jul 2025 16:05:02 GMT"
    },
    {
      "title": "Trump to sign tax-cut and spending bill in July 4 ceremony - Reuters",
      "pubDate": "Fri, 04 Jul 2025 16:40:11 GMT"
    },
    {
      "title": "Trump to sign his huge tax and spending bill into law - BBC",
      "pubDate": "Fri, 04 Jul 2025 16:59:09 GMT"
    },
    {
      "title": "Trump threatens 17% tariffs on food and farm produce exports from Europe - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 18:50:00 GMT"
    }
  ],
  "russia": [
    {
      "title": "Putin cannot attend BRICS summit in Brazil as he fears arrest for war crimes - Atlantic Council",
      "pubDate": "Thu, 26 Jun 2025 20:53:00 GMT"
    },
    {
      "title": "European companies shipping critical missile parts to Russia, Zelensky tells EU. - The Kyiv Independent",
      "pubDate": "Thu, 26 Jun 2025 23:59:04 GMT"
    },
    {
      "title": "Russia launches over 370 drones and missiles in fresh barrage - TVP World",
      "pubDate": "Fri, 27 Jun 2025 10:43:00 GMT"
    },
    {
      "title": "'Alarms went off everywhere' — Explosions reported in Moscow, Russia claims 50 Ukrainian drones downed across country - The Kyiv Independent",
      "pubDate": "Fri, 27 Jun 2025 10:40:24 GMT"
    },
    {
      "title": "Putin says Russia is ready to hold more talks with Ukraine, return more bodies - Reuters",
      "pubDate": "Fri, 27 Jun 2025 14:49:59 GMT"
    },
    {
      "title": "Putin confirms he wants all of Ukraine, as Europe steps up military aid - Al Jazeera",
      "pubDate": "Fri, 27 Jun 2025 15:56:15 GMT"
    },
    {
      "title": "Married couple killed in Russian drone strike on Odesa high-rise - The Kyiv Independent",
      "pubDate": "Sat, 28 Jun 2025 04:59:32 GMT"
    },
    {
      "title": "Russia revives obsolete T-62 tanks amid equipment shortages, Ukraine's intel claims - The Kyiv Independent",
      "pubDate": "Sat, 28 Jun 2025 12:06:08 GMT"
    },
    {
      "title": "Russian scientists develop model to extend battery lifespan - TV BRICS",
      "pubDate": "Sat, 28 Jun 2025 13:03:33 GMT"
    },
    {
      "title": "Russia Launches Largest Air Assault on Ukraine Since War Began - Newsweek",
      "pubDate": "Sun, 29 Jun 2025 07:35:45 GMT"
    },
    {
      "title": "Russia launches record aerial attack on Ukraine - NPR",
      "pubDate": "Sun, 29 Jun 2025 11:54:23 GMT"
    },
    {
      "title": "Ukraine war briefing: key eastern Ukrainian city under assault as Russia hails cooperation with North Korea - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 06:48:00 GMT"
    },
    {
      "title": "Russia Fires 60 Missiles, 477 Drones and Decoys - Newser",
      "pubDate": "Sun, 29 Jun 2025 20:50:00 GMT"
    },
    {
      "title": "Moscow's Top Spy Dials CIA After Russia's 500+ Missile Attack On Ukraine; Zelensky Sidelined? - Times of India",
      "pubDate": "Sun, 29 Jun 2025 16:53:37 GMT"
    },
    {
      "title": "Russia says NATO spending increase may lead to the collapse of alliance - Reuters",
      "pubDate": "Mon, 30 Jun 2025 07:34:58 GMT"
    },
    {
      "title": "Russia grooms Ukrainian teens as spies and saboteurs - Financial Times",
      "pubDate": "Mon, 30 Jun 2025 04:00:01 GMT"
    },
    {
      "title": "Russia reportedly closes Crimean Bridge amid explosions in Kerch - The Kyiv Independent",
      "pubDate": "Mon, 30 Jun 2025 07:08:18 GMT"
    },
    {
      "title": "Russia-Iran alliance wavers as Tehran suffers major blows - The Kyiv Independent",
      "pubDate": "Mon, 30 Jun 2025 17:50:28 GMT"
    },
    {
      "title": "Russia Predicts Why NATO Will Collapse - Newsweek",
      "pubDate": "Mon, 30 Jun 2025 12:08:33 GMT"
    },
    {
      "title": "Russia Summons Azerbaijani Envoy as Tensions Flare Over Arrests - Bloomberg",
      "pubDate": "Mon, 30 Jun 2025 15:17:08 GMT"
    },
    {
      "title": "Russia says Moscow now occupies all of Ukraine’s Luhansk region, illegally annexed in 2022 - AP News",
      "pubDate": "Mon, 30 Jun 2025 20:29:00 GMT"
    },
    {
      "title": "Russia takes full control of Ukraine's Luhansk region, Russian-backed official says - Reuters",
      "pubDate": "Tue, 01 Jul 2025 06:07:00 GMT"
    },
    {
      "title": "Kim Jong Un Honors North Korean Soldiers Killed Fighting for Russia - The Moscow Times",
      "pubDate": "Tue, 01 Jul 2025 08:12:00 GMT"
    },
    {
      "title": "Russia launched record 5,438 drones at Ukraine in June alone - Euronews.com",
      "pubDate": "Tue, 01 Jul 2025 08:43:37 GMT"
    },
    {
      "title": "Macron and Putin Discuss Iran and Ukraine in Rare Call - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 21:07:50 GMT"
    },
    {
      "title": "Putin, Macron discuss Iran, Ukraine in first phone call in nearly three years - Reuters",
      "pubDate": "Tue, 01 Jul 2025 19:30:35 GMT"
    },
    {
      "title": "Ukrainian drone hits weapons plant 800 miles deep in Russia, killing at least 3 - New York Post",
      "pubDate": "Tue, 01 Jul 2025 21:44:00 GMT"
    },
    {
      "title": "Lack of New U.S. Sanctions Allows Russia to Replenish Its War Chest - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 04:01:05 GMT"
    },
    {
      "title": "C.I.A. Says Its Leaders Rushed Report on Russia Interference in 2016 Vote - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 21:09:43 GMT"
    },
    {
      "title": "New CIA report criticizes investigation into Russia's support for Trump in 2016 - KCRA",
      "pubDate": "Wed, 02 Jul 2025 21:41:00 GMT"
    },
    {
      "title": "CIA review of 2016 Russia election probe finds no major flaws - Politico",
      "pubDate": "Thu, 03 Jul 2025 01:14:00 GMT"
    },
    {
      "title": "Russia says it controls Luhansk as US halts some weapons pledged to Ukraine - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 06:00:50 GMT"
    },
    {
      "title": "Chechnya’s Strongman Is Visibly Ailing. The Russian Region Is Bracing for Succession. - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 04:01:06 GMT"
    },
    {
      "title": "Russia poses growing military threat to NATO members, Italy says - Reuters",
      "pubDate": "Thu, 03 Jul 2025 08:11:19 GMT"
    },
    {
      "title": "Ukraine kills deputy chief of Putin’s navy - politico.eu",
      "pubDate": "Thu, 03 Jul 2025 13:21:00 GMT"
    },
    {
      "title": "Putin insisted Russia ‘will not step back from goals’ in Ukraine in hour-long call to Trump, Kremlin says – Europe live - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 07:43:00 GMT"
    },
    {
      "title": "Russia ‘will not back down’ on Ukraine war goals, Putin tells Trump - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 18:24:56 GMT"
    },
    {
      "title": "Russian Offensive Campaign Assessment, July 3, 2025 - Institute for the Study of War",
      "pubDate": "Fri, 04 Jul 2025 00:27:45 GMT"
    },
    {
      "title": "Russia Sends Pantsir-S1 Air Defense System to North Korea and Trains Military Personnel in Pyongyang - MSN",
      "pubDate": "Thu, 03 Jul 2025 21:01:55 GMT"
    },
    {
      "title": "Russia's all-night drone attack on Kyiv injures 23, Ukraine says - Reuters",
      "pubDate": "Fri, 04 Jul 2025 05:41:00 GMT"
    },
    {
      "title": "Russian drone attack on Kyiv injures 14, triggers multiple fires, mayor says - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 04:20:00 GMT"
    },
    {
      "title": "Russia welcomes Trump’s cut to Ukraine’s military aid but it could be deadly for Kyiv - CNN",
      "pubDate": "Fri, 04 Jul 2025 14:51:00 GMT"
    },
    {
      "title": "Russia Delivers Loaded Independence Day Greeting to US - Newsweek",
      "pubDate": "Fri, 04 Jul 2025 10:26:13 GMT"
    },
    {
      "title": "Russia expanding Ukraine chemical weapons use, allege European spy agencies - Al Jazeera",
      "pubDate": "Fri, 04 Jul 2025 12:19:55 GMT"
    }
  ],
  "ai_safety": [
    {
      "title": "Firm unveils safety AI tools for kids - Punch Newspapers",
      "pubDate": "Fri, 27 Jun 2025 01:09:55 GMT"
    },
    {
      "title": "Tailor responsible AI with new safeguard tiers in Amazon Bedrock Guardrails - Amazon.com",
      "pubDate": "Thu, 26 Jun 2025 22:41:26 GMT"
    },
    {
      "title": "AI Gone Rogue: When Machines Lie, Scheme, and Threaten - OpenTools",
      "pubDate": "Sun, 29 Jun 2025 13:09:33 GMT"
    },
    {
      "title": "Deceptive AI: New Models Lie, Manipulate, and Threaten, Raising Safety Alarms - iAfrica.com",
      "pubDate": "Sun, 29 Jun 2025 20:40:03 GMT"
    },
    {
      "title": "S2W, Fino and Signet Partners join forces to enhance AI security in finance - CHOSUNBIZ - Chosunbiz",
      "pubDate": "Mon, 30 Jun 2025 00:47:00 GMT"
    },
    {
      "title": "Disturbing Signs of AI Threatening People Spark Concern - ScienceAlert",
      "pubDate": "Mon, 30 Jun 2025 02:34:49 GMT"
    },
    {
      "title": "AI System First to Alert NHS on Patient Safety Concerns - Mirage News",
      "pubDate": "Mon, 30 Jun 2025 04:37:00 GMT"
    },
    {
      "title": "AI's Dangerously Deceptive Side: When Machines Turn Master Manipulators - OpenTools",
      "pubDate": "Mon, 30 Jun 2025 12:07:48 GMT"
    },
    {
      "title": "New AI safety group launches ad buy to build right-left alliance to protect humanity - The Hill",
      "pubDate": "Mon, 30 Jun 2025 17:03:00 GMT"
    },
    {
      "title": "Congress might block state AI laws for five years — here’s what it means - TechCrunch",
      "pubDate": "Mon, 30 Jun 2025 17:02:12 GMT"
    },
    {
      "title": "Google DeepMind Slammed by Protesters Over Broken AI Safety Promise - Tech Times",
      "pubDate": "Tue, 01 Jul 2025 07:45:32 GMT"
    },
    {
      "title": "AI, align thyself - cio.com",
      "pubDate": "Tue, 01 Jul 2025 16:04:14 GMT"
    },
    {
      "title": "Amid the hype, contractors find practical safety uses for AI - Construction Dive",
      "pubDate": "Wed, 02 Jul 2025 14:54:52 GMT"
    },
    {
      "title": "How generative AI could help make construction sites safer - MIT Technology Review",
      "pubDate": "Wed, 02 Jul 2025 09:00:00 GMT"
    },
    {
      "title": "From Safety to Security: Renaming the US AI Safety Institute Is Not Just Semantics - Tech Policy Press",
      "pubDate": "Thu, 03 Jul 2025 12:39:18 GMT"
    },
    {
      "title": "Motor safety: AI-powered warning system enhances capability to uncover hidden faults - Tech Xplore",
      "pubDate": "Thu, 03 Jul 2025 17:16:03 GMT"
    },
    {
      "title": "The promise and perils of AI in health care: Why we need better testing standards - KevinMD.com",
      "pubDate": "Thu, 03 Jul 2025 15:09:28 GMT"
    },
    {
      "title": "Sutskever to lead Safe Superintelligence after Meta poaches CEO Gross in AI talent war - Reuters",
      "pubDate": "Thu, 03 Jul 2025 21:50:42 GMT"
    },
    {
      "title": "OpenAI co-founder takes CEO role at Safe Superintelligence - Tech in Asia",
      "pubDate": "Fri, 04 Jul 2025 01:49:00 GMT"
    },
    {
      "title": "AI Security Institute targets cybercrime in hiring push - UKTN",
      "pubDate": "Fri, 04 Jul 2025 13:00:17 GMT"
    }
  ],
  "financial_markets": [
    {
      "title": "S&P 500 and Nasdaq 100 futures rise, surpassing all-time intraday highs: Live updates - CNBC",
      "pubDate": "Fri, 27 Jun 2025 06:20:00 GMT"
    },
    {
      "title": "US futures hit record high, setting Bitcoin up for new peak: Analysts - Cointelegraph",
      "pubDate": "Fri, 27 Jun 2025 04:58:43 GMT"
    },
    {
      "title": "Stock-market rally boosted by expectations for at least three Fed rate cuts in 2025 - MarketWatch",
      "pubDate": "Fri, 27 Jun 2025 17:01:00 GMT"
    },
    {
      "title": "Stock Market on June 27, 2025: S&P 500, Nasdaq close at all-time highs; U.S. stocks shake off Trump's remarks about trade with Canada - MarketWatch",
      "pubDate": "Fri, 27 Jun 2025 20:53:00 GMT"
    },
    {
      "title": "America’s incredible stock market rebound is complete as S&P 500, Nasdaq hit record highs - CNN",
      "pubDate": "Fri, 27 Jun 2025 20:06:00 GMT"
    },
    {
      "title": "S&P 500 closes at a record Friday, overcoming even more trade angst: Live updates - CNBC",
      "pubDate": "Fri, 27 Jun 2025 20:47:00 GMT"
    },
    {
      "title": "S&P 500 closes at record high, marking a sharp snapback after stocks plunged in April - CBS News",
      "pubDate": "Fri, 27 Jun 2025 21:47:06 GMT"
    },
    {
      "title": "Even as markets rally, Trump's policymaking causes market angst - Yahoo",
      "pubDate": "Sat, 28 Jun 2025 10:14:53 GMT"
    },
    {
      "title": "Stock market reclaims February record peak. How the fundamentals and technicals look now vs. then - CNBC",
      "pubDate": "Sat, 28 Jun 2025 13:00:09 GMT"
    },
    {
      "title": "S&P 500 and Nasdaq Climb to Record Highs on China Trade Optimism - Nasdaq",
      "pubDate": "Sat, 28 Jun 2025 14:26:00 GMT"
    },
    {
      "title": "The record-breaking week in the stock market that could have gone very badly - CNBC",
      "pubDate": "Sat, 28 Jun 2025 20:26:18 GMT"
    },
    {
      "title": "Nvidia insiders sold over $1 billion in stock amid market surge, FT reports - Reuters",
      "pubDate": "Sun, 29 Jun 2025 05:11:00 GMT"
    },
    {
      "title": "Ethereum Price Poised to Surge 100% to $10,000 on Institutional Buying - AInvest",
      "pubDate": "Sun, 29 Jun 2025 05:41:04 GMT"
    },
    {
      "title": "The Stock-Market Rally Is Moving Beyond Big Tech and Investors Are Thrilled - WSJ",
      "pubDate": "Sun, 29 Jun 2025 01:00:00 GMT"
    },
    {
      "title": "A 2-month rally pushed the stock market to record highs — but watch for these risks in July - MarketWatch",
      "pubDate": "Sun, 29 Jun 2025 16:00:00 GMT"
    },
    {
      "title": "What Drove the Stock Market's Record-breaking Week? Don’t Overlook Growing Rate Cut Expectations - TradeAlgo",
      "pubDate": "Sun, 29 Jun 2025 16:43:23 GMT"
    },
    {
      "title": "Ignoring a $7 Trillion Financial Disaster Won’t Make It Go Away - Bloomberg.com",
      "pubDate": "Mon, 30 Jun 2025 10:30:26 GMT"
    },
    {
      "title": "US stocks push further into record heights - The Morning Call",
      "pubDate": "Mon, 30 Jun 2025 20:03:45 GMT"
    },
    {
      "title": "Global Markets Mixed as Focus Shifts to Trump Bill - WSJ",
      "pubDate": "Tue, 01 Jul 2025 08:30:00 GMT"
    },
    {
      "title": "Asia-Pacific markets trade mixed as investors assess gains on Wall Street and Trump's tariff plans - CNBC",
      "pubDate": "Tue, 01 Jul 2025 07:58:00 GMT"
    },
    {
      "title": "Putin Offers Special Accounts to Lure New Investors to Russia - Bloomberg",
      "pubDate": "Tue, 01 Jul 2025 15:36:22 GMT"
    },
    {
      "title": "Stock Market Today: S&P 500, Nasdaq hit highs on Vietnam trade deal - TheStreet",
      "pubDate": "Wed, 02 Jul 2025 20:30:43 GMT"
    },
    {
      "title": "S&P 500 futures and dollar dip as Trump revives tariff tension - MarketWatch",
      "pubDate": "Fri, 04 Jul 2025 06:35:00 GMT"
    },
    {
      "title": "As US stocks hit records, experts see the dollar falling further - France 24",
      "pubDate": "Fri, 04 Jul 2025 02:47:10 GMT"
    },
    {
      "title": "Bitcoin price can hit $150K in weeks thanks to Trump's 'Big Beautiful Bill' - Cointelegraph",
      "pubDate": "Fri, 04 Jul 2025 09:58:53 GMT"
    },
    {
      "title": "India Cracks Down on Jane Street’s Lucrative Derivatives Trades - WSJ",
      "pubDate": "Fri, 04 Jul 2025 13:48:00 GMT"
    }
  ],
  "artificial_intelligence": [
    {
      "title": "Banks enter agentic AI era as tech race heats up, ROI in focus | Insights | Bloomberg Professional Services - Bloomberg",
      "pubDate": "Thu, 26 Jun 2025 23:29:45 GMT"
    },
    {
      "title": "SoftBank aims to become leading 'artificial super intelligence' platform provider - Yahoo",
      "pubDate": "Fri, 27 Jun 2025 02:10:26 GMT"
    },
    {
      "title": "OpenAI CEO Sam Altman takes one of the biggest AI U-Turn, says: Current computers are … - Times of India",
      "pubDate": "Fri, 27 Jun 2025 03:53:00 GMT"
    },
    {
      "title": "OpenAI hit hard? Zuckerberg reportedly poaches top AI experts from ChatGPT maker - Hindustan Times",
      "pubDate": "Fri, 27 Jun 2025 05:44:56 GMT"
    },
    {
      "title": "Salesforce Says AI Is Doing 30% of Its Coding and Customer Service - PYMNTS.com",
      "pubDate": "Fri, 27 Jun 2025 02:03:45 GMT"
    },
    {
      "title": "Meta hires former OpenAI top talent amid AGI push - Cointelegraph",
      "pubDate": "Thu, 26 Jun 2025 21:14:45 GMT"
    },
    {
      "title": "A.I. Frenzy Escalates as OpenAI, Amazon and Meta Supersize Spending - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 09:01:27 GMT"
    },
    {
      "title": "Mark Zuckerberg Ramps Up Meta’s A.I. Spending as Competition Heats Up - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 09:00:49 GMT"
    },
    {
      "title": "Exclusive: Trump plans executive orders to power AI growth in race with China - Reuters",
      "pubDate": "Fri, 27 Jun 2025 11:08:41 GMT"
    },
    {
      "title": "Trump’s tax bill seeks to prevent AI regulations. Experts fear a heavy toll on the planet - The Guardian",
      "pubDate": "Fri, 27 Jun 2025 11:30:00 GMT"
    },
    {
      "title": "Anthropic Study Uncovers AI's Dark Side: Rogue Agents Threatened by Shutdown - OpenTools",
      "pubDate": "Fri, 27 Jun 2025 12:05:26 GMT"
    },
    {
      "title": "OpenAI may prematurely declare AGI to cut ties with Microsoft — despite Sam Altman admitting today's tech isn’t built for it - Windows Central",
      "pubDate": "Fri, 27 Jun 2025 09:37:43 GMT"
    },
    {
      "title": "AI is fuelling a new wave of border vigilantism in the US - Al Jazeera",
      "pubDate": "Fri, 27 Jun 2025 10:18:45 GMT"
    },
    {
      "title": "Finding viable sperm in infertile men can take days. AI did it in hours. - The Washington Post",
      "pubDate": "Fri, 27 Jun 2025 16:01:33 GMT"
    },
    {
      "title": "AI-Powered Data Visualization: Unlock Dynamic Insights in 2025 - appinventiv.com",
      "pubDate": "Fri, 27 Jun 2025 13:05:10 GMT"
    },
    {
      "title": "Colleen Hoover, Emily Henry among 70 authors urging publishers against AI use - USA Today",
      "pubDate": "Fri, 27 Jun 2025 18:00:14 GMT"
    },
    {
      "title": "OpenAI’s Unreleased AGI Paper Could Complicate Microsoft Negotiations - WIRED",
      "pubDate": "Fri, 27 Jun 2025 19:35:29 GMT"
    },
    {
      "title": "Meta seeks $29bn from private credit giants to fund AI data centres - Financial Times",
      "pubDate": "Fri, 27 Jun 2025 19:43:59 GMT"
    },
    {
      "title": "Using generative AI to help robots jump higher and land safely - MIT News",
      "pubDate": "Fri, 27 Jun 2025 17:00:00 GMT"
    },
    {
      "title": "Google Convinces OpenAI to Use TPU Chips in Win Against Nvidia - The Information",
      "pubDate": "Fri, 27 Jun 2025 20:09:00 GMT"
    },
    {
      "title": "OpenAI turns to Google's AI chips to power its products, source says - Reuters",
      "pubDate": "Fri, 27 Jun 2025 22:15:13 GMT"
    },
    {
      "title": "Interview: Developing a CIO strategy for artificial intelligence - Computer Weekly",
      "pubDate": "Fri, 27 Jun 2025 16:00:51 GMT"
    },
    {
      "title": "Artificial Intelligence's \"M3GAN 2.0\" takes theatres | Take a Look Daily - ABC10",
      "pubDate": "Fri, 27 Jun 2025 22:15:00 GMT"
    },
    {
      "title": "Securing Artificial Intelligence: Can the Industry Collaborate? - Security Sales & Integration",
      "pubDate": "Fri, 27 Jun 2025 20:27:41 GMT"
    },
    {
      "title": "Germany asks Apple and Google to pull DeepSeek AI app over data privacy concerns - 9to5Mac",
      "pubDate": "Fri, 27 Jun 2025 22:15:00 GMT"
    },
    {
      "title": "DeepSeek faces ban from Apple, Google app stores in Germany - Reuters",
      "pubDate": "Fri, 27 Jun 2025 21:06:27 GMT"
    },
    {
      "title": "OpenAI renting Google TPUs sends a strong warning shot to Microsoft - the-decoder.com",
      "pubDate": "Sat, 28 Jun 2025 07:43:11 GMT"
    },
    {
      "title": "These two game-changing breakthroughs advance us toward artificial general intelligence - Fast Company",
      "pubDate": "Sat, 28 Jun 2025 10:40:33 GMT"
    },
    {
      "title": "The AI Backlash Keeps Growing Stronger - WIRED",
      "pubDate": "Sat, 28 Jun 2025 10:30:00 GMT"
    },
    {
      "title": "OpenAI Taps Google's AI Chips: A Strategic Shift in the Tech Alliance Landscape - OpenTools",
      "pubDate": "Sat, 28 Jun 2025 11:40:32 GMT"
    },
    {
      "title": "AMD vs. Arista Networks: Which Artificial Intelligence (AI) Stock Is a Better Buy Right Now? - AOL.com",
      "pubDate": "Sat, 28 Jun 2025 12:25:52 GMT"
    },
    {
      "title": "OpenAI and Microsoft's AGI Clause Drama: Corporate Tango or Technological Tangle? - OpenTools",
      "pubDate": "Sat, 28 Jun 2025 12:38:53 GMT"
    },
    {
      "title": "Artificial intelligence meets brain theory (again) - DOI",
      "pubDate": "Sat, 28 Jun 2025 11:25:13 GMT"
    },
    {
      "title": "OpenAI said to have tapped Google for AI chips in a shift away from Nvidia - Seeking Alpha",
      "pubDate": "Sat, 28 Jun 2025 13:16:00 GMT"
    },
    {
      "title": "Meta hires four more OpenAI researchers, The Information reports - Reuters",
      "pubDate": "Sat, 28 Jun 2025 17:06:37 GMT"
    },
    {
      "title": "Anthropic’s Claude AI became a terrible business owner in experiment that got ‘weird’ - TechCrunch",
      "pubDate": "Sat, 28 Jun 2025 16:00:00 GMT"
    },
    {
      "title": "Meta's AGI Gambit: Talent, Risk, and the Race for AI Supremacy - AInvest",
      "pubDate": "Sat, 28 Jun 2025 18:08:27 GMT"
    },
    {
      "title": "It’s Known as ‘The List’—and It’s a Secret File of AI Geniuses - WSJ",
      "pubDate": "Sat, 28 Jun 2025 13:21:07 GMT"
    },
    {
      "title": "China catching up fast with US in algorithms: ex-Microsoft AI head - South China Morning Post",
      "pubDate": "Sat, 28 Jun 2025 23:00:13 GMT"
    },
    {
      "title": "AI is learning to lie, scheme, and threaten its creators - The Straits Times",
      "pubDate": "Sun, 29 Jun 2025 03:25:00 GMT"
    },
    {
      "title": "Letter: Artificial Intelligence is dangerous for kids - Mitchell Republic",
      "pubDate": "Sat, 28 Jun 2025 20:14:45 GMT"
    },
    {
      "title": "AI models fake understanding while failing basic tasks - PPC Land",
      "pubDate": "Sat, 28 Jun 2025 20:46:49 GMT"
    },
    {
      "title": "Researchers alarmed as AI begins to lie, scheme and threaten - The News International",
      "pubDate": "Sun, 29 Jun 2025 06:00:00 GMT"
    },
    {
      "title": "Artificial Intelligence in Obstetrics and Gynaecology: Advancing Precision and Personalised Care - Cureus",
      "pubDate": "Sat, 28 Jun 2025 20:54:36 GMT"
    },
    {
      "title": "OpenAI and Microsoft are dueling over AGI. These real-world tests will prove when AI is really better than humans. - Business Insider",
      "pubDate": "Sun, 29 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Artificial Intelligence Model Improves Prostate Cancer Detection - Physician's Weekly",
      "pubDate": "Sun, 29 Jun 2025 11:01:19 GMT"
    },
    {
      "title": "10 Artificial Intelligence (AI) Companies to Buy Now and Hold Forever - Nasdaq",
      "pubDate": "Sun, 29 Jun 2025 10:30:00 GMT"
    },
    {
      "title": "Why Artificial Integrity Must Overtake Artificial Intelligence - Forbes",
      "pubDate": "Sun, 29 Jun 2025 13:03:30 GMT"
    },
    {
      "title": "Will AI need a body to come close to human-like intelligence? - New Atlas",
      "pubDate": "Sun, 29 Jun 2025 14:07:03 GMT"
    },
    {
      "title": "Nvidia shares retake AI leadership role. Wall Street is bullish going forward - CNBC",
      "pubDate": "Sun, 29 Jun 2025 11:14:32 GMT"
    },
    {
      "title": "Inside Chanakya Thunuguntla’s Plan to Rebuild the U.S. Workforce with Artificial Intelligence - USA Today",
      "pubDate": "Sun, 29 Jun 2025 20:03:47 GMT"
    },
    {
      "title": "China's biggest public AI drop since DeepSeek, Baidu's open source Ernie, is about to hit the market - CNBC",
      "pubDate": "Sun, 29 Jun 2025 16:19:14 GMT"
    },
    {
      "title": "Meta's Camera Roll Access Sparks Privacy Concerns and AI Debates - OpenTools",
      "pubDate": "Sun, 29 Jun 2025 13:09:43 GMT"
    },
    {
      "title": "Artificial Intelligence in Agriculture Market to Reach USD 12.8 Billion by 2032, Driven by Climate-Smart Practices and Yield Optimization AI Tools | SNS Insider - GlobeNewswire",
      "pubDate": "Sun, 29 Jun 2025 14:01:10 GMT"
    },
    {
      "title": "GOP senators reach deal on AI regulation ban - The Hill",
      "pubDate": "Mon, 30 Jun 2025 02:01:00 GMT"
    },
    {
      "title": "Artificial Intelligence: A Tool That Is Reshaping Geopolitics – Analysis - Eurasia Review",
      "pubDate": "Mon, 30 Jun 2025 01:12:01 GMT"
    },
    {
      "title": "NHS will use AI in warning system to catch potential safety scandals early - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 23:01:00 GMT"
    },
    {
      "title": "AI Crypto Price Prediction: How Artificial Intelligence is Shaping the Future of Cryptocurrency Markets - Vocal",
      "pubDate": "Mon, 30 Jun 2025 07:05:30 GMT"
    },
    {
      "title": "Neuropsychopharmacology in the era of artificial intelligence and biomolecule prediction software - Nature",
      "pubDate": "Mon, 30 Jun 2025 07:50:53 GMT"
    },
    {
      "title": "OpenAI Rents Google’s AI Chips, Looks Beyond Nvidia’s GPUs - TipRanks",
      "pubDate": "Mon, 30 Jun 2025 07:14:12 GMT"
    },
    {
      "title": "Artificial Intelligence at Barclays – Two Use Cases - Emerj Artificial Intelligence Research",
      "pubDate": "Mon, 30 Jun 2025 10:12:50 GMT"
    },
    {
      "title": "Artificial Intelligence: The Defining Investment Theme of Our Era - Morningstar",
      "pubDate": "Mon, 30 Jun 2025 11:05:35 GMT"
    },
    {
      "title": "EXCLUSIVE: HII, C3 AI ink agreement to boost shipyard production using artificial intelligence - Breaking Defense",
      "pubDate": "Mon, 30 Jun 2025 12:47:29 GMT"
    },
    {
      "title": "Europe's AI gigafactory push attracts 76 bids, EU tech chief says - Reuters",
      "pubDate": "Mon, 30 Jun 2025 14:06:13 GMT"
    },
    {
      "title": "Microsoft says AI system better than doctors at diagnosing complex health conditions - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 14:02:00 GMT"
    },
    {
      "title": "US Senate debates whether to adopt revised state AI regulation ban - Reuters",
      "pubDate": "Mon, 30 Jun 2025 16:22:07 GMT"
    },
    {
      "title": "Microsoft Says Its New AI System Diagnosed Patients 4 Times More Accurately Than Human Doctors - WIRED",
      "pubDate": "Mon, 30 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Microsoft unveils AI diagnosis tool in effort to transform medicine - Financial Times",
      "pubDate": "Mon, 30 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "Apple Weighs Using Anthropic or OpenAI to Power Siri in Major Reversal - Bloomberg",
      "pubDate": "Mon, 30 Jun 2025 18:45:26 GMT"
    },
    {
      "title": "Meta shares hit all-time high as Mark Zuckerberg goes on AI hiring blitz - CNBC",
      "pubDate": "Mon, 30 Jun 2025 18:43:24 GMT"
    },
    {
      "title": "Senate’s New A.I. Moratorium Proposal Draws Fresh Criticism - The New York Times",
      "pubDate": "Mon, 30 Jun 2025 20:55:44 GMT"
    },
    {
      "title": "Mark Zuckerberg announces creation of Meta Superintelligence Labs. Read the memo - CNBC",
      "pubDate": "Mon, 30 Jun 2025 18:32:44 GMT"
    },
    {
      "title": "Here Is Everyone Mark Zuckerberg Has Hired So Far for Meta’s ‘Superintelligence’ Team - WIRED",
      "pubDate": "Mon, 30 Jun 2025 18:09:00 GMT"
    },
    {
      "title": "Meta’s Mark Zuckerberg unveils AI ‘Superintelligence Labs’ in restructuring as shares hit record high - New York Post",
      "pubDate": "Mon, 30 Jun 2025 19:56:39 GMT"
    },
    {
      "title": "Meta deepens AI push with 'Superintelligence' lab, source says - Reuters",
      "pubDate": "Mon, 30 Jun 2025 19:46:47 GMT"
    },
    {
      "title": "AI PCs, Ryzen, and the Next Frontier in Personal Computing – Six Five On The Road - The Futurum Group",
      "pubDate": "Mon, 30 Jun 2025 23:57:26 GMT"
    },
    {
      "title": "Banks Adopting AI Agents After Seeing Benefits of AI Chatbots - PYMNTS.com",
      "pubDate": "Tue, 01 Jul 2025 00:05:27 GMT"
    },
    {
      "title": "Apple may power Siri with Anthropic or OpenAI models amid AI struggles - Engadget",
      "pubDate": "Mon, 30 Jun 2025 21:20:28 GMT"
    },
    {
      "title": "Elon Musk's xAI raises $10 billion in debt and equity as it steps up challenge to OpenAI - CNBC",
      "pubDate": "Tue, 01 Jul 2025 08:37:27 GMT"
    },
    {
      "title": "Google signs first fusion power deal with MIT spinout Commonwealth Fusion Systems - Proactive Investors",
      "pubDate": "Tue, 01 Jul 2025 07:34:00 GMT"
    },
    {
      "title": "Cloudflare Introduces Default Blocking of A.I. Data Scrapers - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 10:00:12 GMT"
    },
    {
      "title": "US Senate rejects plan to stop states regulating AI - Financial Times",
      "pubDate": "Tue, 01 Jul 2025 09:53:31 GMT"
    },
    {
      "title": "US Senate strikes AI regulation ban from Trump megabill - Reuters",
      "pubDate": "Tue, 01 Jul 2025 12:56:42 GMT"
    },
    {
      "title": "In dramatic reversal, Senate kills AI-law moratorium - The Washington Post",
      "pubDate": "Tue, 01 Jul 2025 14:09:08 GMT"
    },
    {
      "title": "Senate Votes 99-1 to Strip AI Provision From Trump’s Tax Bill - Bloomberg",
      "pubDate": "Tue, 01 Jul 2025 11:05:16 GMT"
    },
    {
      "title": "Defeat of a 10-Year Ban on State A.I. Laws Is a Blow to Tech Industry - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 14:33:19 GMT"
    },
    {
      "title": "Senate strikes AI provision from GOP bill after uproar from the states - cbs8.com",
      "pubDate": "Tue, 01 Jul 2025 12:47:00 GMT"
    },
    {
      "title": "Artificial intelligence and innovation in the human-tech nexus - Nature",
      "pubDate": "Tue, 01 Jul 2025 15:01:15 GMT"
    },
    {
      "title": "Meta announces new ‘superintelligence’ unit to work on AI - Euronews.com",
      "pubDate": "Tue, 01 Jul 2025 11:19:05 GMT"
    },
    {
      "title": "Meta Announces Formation of 'Superintelligence' Unit Amid AI Recruiting Push - Investopedia",
      "pubDate": "Tue, 01 Jul 2025 13:40:25 GMT"
    },
    {
      "title": "Microsoft quietly installed ‘secret’ update on some Windows 10 and 11 PCs - PCWorld",
      "pubDate": "Tue, 01 Jul 2025 14:08:00 GMT"
    },
    {
      "title": "How tech’s bold bid to curb AI laws fell apart - The Washington Post",
      "pubDate": "Wed, 02 Jul 2025 00:33:46 GMT"
    },
    {
      "title": "'Evolve or die': How AI is impacting the workplace - Australian Broadcasting Corporation",
      "pubDate": "Tue, 01 Jul 2025 18:41:06 GMT"
    },
    {
      "title": "A new tech race is on. Can Europe learn from the ones it lost? - politico.eu",
      "pubDate": "Wed, 02 Jul 2025 02:33:25 GMT"
    },
    {
      "title": "China Is Quickly Eroding America’s Lead in the Global AI Race - WSJ",
      "pubDate": "Wed, 02 Jul 2025 03:00:00 GMT"
    },
    {
      "title": "Breakingviews - AI dooms the billable hour – and Big Law earnings - Reuters",
      "pubDate": "Wed, 02 Jul 2025 05:00:00 GMT"
    },
    {
      "title": "Apple reaches out to OpenAI, Anthropic to build out Siri technology - Computerworld",
      "pubDate": "Tue, 01 Jul 2025 20:53:54 GMT"
    },
    {
      "title": "Zuckerberg reportedly offers $300 million packages to lure OpenAI staff - CTech",
      "pubDate": "Wed, 02 Jul 2025 07:01:00 GMT"
    },
    {
      "title": "Surge AI Reportedly Targeting $1 Billion in First-Ever Fundraise - PYMNTS.com",
      "pubDate": "Wed, 02 Jul 2025 00:11:15 GMT"
    },
    {
      "title": "Google Signs Deal to Buy Fusion Energy From Bill Gates-Backed Nuclear Startup - NucNet",
      "pubDate": "Wed, 02 Jul 2025 08:05:01 GMT"
    },
    {
      "title": "Microsoft’s Job Cuts Point to Squeeze From Rising Expense of AI - Bloomberg",
      "pubDate": "Wed, 02 Jul 2025 11:02:28 GMT"
    },
    {
      "title": "Comp. Sci. Students, Helmuth Study Cutting Edge Large Language Models - Hamilton College",
      "pubDate": "Wed, 02 Jul 2025 12:26:31 GMT"
    },
    {
      "title": "Amazon's Robot Workforce Hits Ominous Milestone - Newsweek",
      "pubDate": "Wed, 02 Jul 2025 14:10:12 GMT"
    },
    {
      "title": "AI helps find formula for paint to keep buildings cooler - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 15:29:00 GMT"
    },
    {
      "title": "AI is for aerospace: How artificial intelligence agents aim to change the sector - Aerospace Testing International",
      "pubDate": "Wed, 02 Jul 2025 09:18:00 GMT"
    },
    {
      "title": "Inter-brain neural dynamics in biological and artificial intelligence systems - nature.com",
      "pubDate": "Wed, 02 Jul 2025 15:07:48 GMT"
    },
    {
      "title": "Army Creating New Artificial Intelligence-Focused Occupational Specialty and Officer Field - Military.com",
      "pubDate": "Wed, 02 Jul 2025 17:29:38 GMT"
    },
    {
      "title": "Scientists Use A.I. to Mimic the Mind, Warts and All - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 15:00:07 GMT"
    },
    {
      "title": "States retain power to regulate AI as Senate approves amendment led by Cantwell - GeekWire",
      "pubDate": "Wed, 02 Jul 2025 22:58:37 GMT"
    },
    {
      "title": "Microsoft to cut about 4% of jobs amid hefty AI bets - Reuters",
      "pubDate": "Wed, 02 Jul 2025 18:08:31 GMT"
    },
    {
      "title": "Microsoft axing 9,000 employees as tech world eyes artificial intelligence growth - KFOX",
      "pubDate": "Wed, 02 Jul 2025 18:49:24 GMT"
    },
    {
      "title": "AI regulation draws support from both sides of the political aisle - Texas Standard",
      "pubDate": "Wed, 02 Jul 2025 19:35:36 GMT"
    },
    {
      "title": "Software Engineering in the LLM Era - Towards Data Science",
      "pubDate": "Wed, 02 Jul 2025 19:27:46 GMT"
    },
    {
      "title": "How a GOP rift over tech regulation doomed a ban on state AI laws in Trump's tax bill - The Washington Post",
      "pubDate": "Thu, 03 Jul 2025 04:15:25 GMT"
    },
    {
      "title": "Microsoft confirms 9000 layoffs in strategic pivot to artificial intelligence - The Times of India",
      "pubDate": "Thu, 03 Jul 2025 05:09:00 GMT"
    },
    {
      "title": "Marginalized Americans are highly skeptical of artificial intelligence, research finds - Phys.org",
      "pubDate": "Wed, 02 Jul 2025 21:14:04 GMT"
    },
    {
      "title": "New push for national AI rules likely after state ban fails - Axios",
      "pubDate": "Thu, 03 Jul 2025 09:48:26 GMT"
    },
    {
      "title": "OpenAI & Oracle: The US$30bn Data Centre Deal for Stargate - AI Magazine",
      "pubDate": "Thu, 03 Jul 2025 09:37:51 GMT"
    },
    {
      "title": "Former OpenAI Board Member Questions Zuckerberg AI Hiring Spree - Bloomberg",
      "pubDate": "Thu, 03 Jul 2025 06:15:00 GMT"
    },
    {
      "title": "OpenAI Says It's Hired a Forensic Psychiatrist as Its Users Keep Sliding Into Mental Health Crises - Futurism",
      "pubDate": "Thu, 03 Jul 2025 13:29:17 GMT"
    },
    {
      "title": "Samsara's Latest AI Tools Aimed at Improving Safety and Efficiency - Heavy Duty Trucking",
      "pubDate": "Thu, 03 Jul 2025 14:32:47 GMT"
    },
    {
      "title": "Trump megabill preventing artificial intelligence regulation could harm planet’s climate - Harvard T.H. Chan School of Public Health",
      "pubDate": "Thu, 03 Jul 2025 16:19:17 GMT"
    },
    {
      "title": "Behind the tanked AI moratorium - Politico",
      "pubDate": "Thu, 03 Jul 2025 18:00:00 GMT"
    },
    {
      "title": "Explainable artificial intelligence for predicting medical students’ performance in comprehensive assessments - Nature",
      "pubDate": "Thu, 03 Jul 2025 12:59:52 GMT"
    },
    {
      "title": "How the Trump tax bill could help China win at A.I. - The Washington Post",
      "pubDate": "Thu, 03 Jul 2025 20:06:30 GMT"
    },
    {
      "title": "What three Californians learned in Kansas about artificial intelligence | Opinion - Kansas City Star",
      "pubDate": "Thu, 03 Jul 2025 12:04:00 GMT"
    },
    {
      "title": "AI models just don't understand what they're talking about - theregister.com",
      "pubDate": "Thu, 03 Jul 2025 21:39:00 GMT"
    },
    {
      "title": "China's fusion breakthrough by 2027 exposes U.S. lag as best reactor aims for 5x output with unmatched construction speed - Glass Almanac",
      "pubDate": "Thu, 03 Jul 2025 14:30:09 GMT"
    },
    {
      "title": "Meta restructures AI teams to focus on superintelligence - Quartz",
      "pubDate": "Thu, 03 Jul 2025 18:04:26 GMT"
    },
    {
      "title": "Will artificial intelligence outsmart humankind? - China Daily",
      "pubDate": "Thu, 03 Jul 2025 23:37:00 GMT"
    },
    {
      "title": "Artificial Intelligence and societal decline - meer.com",
      "pubDate": "Fri, 04 Jul 2025 05:01:24 GMT"
    },
    {
      "title": "Uncertainty forces colleges to carefully consider investments in artificial intelligence - WJAR",
      "pubDate": "Thu, 03 Jul 2025 20:20:37 GMT"
    },
    {
      "title": "Artificial intelligence to help growers assess hurricane crop damage - FOX 13 Tampa Bay",
      "pubDate": "Thu, 03 Jul 2025 21:12:55 GMT"
    },
    {
      "title": "Artificial Intelligence News for the Week of June 20; Updates from Campfire, Databricks, Precisely & More - solutionsreview.com",
      "pubDate": "Thu, 03 Jul 2025 23:46:16 GMT"
    },
    {
      "title": "Minister demands overhaul of UK’s leading AI institute - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 09:59:00 GMT"
    },
    {
      "title": "Artificial intelligence rules to go ahead, no pause, EU Commission says - Reuters",
      "pubDate": "Fri, 04 Jul 2025 10:47:46 GMT"
    },
    {
      "title": "Meta Snags Former SSI CEO Daniel Gross for Its AI Crusade - OpenTools",
      "pubDate": "Fri, 04 Jul 2025 12:36:54 GMT"
    },
    {
      "title": "Tesla Vs. BYD: Tesla Loses Tax Credits Amid Robotaxi Push; BYD's BEV Sales Boom - MSN",
      "pubDate": "Fri, 04 Jul 2025 11:36:29 GMT"
    },
    {
      "title": "AI Models and Tools: OpenAI Enables Creation of Shopify AI Assistants - PYMNTS.com",
      "pubDate": "Fri, 04 Jul 2025 07:52:30 GMT"
    },
    {
      "title": "Bombshell Research Finds a Staggering Number of Scientific Papers Were AI-Generated - Futurism",
      "pubDate": "Fri, 04 Jul 2025 16:00:50 GMT"
    },
    {
      "title": "Google hit with antitrust complaint in EU over AI summaries harming web traffic to news sites: report - New York Post",
      "pubDate": "Fri, 04 Jul 2025 17:05:00 GMT"
    },
    {
      "title": "OpenAI CEO Sam Altman says he's 'politically homeless' in July 4 post bashing Democrats - CNBC",
      "pubDate": "Fri, 04 Jul 2025 15:44:10 GMT"
    },
    {
      "title": "EU sticks with timeline for AI rules - Reuters",
      "pubDate": "Fri, 04 Jul 2025 11:20:04 GMT"
    }
  ],
  "climate": [
    {
      "title": "Earth is trapping much more heat than climate models forecast – and the rate has doubled in 20 years - The Conversation",
      "pubDate": "Fri, 27 Jun 2025 01:34:00 GMT"
    },
    {
      "title": "A Class-Action Lawsuit Aims to Restore Climate and Environmental Grants - Inside Climate News",
      "pubDate": "Sat, 28 Jun 2025 08:55:00 GMT"
    },
    {
      "title": "Pakistan slams climate ‘injustice’ as deadly floods hit country again - Al Jazeera",
      "pubDate": "Sat, 28 Jun 2025 17:03:45 GMT"
    },
    {
      "title": "First Signal of Climate Change Became Detectable 130 Years Ago - ScienceAlert",
      "pubDate": "Sun, 29 Jun 2025 19:01:35 GMT"
    },
    {
      "title": "Trump’s Big Beautiful Bill Will Destroy America’s Climate Progress - Rolling Stone",
      "pubDate": "Sun, 29 Jun 2025 14:00:00 GMT"
    },
    {
      "title": "Wildfire risks as climate change fuels extreme heatwave in Southern Europe - Al Jazeera",
      "pubDate": "Sun, 29 Jun 2025 20:19:21 GMT"
    },
    {
      "title": "Scientists issue warning over concerning phenomenon observed in Antarctica: 'Understanding their future patterns is crucial' - The Cool Down",
      "pubDate": "Sun, 29 Jun 2025 11:15:16 GMT"
    },
    {
      "title": "Earth's Energy Imbalance Has Doubled in 2 Decades, Study Warns - ScienceAlert",
      "pubDate": "Mon, 30 Jun 2025 02:54:59 GMT"
    },
    {
      "title": "Lethal heat is Europe’s new climate reality - politico.eu",
      "pubDate": "Mon, 30 Jun 2025 20:06:00 GMT"
    },
    {
      "title": "Record rainfall in central China leads to flooding and evacuations - NBC News",
      "pubDate": "Tue, 01 Jul 2025 09:37:57 GMT"
    },
    {
      "title": "National Climate Report Website Goes Dark - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 17:08:40 GMT"
    },
    {
      "title": "Scientists show how smarter flight decisions could help fight climate change - The Hill",
      "pubDate": "Wed, 02 Jul 2025 15:44:00 GMT"
    },
    {
      "title": "European summers are getting brutally hot. So why is air conditioning so rare? - CNN",
      "pubDate": "Wed, 02 Jul 2025 13:55:00 GMT"
    },
    {
      "title": "Countries must protect human right to a stable climate, court rules - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 22:18:00 GMT"
    },
    {
      "title": "House Passes Trump’s Spending Bill, With Consequences for the Climate - eos.org",
      "pubDate": "Thu, 03 Jul 2025 21:16:32 GMT"
    },
    {
      "title": "A physically consistent dataset of water-energy-carbon fluxes across the Soil-Plant-Atmosphere Continuum - Nature",
      "pubDate": "Fri, 04 Jul 2025 16:22:46 GMT"
    }
  ],
  "ukraine": [
    {
      "title": "Ukraine war live: Trump admits Putin could invade more of Europe at Nato summit - The Independent",
      "pubDate": "Fri, 27 Jun 2025 02:43:00 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Kyiv halts Putin’s advance in Sumy after new prisoner swap deal agreed - The Independent",
      "pubDate": "Fri, 27 Jun 2025 10:02:37 GMT"
    },
    {
      "title": "Ukraine war live: Russian missile strike kills three amid warning of summer attack - The Independent",
      "pubDate": "Fri, 27 Jun 2025 11:32:37 GMT"
    },
    {
      "title": "Russia and Ukraine trade more long-range drone attacks that are a hallmark of their war - AP News",
      "pubDate": "Fri, 27 Jun 2025 12:11:00 GMT"
    },
    {
      "title": "Russia has amassed 110,000 troops near strategic Ukrainian city, Kyiv says - CNN",
      "pubDate": "Fri, 27 Jun 2025 15:36:00 GMT"
    },
    {
      "title": "Ukraine war latest: Ukrainian drones reportedly strike 4 fighter jets in Russia - The Kyiv Independent",
      "pubDate": "Fri, 27 Jun 2025 19:30:26 GMT"
    },
    {
      "title": "Ukraine hits four Russian Su-34 warplanes at Marinovka airbase - Ukrinform",
      "pubDate": "Fri, 27 Jun 2025 17:16:00 GMT"
    },
    {
      "title": "Ukraine's Special Operators Just Executed Another Air Base Raid in Russia—And Knocked Out Four Sukhoi Fighter-Bombers - Trench Art | David Axe",
      "pubDate": "Fri, 27 Jun 2025 22:05:41 GMT"
    },
    {
      "title": "Ukraine war latest: Ukrainian special forces 'destroy bombers' at Russian airbase - as Putin plans to cut military spending - Sky News",
      "pubDate": "Fri, 27 Jun 2025 23:49:08 GMT"
    },
    {
      "title": "Ukrainian forces destroy two Su-34 jets and damage two others in Russia's Volgograd Oblast - Українська правда",
      "pubDate": "Fri, 27 Jun 2025 16:39:38 GMT"
    },
    {
      "title": "Ukraine war briefing: Kyiv hits warplanes in Russia as missile attack kills five in Ukraine - The Guardian",
      "pubDate": "Sat, 28 Jun 2025 02:50:00 GMT"
    },
    {
      "title": "Ukraine launches new long-range drone strikes at Russian military airfield, targeting tactical warplanes - Meduza",
      "pubDate": "Fri, 27 Jun 2025 17:53:00 GMT"
    },
    {
      "title": "Russian Drone Strike Kills 2, Wounds 14 in Ukraine's Odesa, Authorities Say - U.S. News & World Report",
      "pubDate": "Sat, 28 Jun 2025 06:44:00 GMT"
    },
    {
      "title": "Ukraine Destroys Russian Fighter-Bombers in Precision Air Base Attack - Newsweek",
      "pubDate": "Sat, 28 Jun 2025 09:21:56 GMT"
    },
    {
      "title": "Russian drone strike on port city kills married couple, injures 17, Ukraine officials say - CBS News",
      "pubDate": "Sat, 28 Jun 2025 11:12:40 GMT"
    },
    {
      "title": "Ukrainian drone strike on Crimea air base destroys 3 Russian helicopters, SBU claims - The Kyiv Independent",
      "pubDate": "Sat, 28 Jun 2025 12:37:13 GMT"
    },
    {
      "title": "Ukrainian drones hit Russian missile and artillery arsenal – source - Українська правда",
      "pubDate": "Sat, 28 Jun 2025 10:23:37 GMT"
    },
    {
      "title": "Ukraine says drones destroyed Russia’s helicopters, air defences in Crimea - Al Jazeera",
      "pubDate": "Sat, 28 Jun 2025 19:40:25 GMT"
    },
    {
      "title": "Ukraine destroys Russian helicopters in latest airfield drone strikes - The Telegraph",
      "pubDate": "Sat, 28 Jun 2025 17:55:00 GMT"
    },
    {
      "title": "Russia is hitting Ukraine with drones and missiles - Latest news from Azerbaijan",
      "pubDate": "Sun, 29 Jun 2025 05:46:54 GMT"
    },
    {
      "title": "At least six wounded in large-scale Russian air attack on Ukraine, Ukrainian authorities say - Reuters",
      "pubDate": "Sun, 29 Jun 2025 06:37:00 GMT"
    },
    {
      "title": "Russia launches biggest aerial attack on Ukraine since the start of the war - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Sun, 29 Jun 2025 07:15:44 GMT"
    },
    {
      "title": "Ukraine loses F-16 fighter amid massed Russian drone, missile attack - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Sun, 29 Jun 2025 07:29:49 GMT"
    },
    {
      "title": "Ukraine Reports Record Russian Missile and Drone Attack - Bloomberg.com",
      "pubDate": "Sun, 29 Jun 2025 07:13:27 GMT"
    },
    {
      "title": "Russia hits Ukraine with biggest attack of the war; F-16 pilot is killed - politico.eu",
      "pubDate": "Sun, 29 Jun 2025 09:16:41 GMT"
    },
    {
      "title": "Russia’s summer offensive in Ukraine underwhelms – but Kyiv won’t be celebrating - CNN",
      "pubDate": "Sun, 29 Jun 2025 07:57:00 GMT"
    },
    {
      "title": "Ukraine F-16 pilot killed repelling massive Russian air attack - Al Jazeera",
      "pubDate": "Sun, 29 Jun 2025 08:48:45 GMT"
    },
    {
      "title": "Russia launches largest airstrike since start of the war, Ukraine officials say - CBS News",
      "pubDate": "Sun, 29 Jun 2025 13:22:34 GMT"
    },
    {
      "title": "Ukraine F-16 pilot killed in large-scale Russian attack, Zelenskiy calls for US help - Reuters",
      "pubDate": "Sun, 29 Jun 2025 11:42:44 GMT"
    },
    {
      "title": "Ukraine loses an F-16 pilot and his jet while fighting one of Russia’s biggest ever aerial attacks - CNN",
      "pubDate": "Sun, 29 Jun 2025 15:00:00 GMT"
    },
    {
      "title": "Russia Pounds Ukraine With Drones and Missiles in One of War’s Largest Attacks - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 16:18:07 GMT"
    },
    {
      "title": "Russia has launched biggest air attack of three-year war on Ukraine, Kyiv says - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 16:23:00 GMT"
    },
    {
      "title": "Massive Russian assault among biggest attacks on Ukraine since start of war - NBC News",
      "pubDate": "Sun, 29 Jun 2025 23:32:54 GMT"
    },
    {
      "title": "Ukraine war: Mariupol residents deny Russian stories about the city - BBC",
      "pubDate": "Sun, 29 Jun 2025 21:00:30 GMT"
    },
    {
      "title": "Russia Launches Largest Drone Attack Yet Against Ukraine, Kills F-16 Pilot - Algemeiner.com",
      "pubDate": "Sun, 29 Jun 2025 17:01:00 GMT"
    },
    {
      "title": "Ukraine war briefing: Zelenskyy to pull Kyiv out of convention banning anti-personnel landmines - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 23:53:00 GMT"
    },
    {
      "title": "Russia unleashes its summer offensive with an army mired in problems - The Washington Post",
      "pubDate": "Mon, 30 Jun 2025 08:31:44 GMT"
    },
    {
      "title": "Russia Masses 50,000 Troops Around Sumy, Putting Ukraine in Precarious Position - WSJ",
      "pubDate": "Mon, 30 Jun 2025 01:30:39 GMT"
    },
    {
      "title": "Ukraine war live: Kyiv claims Moscow has lost 1 million troops - The Independent",
      "pubDate": "Mon, 30 Jun 2025 11:25:29 GMT"
    },
    {
      "title": "In Ukraine, most back negotiations over more fighting to end Russia’s war - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 12:22:30 GMT"
    },
    {
      "title": "Goldman upgrades drone play as Ukraine war shows future of defense - CNBC",
      "pubDate": "Mon, 30 Jun 2025 14:04:16 GMT"
    },
    {
      "title": "Smashing previous monthly record, Russia launches 5,337 kamikaze drones against Ukraine during June - The Kyiv Independent",
      "pubDate": "Mon, 30 Jun 2025 17:40:19 GMT"
    },
    {
      "title": "Ukraine war live: Kyiv claims advances in Sumy region ahead of counteroffensive - The Independent",
      "pubDate": "Mon, 30 Jun 2025 22:09:29 GMT"
    },
    {
      "title": "Russia's Largest Bombardment of Ukraine - NPR",
      "pubDate": "Mon, 30 Jun 2025 20:54:08 GMT"
    },
    {
      "title": "Why is Ukraine withdrawing from the Ottawa Treaty banning landmines? - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 16:46:23 GMT"
    },
    {
      "title": "The Future of Modern Warfare Is Being Built in Ukraine - Bloomberg.com",
      "pubDate": "Tue, 01 Jul 2025 04:00:00 GMT"
    },
    {
      "title": "Ukraine war briefing: Russia claims to have seized all of Luhansk region - The Guardian",
      "pubDate": "Tue, 01 Jul 2025 00:24:00 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Moscow claims first whole Ukrainian region after over three years of Putin’s war - The Independent",
      "pubDate": "Tue, 01 Jul 2025 06:55:14 GMT"
    },
    {
      "title": "Ukrainian drone strikes a Russian plant after record Russian drone attacks in June - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Tue, 01 Jul 2025 10:20:44 GMT"
    },
    {
      "title": "Three killed in Ukrainian drone attack on central Russia - BBC",
      "pubDate": "Tue, 01 Jul 2025 12:00:31 GMT"
    },
    {
      "title": "Ukraine shows footage of Bober drones hitting Russian air defenses, fighter jet in Crimea. - The Kyiv Independent",
      "pubDate": "Tue, 01 Jul 2025 09:52:15 GMT"
    },
    {
      "title": "Map Reveals Scale of Russia's Summer Offensive Against Ukraine - Newsweek",
      "pubDate": "Tue, 01 Jul 2025 15:32:46 GMT"
    },
    {
      "title": "Three dead as Ukrainian drone strike hits Russian plant - The Independent",
      "pubDate": "Tue, 01 Jul 2025 10:05:00 GMT"
    },
    {
      "title": "Pentagon halts weapons shipment to Ukraine amid concerns over U.S. stockpile - NBC News",
      "pubDate": "Tue, 01 Jul 2025 22:12:07 GMT"
    },
    {
      "title": "US halts some weapons shipments to Ukraine, White House says - BBC",
      "pubDate": "Wed, 02 Jul 2025 01:45:15 GMT"
    },
    {
      "title": "US Halts Key Ukraine Weapons Deliveries Amid Russian Barrage - Bloomberg",
      "pubDate": "Wed, 02 Jul 2025 01:22:00 GMT"
    },
    {
      "title": "Ukraine war latest: Drone attack deep in Russia; US halts weapon shipments - The Independent",
      "pubDate": "Wed, 02 Jul 2025 08:49:09 GMT"
    },
    {
      "title": "Ukraine war briefing: Ukraine launches one of its deepest drone strikes into Russia, killing three - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 08:54:00 GMT"
    },
    {
      "title": "Pause in U.S. Weapons Deepens Ukrainian Concerns as Russian Attacks Grow - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 11:35:44 GMT"
    },
    {
      "title": "Ukraine says it was not told U.S. halting military aid, as Russia intensifies attack - The Washington Post",
      "pubDate": "Wed, 02 Jul 2025 15:35:33 GMT"
    },
    {
      "title": "Russia ramps up offensives on 2 fronts in Ukraine as both sides seek an advantage before the fall - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Wed, 02 Jul 2025 13:58:53 GMT"
    },
    {
      "title": "Pentagon Under Scrutiny Over Decision to Halt Weapons to Ukraine - Bloomberg",
      "pubDate": "Wed, 02 Jul 2025 18:52:58 GMT"
    },
    {
      "title": "U.S. pauses some Ukraine weapons shipments; Kyiv scrambles to respond - The Washington Post",
      "pubDate": "Wed, 02 Jul 2025 19:11:18 GMT"
    },
    {
      "title": "U.S. Halts Key Weapons for Ukraine in New Sign of Weakening Support for Kyiv - WSJ",
      "pubDate": "Wed, 02 Jul 2025 11:11:00 GMT"
    },
    {
      "title": "Ukraine fears increased Russian aggression after US halt of weapons supply - BBC",
      "pubDate": "Wed, 02 Jul 2025 19:14:18 GMT"
    },
    {
      "title": "Russia ramps up its offensive, putting pressure on Ukraine’s reserve troops - AP News",
      "pubDate": "Wed, 02 Jul 2025 20:44:00 GMT"
    },
    {
      "title": "Air defense missiles among weaponry US is withholding from Ukraine, AP sources say - AP News",
      "pubDate": "Wed, 02 Jul 2025 21:25:00 GMT"
    },
    {
      "title": "US halts Ukraine-bound weapons already staged in Poland, WSJ reports - The Kyiv Independent",
      "pubDate": "Thu, 03 Jul 2025 07:46:23 GMT"
    },
    {
      "title": "Ukraine kills Russian navy's No. 2 commander in strike, but officials worry about Trump's military aid cuts - CBS News",
      "pubDate": "Thu, 03 Jul 2025 15:49:08 GMT"
    },
    {
      "title": "Russia continues record-setting aerial attacks, US cuts off arms shipments to Ukraine - USA Today",
      "pubDate": "Thu, 03 Jul 2025 20:13:54 GMT"
    },
    {
      "title": "Pentagon says it's pausing some military aid to Ukraine amid new attacks from Russia - NPR",
      "pubDate": "Thu, 03 Jul 2025 22:25:24 GMT"
    },
    {
      "title": "Russia launches large-scale missile, drone attack on Ukraine, striking residential building in Kyiv - The Kyiv Independent",
      "pubDate": "Thu, 03 Jul 2025 20:26:15 GMT"
    },
    {
      "title": "Ukraine-Russia war latest: Trump says Putin call ended in ‘no progress at all’ and defends weapon supply halt - The Independent",
      "pubDate": "Fri, 04 Jul 2025 04:42:18 GMT"
    },
    {
      "title": "Russia launches record number of drones at Ukraine after latest Trump-Putin phone call - CNN",
      "pubDate": "Fri, 04 Jul 2025 06:44:37 GMT"
    },
    {
      "title": "Ukraine drones damage power infrastructure in Sergiyev Posad near Moscow, Russia says - Reuters",
      "pubDate": "Fri, 04 Jul 2025 04:56:00 GMT"
    },
    {
      "title": "Kyiv hit by barrage of drone strikes as Putin spurns Trump's truce bid - BBC",
      "pubDate": "Fri, 04 Jul 2025 07:12:48 GMT"
    },
    {
      "title": "Russia Hits Ukraine With Large Air Barrage Hours After Trump-Putin Call - The New York Times",
      "pubDate": "Fri, 04 Jul 2025 09:43:53 GMT"
    },
    {
      "title": "Russia launches largest aerial attack on Ukraine's capital as pessimism grows over a Trump ceasefire - NBC News",
      "pubDate": "Fri, 04 Jul 2025 11:30:12 GMT"
    },
    {
      "title": "Russia pounds Kyiv with largest drone attack, hours after Trump-Putin call - Reuters",
      "pubDate": "Fri, 04 Jul 2025 12:40:03 GMT"
    },
    {
      "title": "US and Ukraine to work on strengthening air defences, Zelenskyy says, after call Trump says was ‘meaningful’ – Europe live - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 07:27:00 GMT"
    },
    {
      "title": "Russia hits Ukraine with largest aerial attack as Trump talks to Zelenskyy and Putin - NPR",
      "pubDate": "Fri, 04 Jul 2025 17:02:17 GMT"
    }
  ],
  "us_economy": [
    {
      "title": "S&P 500, Nasdaq Near Record Highs; 3 Stocks In Or Near Buy Zones - Investor's Business Daily",
      "pubDate": "Thu, 26 Jun 2025 21:42:00 GMT"
    },
    {
      "title": "As China Idles, Global Recession is the Risk if the US Economy Falters - tastylive",
      "pubDate": "Thu, 26 Jun 2025 22:46:39 GMT"
    },
    {
      "title": "US economy contracts for first time in three years amid pre-tariff import surge - The Vibes",
      "pubDate": "Fri, 27 Jun 2025 02:17:00 GMT"
    },
    {
      "title": "Trump economic advisor warns of recession if ‘big, beautiful bill’ is delayed - The Hill",
      "pubDate": "Fri, 27 Jun 2025 03:01:00 GMT"
    },
    {
      "title": "US, China formalize deal on rare earth shipments in trade breakthrough - CNN",
      "pubDate": "Fri, 27 Jun 2025 07:50:00 GMT"
    },
    {
      "title": "China Confirms Trade Framework With U.S. to Lift Export Controls - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 11:13:49 GMT"
    },
    {
      "title": "US economy shrank more than initially estimated in Q1 - Jamaica Gleaner",
      "pubDate": "Fri, 27 Jun 2025 05:11:08 GMT"
    },
    {
      "title": "S&P 500 rises to new record on trade deal hopes, capping remarkable comeback from April lows: Live updates - CNBC",
      "pubDate": "Fri, 27 Jun 2025 14:27:00 GMT"
    },
    {
      "title": "U.S. economy shrinks as Americans spend less - Star Tribune",
      "pubDate": "Fri, 27 Jun 2025 16:02:31 GMT"
    },
    {
      "title": "S&P 500 hits new high but cracks appear in US economy - thenationalnews.com",
      "pubDate": "Fri, 27 Jun 2025 15:30:41 GMT"
    },
    {
      "title": "Biggest US banks pass Federal Reserve stress tests - Financial Times",
      "pubDate": "Fri, 27 Jun 2025 20:30:59 GMT"
    },
    {
      "title": "U.S. Economy Shrugs Off Trade War and Soldiers On - WSJ",
      "pubDate": "Sat, 28 Jun 2025 01:26:00 GMT"
    },
    {
      "title": "3 signs the economy is in worse shape than we thought - Business Insider",
      "pubDate": "Sat, 28 Jun 2025 08:10:00 GMT"
    },
    {
      "title": "That Drop in Consumer Income in May Was a False Recession Alarm - Wolf Street",
      "pubDate": "Sat, 28 Jun 2025 10:04:10 GMT"
    },
    {
      "title": "The U.S. Economy Shrank Faster Than Estimated - news8000.com",
      "pubDate": "Sat, 28 Jun 2025 23:23:00 GMT"
    },
    {
      "title": "Fed official sends strong message on interest rate cuts - TheStreet",
      "pubDate": "Sun, 29 Jun 2025 13:03:00 GMT"
    },
    {
      "title": "Startups Starved of Cash - Bloomberg",
      "pubDate": "Sun, 29 Jun 2025 22:08:30 GMT"
    },
    {
      "title": "Trump's 'Big Beautiful Bill' clears Senate hurdle: What's inside the GOP's controversial push to reshape US ec - India TV News",
      "pubDate": "Sun, 29 Jun 2025 16:22:20 GMT"
    },
    {
      "title": "Trump's budget: Nearly 12 million estimated to lose health coverage, says CBO - BBC",
      "pubDate": "Sun, 29 Jun 2025 22:01:03 GMT"
    },
    {
      "title": "US economy today: Growth slows as tariff and debt risks loom - Fingerlakes1.com",
      "pubDate": "Mon, 30 Jun 2025 09:47:06 GMT"
    },
    {
      "title": "US stocks add more gains to their all-time high - LancasterOnline",
      "pubDate": "Mon, 30 Jun 2025 13:33:30 GMT"
    },
    {
      "title": "Did Arizona fall into recession last year? Here’s a look - AZ Big Media",
      "pubDate": "Mon, 30 Jun 2025 13:37:41 GMT"
    },
    {
      "title": "Trump attacks Fed again in open letter calling for lower rates - Axios",
      "pubDate": "Mon, 30 Jun 2025 20:15:00 GMT"
    },
    {
      "title": "How Trump’s big bill could leave states scrambling to cover federal funding cuts - AP News",
      "pubDate": "Mon, 30 Jun 2025 21:12:00 GMT"
    },
    {
      "title": "Sharp HealthCare to lay off 315 employees due to economic challenges - cbs8.com",
      "pubDate": "Tue, 01 Jul 2025 01:12:00 GMT"
    },
    {
      "title": "Federal Reserve Holds Rates Amid Political Pressure and Economic Uncertainty - AInvest",
      "pubDate": "Tue, 01 Jul 2025 02:37:35 GMT"
    },
    {
      "title": "Goldman Sachs raises Fed rate cut forecast to three in 2025 - Reuters",
      "pubDate": "Tue, 01 Jul 2025 08:52:04 GMT"
    },
    {
      "title": "Banks say Trump’s ‘big beautiful bill’ could boost the U.S. economy – despite deficit concerns - CNBC",
      "pubDate": "Tue, 01 Jul 2025 06:16:57 GMT"
    },
    {
      "title": "US economy in meltdown as dollar suffers its worst six months since 1973 - Daily Express",
      "pubDate": "Tue, 01 Jul 2025 09:40:00 GMT"
    },
    {
      "title": "Powell confirms that the Fed would have cut by now were it not for tariffs - CNBC",
      "pubDate": "Tue, 01 Jul 2025 13:57:35 GMT"
    },
    {
      "title": "Federal Reserve chair blames Trump’s tariffs for preventing interest rates cut - The Guardian",
      "pubDate": "Tue, 01 Jul 2025 15:21:15 GMT"
    },
    {
      "title": "Why is the US dollar falling by record levels in 2025? - Al Jazeera",
      "pubDate": "Tue, 01 Jul 2025 13:41:15 GMT"
    },
    {
      "title": "US ISM manufacturing rises to 49.0, fourth month of contraction - Action Forex",
      "pubDate": "Tue, 01 Jul 2025 14:13:42 GMT"
    },
    {
      "title": "Trump Is Setting the U.S. Economy Up for Another Great Financial Crisis - In These Times",
      "pubDate": "Tue, 01 Jul 2025 18:00:00 GMT"
    },
    {
      "title": "US personal income drops for first time since 2021, raising recession concerns - KUTV",
      "pubDate": "Wed, 02 Jul 2025 02:32:03 GMT"
    },
    {
      "title": "Medicaid cuts in Trump's 'big beautiful bill' will leave millions uninsured, threaten rural hospitals - CNBC",
      "pubDate": "Tue, 01 Jul 2025 19:57:47 GMT"
    },
    {
      "title": "US economy 'on wobbly footing': Why Wall Street strategists are cautious about stock market's recent records - AOL.com",
      "pubDate": "Tue, 01 Jul 2025 19:03:24 GMT"
    },
    {
      "title": "US private sector lost 33,000 jobs in June, missing expectations for an increase of 115,000 - CNN",
      "pubDate": "Wed, 02 Jul 2025 14:36:00 GMT"
    },
    {
      "title": "The U.S. dollar has fallen at the fastest clip since 1973. Here's what that means. - NBC News",
      "pubDate": "Wed, 02 Jul 2025 21:06:00 GMT"
    },
    {
      "title": "As the Fourth of July approaches, here are 4 reasons why ‘American exceptionalism’ isn’t going away - MarketWatch",
      "pubDate": "Wed, 02 Jul 2025 19:52:00 GMT"
    },
    {
      "title": "How Health Care Remade the U.S. Economy - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 06:17:27 GMT"
    },
    {
      "title": "US economy blasts through expectations to add 147,000 jobs - Financial Times",
      "pubDate": "Thu, 03 Jul 2025 12:32:59 GMT"
    },
    {
      "title": "US economy adds 147,000 jobs in June, surpassing expectations amid Trump trade war - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 12:46:00 GMT"
    },
    {
      "title": "The US economy added a stronger-than-expected 147,000 jobs in June and the unemployment rate fell to 4.1% - CNN",
      "pubDate": "Thu, 03 Jul 2025 15:20:00 GMT"
    },
    {
      "title": "Solid Jobs Report Keeps Fed Rate Cuts at Bay - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 15:12:43 GMT"
    },
    {
      "title": "Solid US job numbers mask weakness underneath - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 17:05:15 GMT"
    },
    {
      "title": "Dow jumps more than 300 points, S&P 500 sets new record after strong June jobs report: Live updates - CNBC",
      "pubDate": "Thu, 03 Jul 2025 17:20:00 GMT"
    },
    {
      "title": "Jobs Report: Fed Rate Cut Odds Sink As Unemployment Falls; S&P 500 Rises (Live Coverage) - Investor's Business Daily",
      "pubDate": "Thu, 03 Jul 2025 13:48:00 GMT"
    },
    {
      "title": "Steady job market keeps Fed on hold amid tariff uncertainty - Reuters",
      "pubDate": "Thu, 03 Jul 2025 17:37:52 GMT"
    },
    {
      "title": "The US economy under Donald Trump - The Economist",
      "pubDate": "Thu, 03 Jul 2025 19:51:40 GMT"
    },
    {
      "title": "What have tariffs really done to the US economy? - BBC",
      "pubDate": "Thu, 03 Jul 2025 23:03:53 GMT"
    },
    {
      "title": "The U.S. added 147,000 jobs in June, relieving some concerns of a workforce slowdown - NBC News",
      "pubDate": "Thu, 03 Jul 2025 14:35:00 GMT"
    },
    {
      "title": "Steady Hiring Added 147,000 Jobs to U.S. Economy in June - WSJ",
      "pubDate": "Thu, 03 Jul 2025 18:44:00 GMT"
    },
    {
      "title": "Jobs Report Live Updates: U.S. Hiring Remains Solid as Unemployment Rate Falls - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 23:59:06 GMT"
    },
    {
      "title": "US Economy Defies Forecasts With Strong Job Growth as Private Sector Weakens - International Business Times UK",
      "pubDate": "Thu, 03 Jul 2025 22:31:47 GMT"
    },
    {
      "title": "Trump tax bill averts one debt crisis but makes future financial woes worse - Reuters",
      "pubDate": "Thu, 03 Jul 2025 22:49:02 GMT"
    },
    {
      "title": "Trump’s Medicaid cuts are coming for rural Americans: ‘It’s going to have to hit them first’ - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 11:02:00 GMT"
    },
    {
      "title": "Trump’s tax cuts: Who will it benefit? - NewsNation",
      "pubDate": "Fri, 04 Jul 2025 11:13:19 GMT"
    },
    {
      "title": "Trump’s Big Beautiful Bill explained: What NRIs need to know about remittances, rentals, and property investments - Hindustan Times",
      "pubDate": "Fri, 04 Jul 2025 05:03:11 GMT"
    },
    {
      "title": "Trump says Powell costs US $900B a year in interest by not cutting rates. Is he right? - USA Today",
      "pubDate": "Fri, 04 Jul 2025 16:27:02 GMT"
    }
  ],
  "china": [
    {
      "title": "Trump says a deal related to trade was signed with China on Wednesday - Reuters",
      "pubDate": "Thu, 26 Jun 2025 20:31:39 GMT"
    },
    {
      "title": "China's industrial profits plunge 9.1%, steepest fall in seven months - CNBC",
      "pubDate": "Fri, 27 Jun 2025 01:40:00 GMT"
    },
    {
      "title": "Lutnick Says US-China Trade Truce Signed, 10 Deals Imminent - Bloomberg",
      "pubDate": "Fri, 27 Jun 2025 06:17:00 GMT"
    },
    {
      "title": "China, U.S. confirm details of their trade deal, Beijing says - CNBC",
      "pubDate": "Fri, 27 Jun 2025 07:08:36 GMT"
    },
    {
      "title": "China’s Top Diplomat to Visit Europe as Tensions With US Linger - Bloomberg",
      "pubDate": "Fri, 27 Jun 2025 08:25:24 GMT"
    },
    {
      "title": "US says deal with Beijing will expedite rare earth exports from China - Reuters",
      "pubDate": "Fri, 27 Jun 2025 07:56:35 GMT"
    },
    {
      "title": "China Confirms US Trade Framework, Vows to Review Exports - Bloomberg",
      "pubDate": "Fri, 27 Jun 2025 08:15:43 GMT"
    },
    {
      "title": "China Issues Update After Trump Reveals Trade Deal - Newsweek",
      "pubDate": "Fri, 27 Jun 2025 08:01:58 GMT"
    },
    {
      "title": "Has Trump struck a trade deal with China – and what about other countries? - Al Jazeera",
      "pubDate": "Fri, 27 Jun 2025 14:24:32 GMT"
    },
    {
      "title": "China Confirms Breakthrough on Rare-Earth Exports to U.S. - WSJ",
      "pubDate": "Fri, 27 Jun 2025 10:17:00 GMT"
    },
    {
      "title": "China Makes Another High-Speed Rail Breakthrough - Newsweek",
      "pubDate": "Fri, 27 Jun 2025 16:14:34 GMT"
    },
    {
      "title": "U.S. and China Confirm Trade Agreement, Lutnick Says 10 More Deals on the Way - Barron's",
      "pubDate": "Fri, 27 Jun 2025 17:12:00 GMT"
    },
    {
      "title": "China’s threat to Tibet’s future should be a global concern - The Hill",
      "pubDate": "Fri, 27 Jun 2025 19:00:00 GMT"
    },
    {
      "title": "China tightens EV battery safety rules, led by CATL and BYD - Nikkei Asia",
      "pubDate": "Fri, 27 Jun 2025 17:11:00 GMT"
    },
    {
      "title": "Deal with Beijing will speed China’s export of minerals to the US, treasury secretary says - AP News",
      "pubDate": "Fri, 27 Jun 2025 16:13:00 GMT"
    },
    {
      "title": "Flood-hit China expands social security net as extreme rain takes toll - Reuters",
      "pubDate": "Sat, 28 Jun 2025 03:55:00 GMT"
    },
    {
      "title": "Cloudy with a chance of bankruptcy: US tariffs hurt China’s solar firms - South China Morning Post",
      "pubDate": "Sat, 28 Jun 2025 03:00:11 GMT"
    },
    {
      "title": "China’s stablecoin edge? WeChat and Alipay, says top economist - South China Morning Post",
      "pubDate": "Sat, 28 Jun 2025 06:00:17 GMT"
    },
    {
      "title": "Why is China building AI centres on the roof of the world? - South China Morning Post",
      "pubDate": "Sat, 28 Jun 2025 08:00:20 GMT"
    },
    {
      "title": "China Steps Up Flood Aid as Threat of Extreme Rains Loom - Bloomberg.com",
      "pubDate": "Sat, 28 Jun 2025 10:42:52 GMT"
    },
    {
      "title": "China ‘planned car collision’ during Taiwan vice-president’s visit to Prague - The Guardian",
      "pubDate": "Sat, 28 Jun 2025 14:11:00 GMT"
    },
    {
      "title": "Heavy rain hits China's flood-stricken Guizhou for second time in a week - Reuters",
      "pubDate": "Sat, 28 Jun 2025 10:41:18 GMT"
    },
    {
      "title": "Canada orders China's Hikvision to close Canadian operations - Reuters",
      "pubDate": "Sat, 28 Jun 2025 11:54:26 GMT"
    },
    {
      "title": "How China could shut down auto factories around the world - CNBC",
      "pubDate": "Sat, 28 Jun 2025 12:00:01 GMT"
    },
    {
      "title": "Tesla Has Big Plans in China - Crude Oil Prices Today | OilPrice.com",
      "pubDate": "Sat, 28 Jun 2025 17:00:00 GMT"
    },
    {
      "title": "China’s rare earth curbs spur overseas projects, says US developer - South China Morning Post",
      "pubDate": "Sun, 29 Jun 2025 01:30:10 GMT"
    },
    {
      "title": "China’s humanoid robots generate more soccer excitement than their human counterparts - AP News",
      "pubDate": "Sun, 29 Jun 2025 04:29:00 GMT"
    },
    {
      "title": "China warns countries not to sign US trade deals at its expense - South China Morning Post",
      "pubDate": "Sun, 29 Jun 2025 07:06:00 GMT"
    },
    {
      "title": "China Reiterates Opposition to Any Trade Deals at Its Expense - Bloomberg.com",
      "pubDate": "Sun, 29 Jun 2025 02:14:00 GMT"
    },
    {
      "title": "China's suppressed crypto demand is spilling over into these stocks - CNBC",
      "pubDate": "Sun, 29 Jun 2025 11:16:12 GMT"
    },
    {
      "title": "The Iran-China-Russia Axis Crumbles When It Matters - The Atlantic",
      "pubDate": "Sun, 29 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "China to invite Trump to Sept. military parade marking WWII victory - Kyodo News+ | Japan's leading news agency.",
      "pubDate": "Sun, 29 Jun 2025 12:07:06 GMT"
    },
    {
      "title": "One American’s Two-Year Quest to Move His Business Out of China - WSJ",
      "pubDate": "Sun, 29 Jun 2025 15:30:45 GMT"
    },
    {
      "title": "China’s Envoy Urges Australia to Resist US Pressure on Military Spending - Bloomberg",
      "pubDate": "Mon, 30 Jun 2025 00:04:00 GMT"
    },
    {
      "title": "China’s Scorching Heat Poses Summer Test for Electricity Grid - Bloomberg",
      "pubDate": "Mon, 30 Jun 2025 01:43:16 GMT"
    },
    {
      "title": "China Factory Activity Decline Eases Again After Trade Truce - Bloomberg",
      "pubDate": "Mon, 30 Jun 2025 01:43:00 GMT"
    },
    {
      "title": "China resumes seafood imports from some Japan regions - CNN",
      "pubDate": "Mon, 30 Jun 2025 02:39:00 GMT"
    },
    {
      "title": "China Shows Off Tech Resilience in Face of Trump Export Controls - Bloomberg",
      "pubDate": "Mon, 30 Jun 2025 05:21:00 GMT"
    },
    {
      "title": "China partially lifts ban on Japanese seafood imports - BBC",
      "pubDate": "Mon, 30 Jun 2025 06:36:24 GMT"
    },
    {
      "title": "China Home Sales Slump Persists as Calls Grow for More Stimulus - Bloomberg.com",
      "pubDate": "Mon, 30 Jun 2025 11:23:31 GMT"
    },
    {
      "title": "China Builds New Large Jet-Powered Ekranoplan - navalnews.com",
      "pubDate": "Mon, 30 Jun 2025 06:00:08 GMT"
    },
    {
      "title": "China claims Canada’s order for Hikvision closure ‘damages’ trade relations - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 14:58:47 GMT"
    },
    {
      "title": "China coffee giant Luckin opens its first U.S. stores in New York City - CBS News",
      "pubDate": "Mon, 30 Jun 2025 15:50:52 GMT"
    },
    {
      "title": "China’s Communist Party Now Has 100 Million Members. Many Are in It for the Paycheck. - WSJ",
      "pubDate": "Mon, 30 Jun 2025 13:00:00 GMT"
    },
    {
      "title": "China unveils its new 'graphite bomb' — here's how they work - The Kyiv Independent",
      "pubDate": "Mon, 30 Jun 2025 14:16:52 GMT"
    },
    {
      "title": "Xi Jinping's Absence Signals Power Shift? Intel Sources Warn China's Internal Turmoil May Spill Over To LAC - News18",
      "pubDate": "Mon, 30 Jun 2025 22:04:00 GMT"
    },
    {
      "title": "China's June factory activity unexpectedly expands, private survey shows - CNBC",
      "pubDate": "Tue, 01 Jul 2025 02:03:00 GMT"
    },
    {
      "title": "China's factory activity returns to growth in June, Caixin PMI shows - Reuters",
      "pubDate": "Tue, 01 Jul 2025 01:53:00 GMT"
    },
    {
      "title": "China sanctions former Philippines senator, foreign ministry says - Reuters",
      "pubDate": "Tue, 01 Jul 2025 02:16:00 GMT"
    },
    {
      "title": "China ready to discuss tariffs and subsidies with US at WTO - Reuters",
      "pubDate": "Tue, 01 Jul 2025 08:20:05 GMT"
    },
    {
      "title": "China Vows to Rein In Intense Competition, Build Unified Market - Bloomberg.com",
      "pubDate": "Tue, 01 Jul 2025 08:50:52 GMT"
    },
    {
      "title": "China Raises Quota for Foreign Investment, Ending 13-Month Pause - Bloomberg",
      "pubDate": "Tue, 01 Jul 2025 04:37:00 GMT"
    },
    {
      "title": "China sanctions former Filipino lawmaker who defended Philippines' South China Sea claims - AP News",
      "pubDate": "Tue, 01 Jul 2025 07:30:00 GMT"
    },
    {
      "title": "China is using pollution as a geopolitical weapon, and the US must respond - The Hill",
      "pubDate": "Tue, 01 Jul 2025 14:00:00 GMT"
    },
    {
      "title": "China Issues Update on 'Complicated' Border Tensions With India - Newsweek",
      "pubDate": "Tue, 01 Jul 2025 15:58:02 GMT"
    },
    {
      "title": "China’s giant new gamble with digital IDs - The Economist",
      "pubDate": "Tue, 01 Jul 2025 14:31:04 GMT"
    },
    {
      "title": "How Rare Earths Became China’s Top Trade Weapon - Foreign Policy",
      "pubDate": "Tue, 01 Jul 2025 17:53:23 GMT"
    },
    {
      "title": "Justice Department says 2 Chinese nationals charged with spying inside the US for Beijing - AP News",
      "pubDate": "Tue, 01 Jul 2025 17:57:00 GMT"
    },
    {
      "title": "Senate votes to send 2 million US jobs to China, increase deficit, energy costs - Electrek",
      "pubDate": "Tue, 01 Jul 2025 19:21:00 GMT"
    },
    {
      "title": "China boosts tech outreach to Global South as US collaboration dips: analysts - South China Morning Post",
      "pubDate": "Tue, 01 Jul 2025 21:44:14 GMT"
    },
    {
      "title": "Oregon man among 2 charged in alleged Chinese spy operation targeting U.S. military - KPTV",
      "pubDate": "Tue, 01 Jul 2025 19:32:00 GMT"
    },
    {
      "title": "Two Chinese nationals charged for trying to recruit spies in US military - Al Jazeera",
      "pubDate": "Wed, 02 Jul 2025 00:26:54 GMT"
    },
    {
      "title": "China's Huawei must face US criminal charges, judge rules - Reuters",
      "pubDate": "Tue, 01 Jul 2025 18:14:17 GMT"
    },
    {
      "title": "Major Chinese Ports Keep Iranian Oil Flowing Despite Sanctions - Bloomberg",
      "pubDate": "Wed, 02 Jul 2025 03:44:47 GMT"
    },
    {
      "title": "US judge says China's Huawei Technologies must face criminal case for racketeering and other charges - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Wed, 02 Jul 2025 09:45:00 GMT"
    },
    {
      "title": "China calls for better communications with EU, urges respect for core interests - Reuters",
      "pubDate": "Wed, 02 Jul 2025 12:35:20 GMT"
    },
    {
      "title": "Mainland China chipmaking capacity to outstrip Taiwan by 2030: report - South China Morning Post",
      "pubDate": "Wed, 02 Jul 2025 13:00:14 GMT"
    },
    {
      "title": "China will invade Siberia, not Taiwan - The Hill",
      "pubDate": "Wed, 02 Jul 2025 15:30:00 GMT"
    },
    {
      "title": "Beijing Braces for US Trade Deals That Seek to Shut Out China - Bloomberg",
      "pubDate": "Wed, 02 Jul 2025 15:56:24 GMT"
    },
    {
      "title": "A more complicated kind of kill chain is making China's missiles a deadlier problem for US forces, a top general says - Business Insider",
      "pubDate": "Wed, 02 Jul 2025 18:20:00 GMT"
    },
    {
      "title": "EU presses China on rare earths and Ukraine war - Reuters",
      "pubDate": "Wed, 02 Jul 2025 21:02:25 GMT"
    },
    {
      "title": "US-Vietnam Trade Deal Raises Risk of China Retaliation, BE Says - Bloomberg.com",
      "pubDate": "Thu, 03 Jul 2025 00:14:00 GMT"
    },
    {
      "title": "US Lifts Chip Design Curbs On China as Part of Trade Deal - Bloomberg.com",
      "pubDate": "Thu, 03 Jul 2025 02:35:00 GMT"
    },
    {
      "title": "China says Premier Li to visit Egypt after BRICS Brazil trip - The New Arab",
      "pubDate": "Thu, 03 Jul 2025 02:23:19 GMT"
    },
    {
      "title": "China’s north and west on red alert for heavy rains after deadly floods - Al Jazeera",
      "pubDate": "Thu, 03 Jul 2025 06:56:15 GMT"
    },
    {
      "title": "US lifts chip design software curbs against China following London trade talks - CNN",
      "pubDate": "Thu, 03 Jul 2025 07:12:00 GMT"
    },
    {
      "title": "Taiwan Readies Soldiers, Civilians for Largest China Invasion Drills - Newsweek",
      "pubDate": "Thu, 03 Jul 2025 12:15:21 GMT"
    },
    {
      "title": "China Vows to Increase Oversight of Wayward Solar Sector - Bloomberg",
      "pubDate": "Thu, 03 Jul 2025 14:52:44 GMT"
    },
    {
      "title": "China, US ease export curbs but Trump’s Vietnam deal risks blowback: analysts - South China Morning Post",
      "pubDate": "Thu, 03 Jul 2025 15:00:10 GMT"
    },
    {
      "title": "How Trump’s Trade Deal With Vietnam Is Really About China | U.S. News Decision Points | U.S. News - U.S. News & World Report",
      "pubDate": "Thu, 03 Jul 2025 20:34:08 GMT"
    },
    {
      "title": "China Works to Dominate in AI and EV - NPR",
      "pubDate": "Thu, 03 Jul 2025 20:07:04 GMT"
    },
    {
      "title": "Exclusive | China tells EU it cannot afford Russian loss in Ukraine war, sources say - South China Morning Post",
      "pubDate": "Thu, 03 Jul 2025 17:53:54 GMT"
    },
    {
      "title": "China's foreign minister tells EU that Beijing cannot afford Russia to lose in Ukraine, media reports - The Kyiv Independent",
      "pubDate": "Thu, 03 Jul 2025 23:06:41 GMT"
    },
    {
      "title": "Opinion | How Trump’s ‘Big, Beautiful Bill’ Will Make China Great Again - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 19:27:16 GMT"
    },
    {
      "title": "China, U.S. Speeding Up Trade Truce, Chinese Commerce Ministry Says - WSJ",
      "pubDate": "Fri, 04 Jul 2025 04:37:33 GMT"
    },
    {
      "title": "China Plans Nationwide Subsidies to Boost Birthrate - Bloomberg.com",
      "pubDate": "Fri, 04 Jul 2025 04:59:00 GMT"
    },
    {
      "title": "China's Disappearing Generals Put Questions Over Xi's Grip - Newsweek",
      "pubDate": "Fri, 04 Jul 2025 08:04:24 GMT"
    },
    {
      "title": "China issues fresh warning over Trump’s trade war - The Independent",
      "pubDate": "Fri, 04 Jul 2025 14:13:00 GMT"
    },
    {
      "title": "China's first homemade aircraft carrier sails into Hong Kong in a show of military prowess - NBC News",
      "pubDate": "Fri, 04 Jul 2025 08:15:09 GMT"
    },
    {
      "title": "China Is Not Ready for Global Leadership - Foreign Policy",
      "pubDate": "Fri, 04 Jul 2025 11:31:37 GMT"
    },
    {
      "title": "China tells EU it can’t accept Russia losing its war against Ukraine, official says - CNN",
      "pubDate": "Fri, 04 Jul 2025 16:38:00 GMT"
    },
    {
      "title": "China Warns India to Choose Its Words Carefully on Dalai Lama and Tibet - WSJ",
      "pubDate": "Fri, 04 Jul 2025 18:06:00 GMT"
    }
  ],
  "world_news": [
    {
      "title": "US Used 20% Of Its THAAD Missiles To Defend Israel For 12 Days: Report - NDTV",
      "pubDate": "Sat, 28 Jun 2025 12:35:11 GMT"
    },
    {
      "title": "LIVE: Israel bombards Gaza City after issuing forced displacement threats - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 09:22:30 GMT"
    },
    {
      "title": "Israeli attack on a cafe in Gaza kills 30 Palestinians - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 15:06:18 GMT"
    },
    {
      "title": "Israel Has Agreed To Conditions To Finalise 60-Day Gaza Ceasefire: Trump - NDTV",
      "pubDate": "Tue, 01 Jul 2025 22:56:54 GMT"
    }
  ],
  "us_politics": [
    {
      "title": "Senators diverge sharply on damage done by Iran strikes after classified briefing - Huron Daily Tribune",
      "pubDate": "Thu, 26 Jun 2025 20:37:30 GMT"
    },
    {
      "title": "Senate Republicans Reprise Push to Pay for Tax Cuts by Slashing Food Stamps - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 03:03:37 GMT"
    },
    {
      "title": "House GOP holdouts threaten revolt over Trump and Senate’s tax bill - The Washington Post",
      "pubDate": "Fri, 27 Jun 2025 04:32:45 GMT"
    },
    {
      "title": "Republicans Prepare to Open ‘Pandora’s Box’ of Budget Gimmicks - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 09:02:08 GMT"
    },
    {
      "title": "Senate to vote on Trump's war powers today as lawmakers get delayed briefing on Iran strikes - CBS News",
      "pubDate": "Fri, 27 Jun 2025 10:00:04 GMT"
    },
    {
      "title": "Supreme Court Fails to Sway Democrats on Gender Treatment Laws - The Dispatch",
      "pubDate": "Fri, 27 Jun 2025 06:48:15 GMT"
    },
    {
      "title": "Supreme Court Rules on Birthright Citizenship: What to Know - Newsweek",
      "pubDate": "Fri, 27 Jun 2025 09:51:55 GMT"
    },
    {
      "title": "Supreme Court allows states to cut off Medicaid funding for Planned Parenthood - The Washington Post",
      "pubDate": "Fri, 27 Jun 2025 14:50:32 GMT"
    },
    {
      "title": "Senate Democrats question \"obliteration\" of Iran's nuclear sites after classified briefing on strikes - CBS News",
      "pubDate": "Fri, 27 Jun 2025 11:40:42 GMT"
    },
    {
      "title": "Supreme Court preserves Obamacare coverage of preventive health care - Politico",
      "pubDate": "Fri, 27 Jun 2025 14:54:34 GMT"
    },
    {
      "title": "Live updates: Senate votes against war powers resolution; Trump ends trade discussions with Canada - NBC News",
      "pubDate": "Sat, 28 Jun 2025 00:10:00 GMT"
    },
    {
      "title": "Senate Republicans eye weekend votes on Trump's massive bill as tensions run high - NBC News",
      "pubDate": "Fri, 27 Jun 2025 21:09:42 GMT"
    },
    {
      "title": "Senate rejects push to rein in Trump on Iran - Politico",
      "pubDate": "Fri, 27 Jun 2025 21:56:51 GMT"
    },
    {
      "title": "Trump may name a ‘shadow’ Fed chair, an unprecedented development in American history - CNN",
      "pubDate": "Fri, 27 Jun 2025 21:12:00 GMT"
    },
    {
      "title": "US Senate rejects bid to curb Trump's Iran war powers - Reuters",
      "pubDate": "Fri, 27 Jun 2025 23:40:34 GMT"
    },
    {
      "title": "Senate rejects effort to restrain Trump on Iran as GOP backs his strikes on nuclear sites - The Globe and Mail",
      "pubDate": "Fri, 27 Jun 2025 23:34:46 GMT"
    },
    {
      "title": "Morale craters at State Department as mass layoffs loom - The Washington Post",
      "pubDate": "Sat, 28 Jun 2025 11:30:58 GMT"
    },
    {
      "title": "Senate Republicans Revise Trump’s Policy Bill, Scrounging for Votes to Pass It - The New York Times",
      "pubDate": "Sat, 28 Jun 2025 15:05:10 GMT"
    },
    {
      "title": "Senate Republicans make steep cuts to wind and solar in updated megabill text - Politico",
      "pubDate": "Sat, 28 Jun 2025 13:36:20 GMT"
    },
    {
      "title": "Senate aims to hold initial vote today on Trump's \"big, beautiful bill\" - CBS News",
      "pubDate": "Sat, 28 Jun 2025 11:05:00 GMT"
    },
    {
      "title": "How the Supreme Court’s Injunction Ruling Expands Trump’s Power - The New York Times",
      "pubDate": "Sat, 28 Jun 2025 09:03:47 GMT"
    },
    {
      "title": "Updated Senate bill slashes wind and solar incentives – and adds a new tax - The Hill",
      "pubDate": "Sat, 28 Jun 2025 19:53:00 GMT"
    },
    {
      "title": "What's in the Senate’s version of Trump's budget bill — and who stands to benefit - CNBC",
      "pubDate": "Sat, 28 Jun 2025 19:57:28 GMT"
    },
    {
      "title": "Senate GOP tweaks health care measures in tax bill to win holdouts, please parliamentarian - STAT",
      "pubDate": "Sat, 28 Jun 2025 17:57:03 GMT"
    },
    {
      "title": "Senate Republicans scrambling to pass tax-and-spend bill by Trump deadline - The Guardian",
      "pubDate": "Sat, 28 Jun 2025 22:04:00 GMT"
    },
    {
      "title": "Senate Republicans vote to take up Trump’s tax bill, overcoming resistance in their ranks - The Washington Post",
      "pubDate": "Sun, 29 Jun 2025 04:31:55 GMT"
    },
    {
      "title": "Trump's 'Big Beautiful Bill' advances, but still faces Republican dissent - BBC",
      "pubDate": "Sun, 29 Jun 2025 03:39:27 GMT"
    },
    {
      "title": "Senate Narrowly Advances Trump’s Tax and Spending Megabill - WSJ",
      "pubDate": "Sun, 29 Jun 2025 04:57:00 GMT"
    },
    {
      "title": "Senate debates Trump's major tax, Medicaid, border bill after dramatic vote: Live updates - USA Today",
      "pubDate": "Sun, 29 Jun 2025 11:27:55 GMT"
    },
    {
      "title": "G.O.P. Bill Has $1.1 Trillion in Health Cuts and 11.8 Million Losing Care, C.B.O. Says - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 14:28:53 GMT"
    },
    {
      "title": "Senate Version of Trump’s Policy Bill Would Slash Medicaid Spending Even More - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 14:28:53 GMT"
    },
    {
      "title": "Thom Tillis, Republican Senator, Won’t Seek Re-election Amid Trump’s Primary Threats - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 18:12:31 GMT"
    },
    {
      "title": "Senate Gridlock and Investment: Navigating Political Risks in Healthcare and Infrastructure - AInvest",
      "pubDate": "Sun, 29 Jun 2025 18:11:49 GMT"
    },
    {
      "title": "Senate opens debate on Trump’s bill estimated to add $3.3tn to US debt - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 22:34:00 GMT"
    },
    {
      "title": "US Senate pushes ahead on Trump tax cuts as nonpartisan analysis raises price tag - Reuters",
      "pubDate": "Sun, 29 Jun 2025 23:13:49 GMT"
    },
    {
      "title": "Chris Murphy calls birthright citizenship ruling ‘dangerous’ - Politico",
      "pubDate": "Sun, 29 Jun 2025 19:58:34 GMT"
    },
    {
      "title": "Senate Bill Would Add at Least $3.3 Trillion to Debt, Budget Office Says - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 16:25:00 GMT"
    },
    {
      "title": "Republicans struggle to pass Trump’s ‘big, beautiful bill’ as debate drags on - Financial Times",
      "pubDate": "Sun, 29 Jun 2025 16:33:48 GMT"
    },
    {
      "title": "Republican senator quits over ‘big beautiful’ Bill - The Telegraph",
      "pubDate": "Sun, 29 Jun 2025 20:48:00 GMT"
    },
    {
      "title": "US Senate begins debate on Trump’s ‘Big, Beautiful Bill’ - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 03:08:43 GMT"
    },
    {
      "title": "Senate advances Trump plan to gut social programs to benefit the super-rich - World Socialist Web Site",
      "pubDate": "Mon, 30 Jun 2025 03:29:51 GMT"
    },
    {
      "title": "Senate to begin 'vote-a-rama' on GOP bill and two firefighters killed in ambush: Morning Rundown - NBC News",
      "pubDate": "Mon, 30 Jun 2025 11:07:26 GMT"
    },
    {
      "title": "Senate wrangles over Trump’s ‘one big beautiful bill’ to continue – US politics live - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 09:32:00 GMT"
    },
    {
      "title": "Live: Senate heads to final vote on Trump tax and Medicaid cuts - USA Today",
      "pubDate": "Mon, 30 Jun 2025 13:43:50 GMT"
    },
    {
      "title": "Senate version of Trump's \"big, beautiful bill\" would pummel renewable energy industry with new tax - CBS News",
      "pubDate": "Mon, 30 Jun 2025 18:08:03 GMT"
    },
    {
      "title": "What’s in the Senate’s version of Trump’s ‘big beautiful bill’? Tax cuts, Medicaid changes, immigration and more - NBC News",
      "pubDate": "Mon, 30 Jun 2025 21:03:41 GMT"
    },
    {
      "title": "Republicans and Democrats buck party lines in marathon votes for Trump megabill - The Hill",
      "pubDate": "Mon, 30 Jun 2025 23:14:00 GMT"
    },
    {
      "title": "Senate considers ditching the EV tax credit even earlier than planned - NPR",
      "pubDate": "Mon, 30 Jun 2025 20:26:13 GMT"
    },
    {
      "title": "Senate tries to overcome vote-a-rama, infighting to pass Trump's $3.3 trillion bill - Reuters",
      "pubDate": "Tue, 01 Jul 2025 00:50:00 GMT"
    },
    {
      "title": "Mamdani could clinch Democratic primary when New York City releases ranked-choice results - CNN",
      "pubDate": "Tue, 01 Jul 2025 09:00:00 GMT"
    },
    {
      "title": "Polls show Americans largely oppose Trump's 'One Big Beautiful Bill,' but are more split on Medicaid, immigration specifics - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Tue, 01 Jul 2025 07:25:47 GMT"
    },
    {
      "title": "Why is Musk calling for a new America Party over the Big Beautiful Bill? - Al Jazeera",
      "pubDate": "Tue, 01 Jul 2025 12:12:52 GMT"
    },
    {
      "title": "Senate Republicans narrowly pass Trump megabill after marathon voting session - NBC News",
      "pubDate": "Tue, 01 Jul 2025 16:03:00 GMT"
    },
    {
      "title": "Trump’s megabill squeaks through Senate, but House can still reject changes - CNBC",
      "pubDate": "Tue, 01 Jul 2025 14:52:47 GMT"
    },
    {
      "title": "Trump’s Policy Bill Could Put the U.S. Further Behind China - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 19:49:28 GMT"
    },
    {
      "title": "Senate passes Trump’s major policy bill with $150 billion for the DOD - Military Times",
      "pubDate": "Tue, 01 Jul 2025 17:18:08 GMT"
    },
    {
      "title": "Senate passes Trump's Big Beautiful Bill, including no tax on tips. When will it start in MA? - Worcester Telegram",
      "pubDate": "Tue, 01 Jul 2025 19:01:54 GMT"
    },
    {
      "title": "Senate passes Trump’s reconciliation bill with Vance casting tie-breaking vote - PBS",
      "pubDate": "Tue, 01 Jul 2025 16:14:43 GMT"
    },
    {
      "title": "House Republicans don't have the votes yet to pass Trump's megabill - CNBC",
      "pubDate": "Tue, 01 Jul 2025 20:56:53 GMT"
    },
    {
      "title": "Republican budget bill dismantles climate law passed by Democrats - AP News",
      "pubDate": "Wed, 02 Jul 2025 02:14:00 GMT"
    },
    {
      "title": "Senate passes One Big Beautiful Bill Act - American Hospital Association",
      "pubDate": "Tue, 01 Jul 2025 21:07:10 GMT"
    },
    {
      "title": "Senate Bill Offers Interest Deduction for Buyers of American-Made Cars - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 09:04:08 GMT"
    },
    {
      "title": "House begins work on Trump megabill, Johnson says vote could come Wednesday - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Wed, 02 Jul 2025 07:42:30 GMT"
    },
    {
      "title": "House debates Trump's agenda bill and Pentagon pauses Ukraine shipment: Morning Rundown - NBC News",
      "pubDate": "Wed, 02 Jul 2025 11:13:29 GMT"
    },
    {
      "title": "CIA review finds flaws but does not dispute finding Putin sought to sway 2016 vote to Trump - Reuters",
      "pubDate": "Wed, 02 Jul 2025 19:47:30 GMT"
    },
    {
      "title": "Republican doubts delay Trump's tax-cut bill in the House - Reuters",
      "pubDate": "Wed, 02 Jul 2025 21:07:49 GMT"
    },
    {
      "title": "Trump’s bill ends tax on tips. Here’s how other countries tax them. - The Washington Post",
      "pubDate": "Thu, 03 Jul 2025 00:43:05 GMT"
    },
    {
      "title": "Federal judge strikes down Trump's order suspending asylum access at the southern border - NPR",
      "pubDate": "Thu, 03 Jul 2025 00:19:48 GMT"
    },
    {
      "title": "After Narrow Senate Passage, Trump’s Policy Bill Faces Resistance in House - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 01:31:00 GMT"
    },
    {
      "title": "House stumbles on Trump’s ‘Big Beautiful Bill’ - Courthouse News",
      "pubDate": "Thu, 03 Jul 2025 04:45:41 GMT"
    },
    {
      "title": "Democratic leader speaks for more than four hours on House floor as Republicans aim to vote on Trump’s major tax bill – live - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 11:55:00 GMT"
    },
    {
      "title": "Hakeem Jeffries Delays House Vote With Marathon Speech Opposing Trump’s Policy Bill - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 16:58:12 GMT"
    },
    {
      "title": "Trump's 'big beautiful bill' creates potential dilemma for UMass Memorial Health leader - Worcester Telegram",
      "pubDate": "Thu, 03 Jul 2025 14:06:07 GMT"
    },
    {
      "title": "Sweeping Trump Agenda Bill with $157 Billion Defense Boost, Food Aid Cuts Approved by Congress - Military.com",
      "pubDate": "Thu, 03 Jul 2025 19:17:49 GMT"
    },
    {
      "title": "House passes Trump megabill with $150 billion in military funding - Defense News",
      "pubDate": "Thu, 03 Jul 2025 19:24:55 GMT"
    },
    {
      "title": "House Republicans pass Trump's megabill, sending the package to his desk to be signed - NPR",
      "pubDate": "Thu, 03 Jul 2025 18:32:35 GMT"
    },
    {
      "title": "House sends megabill to Trump’s desk with $150B in military spending - The Hill",
      "pubDate": "Thu, 03 Jul 2025 23:45:00 GMT"
    },
    {
      "title": "Trump’s tax-and-spending bill passes Congress in major win for president - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 18:39:00 GMT"
    },
    {
      "title": "Republicans muscle Trump's sweeping tax-cut and spending bill through Congress - Reuters",
      "pubDate": "Thu, 03 Jul 2025 22:46:17 GMT"
    },
    {
      "title": "AOC Warns of ICE 'Explosion' After Trump Bill Passes - Newsweek",
      "pubDate": "Fri, 04 Jul 2025 03:02:51 GMT"
    },
    {
      "title": "What’s in Trump’s big bill that passed Congress and will soon become law - AP News",
      "pubDate": "Fri, 04 Jul 2025 02:30:00 GMT"
    },
    {
      "title": "House passes Trump's \"big, beautiful bill\" after stamping out GOP rebellion - Axios",
      "pubDate": "Fri, 04 Jul 2025 06:05:34 GMT"
    }
  ],
  "democratic_party": [
    {
      "title": "A self-described Democratic Socialist could be NYC’s next mayor, and the ultra rich are in revolt— ‘hot commie summer’ - Fortune",
      "pubDate": "Sat, 28 Jun 2025 10:16:00 GMT"
    },
    {
      "title": "The Democratic Party is ripe for a takeover - vox.com",
      "pubDate": "Sat, 28 Jun 2025 12:00:00 GMT"
    },
    {
      "title": "Play It Safe or Burn It All Down? Democrats Are Still Deciding - Bloomberg",
      "pubDate": "Sun, 29 Jun 2025 12:00:32 GMT"
    },
    {
      "title": "Democrats see Trump’s megabill as key to their comeback. It may not be so easy - PBS",
      "pubDate": "Fri, 04 Jul 2025 15:10:19 GMT"
    }
  ],
  "north_korea": [
    {
      "title": "North Korea May Deepen Ukraine Involvement With Troop Surge - WSJ",
      "pubDate": "Sat, 28 Jun 2025 02:22:16 GMT"
    },
    {
      "title": "US charges North Koreans in plot to defraud over 100 firms - South China Morning Post",
      "pubDate": "Mon, 30 Jun 2025 18:56:04 GMT"
    },
    {
      "title": "Kim Jong-un pays rare public tribute to North Korean soldiers killed in Ukraine - The Guardian",
      "pubDate": "Tue, 01 Jul 2025 08:55:00 GMT"
    },
    {
      "title": "North Korea to send as many as 30,000 troops to bolster Russia’s forces, Ukrainian officials say - CNN",
      "pubDate": "Wed, 02 Jul 2025 16:19:00 GMT"
    },
    {
      "title": "North Korea to send 30,000 more troops to help Russia fight Ukraine: report - New York Post",
      "pubDate": "Wed, 02 Jul 2025 22:47:00 GMT"
    },
    {
      "title": "News - Rumsfeld Says Proliferation Greatest Danger from North Korea - DVIDS",
      "pubDate": "Fri, 04 Jul 2025 10:24:00 GMT"
    }
  ],
  "us_foreign_policy": [
    {
      "title": "Israel-Iran live updates: Israel did not destroy all uranium, tried to kill Khamenei - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Thu, 26 Jun 2025 21:24:00 GMT"
    },
    {
      "title": "Pentagon reveals new details about US strikes against Iran but leaves key questions unanswered - CNN",
      "pubDate": "Thu, 26 Jun 2025 20:46:00 GMT"
    },
    {
      "title": "Why Is Trump Returning MS-13 Leaders to El Salvador? Takeaways From Times Reporting. - The New York Times",
      "pubDate": "Mon, 30 Jun 2025 09:03:14 GMT"
    }
  ],
  "trade_war": [
    {
      "title": "US reaches deal with China to speed up rare earth shipments, White House says, amid efforts to end trade war - The Guardian",
      "pubDate": "Fri, 27 Jun 2025 03:33:21 GMT"
    },
    {
      "title": "US and China sign trade deal after months-long tariff war - Australian Broadcasting Corporation",
      "pubDate": "Fri, 27 Jun 2025 15:46:30 GMT"
    },
    {
      "title": "U.S., China announce a trade agreement - again. Here’s what it means - AP News",
      "pubDate": "Fri, 27 Jun 2025 21:25:00 GMT"
    },
    {
      "title": "Trump says he is ending Canada trade talks amid tech tax dispute - The Guardian",
      "pubDate": "Fri, 27 Jun 2025 18:57:00 GMT"
    },
    {
      "title": "Trump says he's \"terminating all discussions on trade with Canada, effective immediately\" - CBS News",
      "pubDate": "Fri, 27 Jun 2025 18:20:00 GMT"
    },
    {
      "title": "Trump Throws Temper Tantrum, Launches New Trade War With Canada - The New Republic",
      "pubDate": "Fri, 27 Jun 2025 19:24:39 GMT"
    },
    {
      "title": "Canadian businesses seek certainty in US tariff war - BBC",
      "pubDate": "Sat, 28 Jun 2025 01:43:26 GMT"
    },
    {
      "title": "Trump mounts a new trade war with Canada - MSNBC News",
      "pubDate": "Sat, 28 Jun 2025 04:00:39 GMT"
    },
    {
      "title": "Trump won’t let other countries score big ‘wins’ in trade talks. Both sides could lose. - Politico",
      "pubDate": "Sun, 29 Jun 2025 20:44:52 GMT"
    },
    {
      "title": "China manufacturing activity shrinks as trade war bites - Financial Times",
      "pubDate": "Mon, 30 Jun 2025 02:49:35 GMT"
    },
    {
      "title": "Trump announces trade deal with Vietnam - The Hill",
      "pubDate": "Wed, 02 Jul 2025 14:42:00 GMT"
    },
    {
      "title": "Trump's tariff pause is set to expire, threatening a trade war flare-up - NBC News",
      "pubDate": "Wed, 02 Jul 2025 21:03:40 GMT"
    },
    {
      "title": "As trade war truce with China holds, US lifts curbs for chip design software and ethane - Reuters",
      "pubDate": "Thu, 03 Jul 2025 07:20:02 GMT"
    },
    {
      "title": "How the U.S.-China trade war could leave skies dark on the Fourth of July - NBC News",
      "pubDate": "Thu, 03 Jul 2025 08:14:33 GMT"
    },
    {
      "title": "US tariff receipts surge in Donald Trump’s trade war - Financial Times",
      "pubDate": "Thu, 03 Jul 2025 17:31:54 GMT"
    },
    {
      "title": "Trump says US will send letters setting tariff rates to trading partners - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 07:59:00 GMT"
    }
  ],
  "cybersecurity": [
    {
      "title": "A notorious hacker group is now targeting the aviation industry, the FBI says - Business Insider",
      "pubDate": "Sat, 28 Jun 2025 22:12:00 GMT"
    },
    {
      "title": "How Israel-Aligned Hackers Hobbled Iran’s Financial System - WSJ",
      "pubDate": "Sun, 29 Jun 2025 04:01:00 GMT"
    },
    {
      "title": "Over 95,000 Mainers affected by Hannaford cybersecurity breach - WMTW",
      "pubDate": "Sun, 29 Jun 2025 22:41:00 GMT"
    },
    {
      "title": "More than 25% of UK businesses hit by cyber-attack in last year, report finds - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 04:00:00 GMT"
    },
    {
      "title": "FBI Issues Warning After Hackers Breach Major U.S. Airlines - Men's Journal",
      "pubDate": "Sun, 29 Jun 2025 23:24:18 GMT"
    },
    {
      "title": "Agencies warn Iranian hackers may still target US entities, networks - The Hill",
      "pubDate": "Mon, 30 Jun 2025 14:49:00 GMT"
    },
    {
      "title": "Urgent FBI warning: Notorious hackers have a new target - AL.com",
      "pubDate": "Mon, 30 Jun 2025 14:44:00 GMT"
    },
    {
      "title": "North Korea agents steal nearly $1 million in cryptocurrency from Buckhead business: FBI - WSB-TV",
      "pubDate": "Mon, 30 Jun 2025 17:57:43 GMT"
    },
    {
      "title": "A Trio of US Treasury Hacks Exposes a Pattern Making Banks Nervous - Bloomberg.com",
      "pubDate": "Mon, 30 Jun 2025 21:00:27 GMT"
    },
    {
      "title": "DOJ announces arrest, indictments in North Korean IT worker scheme - Reuters",
      "pubDate": "Tue, 01 Jul 2025 08:24:08 GMT"
    },
    {
      "title": "Hackers tied to Iran preparing ‘calculated smear campaign’ on Trump, cyber agency says - Politico",
      "pubDate": "Tue, 01 Jul 2025 15:56:21 GMT"
    },
    {
      "title": "Qantas says hackers breached system holding data on 6 million customers - Al Jazeera",
      "pubDate": "Wed, 02 Jul 2025 04:47:16 GMT"
    },
    {
      "title": "Cyberattack hits major airline, up to 6M customer profiles exposed - Fox Business",
      "pubDate": "Wed, 02 Jul 2025 18:24:00 GMT"
    },
    {
      "title": "Massive Android Fraud Operations Uncovered: IconAds, Kaleidoscope, SMS Malware, NFC Scams - The Hacker News",
      "pubDate": "Thu, 03 Jul 2025 16:02:00 GMT"
    }
  ],
  "recession": [
    {
      "title": "Data dump: Why Labubus, vampires and Lady Gaga are not signs of recession - Hindustan Times - Hindustan Times",
      "pubDate": "Fri, 27 Jun 2025 03:42:03 GMT"
    },
    {
      "title": "JP Morgan warns of possible U.S. recession in late 2025 - AnewZ",
      "pubDate": "Fri, 27 Jun 2025 03:30:00 GMT"
    },
    {
      "title": "Veteran strategist says a recession is coming that will hit ‘cup entirely full’ stock market - MarketWatch",
      "pubDate": "Fri, 27 Jun 2025 09:30:00 GMT"
    },
    {
      "title": "Study Finds Foreclosure and Recession Fears Point to Housing Slowdown - Morningstar",
      "pubDate": "Fri, 27 Jun 2025 09:00:00 GMT"
    },
    {
      "title": "Large Banks Could Easily Weather a Massive Recession, Fed's Annual Stress Test Finds - Investopedia",
      "pubDate": "Fri, 27 Jun 2025 21:44:50 GMT"
    },
    {
      "title": "American Consumers Felt Worse Off in June—and Fear a Recession in the Next 12 Months - Realtor.com",
      "pubDate": "Fri, 27 Jun 2025 21:11:23 GMT"
    },
    {
      "title": "US recession fears rise as personal income and spending fall in May - Firstpost",
      "pubDate": "Sat, 28 Jun 2025 03:24:28 GMT"
    },
    {
      "title": "Is the Rise of Workwear a Recession Indicator? - Inc.com",
      "pubDate": "Sat, 28 Jun 2025 09:14:23 GMT"
    },
    {
      "title": "Gen Zers Convinced They Can Predict a Recession—It's Not Going Well - Newsweek",
      "pubDate": "Sat, 28 Jun 2025 08:00:01 GMT"
    },
    {
      "title": "Blind boxes, baby tees and more rising recession indicators - The University Daily Kansan",
      "pubDate": "Sat, 28 Jun 2025 15:51:00 GMT"
    },
    {
      "title": "recession warning: yield curve inversion explained - MSN",
      "pubDate": "Sun, 29 Jun 2025 03:52:07 GMT"
    },
    {
      "title": "There's Still A Chance Of Recession In 2025. What To Watch - Investopedia",
      "pubDate": "Sun, 29 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Fed Stress Test Reveals Big Banks Can Withstand Deep Recession, Maintain Lending - CU Today",
      "pubDate": "Sun, 29 Jun 2025 13:50:23 GMT"
    },
    {
      "title": "Fed Stress Test 2024: US Banks Can Withstand Severe Recession, Says Report - NewsX",
      "pubDate": "Sun, 29 Jun 2025 20:29:00 GMT"
    },
    {
      "title": "I’m an Economist: Here’s How Likely a Recession Is for the Second Half of 2025 - MSN",
      "pubDate": "Sun, 29 Jun 2025 15:21:58 GMT"
    },
    {
      "title": "Why CMOs must protect brand budgets in a recession - Ad Age",
      "pubDate": "Mon, 30 Jun 2025 09:34:35 GMT"
    },
    {
      "title": "Americans fear layoffs, but other signs are favorable. 5 economic trends to watch - The Arizona Republic",
      "pubDate": "Mon, 30 Jun 2025 12:12:15 GMT"
    },
    {
      "title": "Fed says stress test showed large banks ‘well positioned,’ even in recession - TipRanks",
      "pubDate": "Mon, 30 Jun 2025 14:36:41 GMT"
    },
    {
      "title": "US Goes ‘Immediately Into A Recession’ If Trump’s Bill Doesn’t Pass: Hassett - MSN",
      "pubDate": "Mon, 30 Jun 2025 20:33:35 GMT"
    },
    {
      "title": "What CEOs talked about in Q2 2025: Tariffs, possibility of recession, and agentic AI - IoT Analytics",
      "pubDate": "Mon, 30 Jun 2025 14:03:18 GMT"
    },
    {
      "title": "Odds On: Bettors see U.S. avoiding recession in 2025 - TipRanks",
      "pubDate": "Tue, 01 Jul 2025 07:54:16 GMT"
    },
    {
      "title": "Billionaire Ken Fisher Warns Trump Tariffs Could Trigger Recession - MSN",
      "pubDate": "Tue, 01 Jul 2025 13:31:09 GMT"
    },
    {
      "title": "13 'recession-proof' jobs that can pay over $50,000—and don't require a bachelor's degree - CNBC",
      "pubDate": "Tue, 01 Jul 2025 16:48:24 GMT"
    },
    {
      "title": "6 Warning Signs of a Recession — and Where the US Economy Stands, According to George Kamel - MSN",
      "pubDate": "Tue, 01 Jul 2025 15:32:39 GMT"
    },
    {
      "title": "Underlying Labor Market Dynamics Are Solid, Recession Stays on the Back Burner - Wolf Street",
      "pubDate": "Tue, 01 Jul 2025 18:29:49 GMT"
    },
    {
      "title": "Moody’s to NYISO: U.S. Edging Near Recession - RTO Insider",
      "pubDate": "Tue, 01 Jul 2025 21:27:57 GMT"
    },
    {
      "title": "It’s a ‘sideways’ economy but not a recession yet, analysts say - Yahoo",
      "pubDate": "Wed, 02 Jul 2025 16:00:18 GMT"
    },
    {
      "title": "Carville says US will ‘probably go into a recession,’ even with GOP megabill passage - The Hill",
      "pubDate": "Thu, 03 Jul 2025 15:35:00 GMT"
    },
    {
      "title": "The Big Four Recession Indicators - Advisor Perspectives",
      "pubDate": "Thu, 03 Jul 2025 16:33:11 GMT"
    },
    {
      "title": "Japan walks line between recession and submission as it seeks to overcome Trump tariffs - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 08:38:00 GMT"
    },
    {
      "title": "Another industry recession warning light just flashed red | Opinion - GamesIndustry.biz",
      "pubDate": "Fri, 04 Jul 2025 15:07:04 GMT"
    }
  ],
  "drones": [
    {
      "title": "Ukrainian drones strike Russian S-400 air defense system in occupied Crimea, HUR says. - The Kyiv Independent",
      "pubDate": "Thu, 26 Jun 2025 20:24:33 GMT"
    },
    {
      "title": "Exclusive | NYC eyes system using net-firing drones to entangle and take down ‘hostile’ drones - New York Post",
      "pubDate": "Sat, 28 Jun 2025 17:06:00 GMT"
    },
    {
      "title": "Russia Upgrades Shahed Drones, Adopts New Tactics In Ukraine - Forbes",
      "pubDate": "Sat, 28 Jun 2025 19:11:00 GMT"
    },
    {
      "title": "Russia has dramatically increased the production of combat drones — Bloomberg - EADaily",
      "pubDate": "Sat, 28 Jun 2025 23:15:00 GMT"
    },
    {
      "title": "Video Shows Drone Rescuing Stranded Man During Flood in China - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 10:14:18 GMT"
    }
  ],
  "hamas": [
    {
      "title": "Battling to survive, Hamas faces defiant clans and doubts over Iran - Reuters",
      "pubDate": "Fri, 27 Jun 2025 09:02:50 GMT"
    },
    {
      "title": "Israel signals Hamas negotiations could be revived - CBS News",
      "pubDate": "Fri, 27 Jun 2025 11:05:00 GMT"
    },
    {
      "title": "Report: 11 killed in new Gaza airstrike; Hamas: 72 killed in last day - Yahoo",
      "pubDate": "Fri, 27 Jun 2025 22:57:34 GMT"
    },
    {
      "title": "At least 34 people killed in Israeli strikes in Gaza as ceasefire prospects inch closer - The Washington Post",
      "pubDate": "Sat, 28 Jun 2025 10:10:24 GMT"
    },
    {
      "title": "LIVE: Israel bombs heavily populated Gaza City area, at least 20 killed - Al Jazeera",
      "pubDate": "Sat, 28 Jun 2025 15:14:07 GMT"
    },
    {
      "title": "At least 81 people killed in Israeli strikes in Gaza, Hamas-run health ministry says - BBC",
      "pubDate": "Sat, 28 Jun 2025 19:20:18 GMT"
    },
    {
      "title": "Israeli strikes kill dozens in Gaza as Trump says ceasefire possible \"next week\" - CBS News",
      "pubDate": "Sat, 28 Jun 2025 23:20:57 GMT"
    },
    {
      "title": "LIVE: Israel kills 60 in Gaza, claims senior Hamas official among dead - Al Jazeera",
      "pubDate": "Sun, 29 Jun 2025 05:37:45 GMT"
    },
    {
      "title": "Israel orders evacuations in northern Gaza as Trump calls for war to end - Reuters",
      "pubDate": "Sun, 29 Jun 2025 08:21:05 GMT"
    },
    {
      "title": "Israel’s Military Appears Poised to Expand into Gaza City Amid Cease-Fire Calls - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 10:56:20 GMT"
    },
    {
      "title": "Shin Bet: Major West Bank Hamas terror network dismantled in largest operation in years - The Times of Israel",
      "pubDate": "Sun, 29 Jun 2025 09:34:18 GMT"
    },
    {
      "title": "LIVE: Israel’s attacks on Gaza kill 47, including children and aid seekers - Al Jazeera",
      "pubDate": "Sun, 29 Jun 2025 16:30:00 GMT"
    },
    {
      "title": "Trump calls for a deal on Israel's war in Gaza, as signs of progress emerge - NPR",
      "pubDate": "Sun, 29 Jun 2025 09:09:24 GMT"
    },
    {
      "title": "Trump calls for a Gaza ceasefire deal as some Palestinians are skeptical - AP News",
      "pubDate": "Sun, 29 Jun 2025 20:09:00 GMT"
    },
    {
      "title": "Israel-Gaza war live: Israeli forces kill 23, Gaza authorities say, amid IDF warning of major offensive in north - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 06:39:00 GMT"
    },
    {
      "title": "Israeli military plans bigger Gaza op., waits for Hamas hostage response - The Jerusalem Post",
      "pubDate": "Mon, 30 Jun 2025 10:21:11 GMT"
    },
    {
      "title": "Israeli Hostage Died of Heart Attack During Hamas Torture in Gaza Captivity, Brother Says - Haaretz",
      "pubDate": "Mon, 30 Jun 2025 12:31:00 GMT"
    },
    {
      "title": "67 killed in Gaza as Israeli forces strike a cafe and fire on people seeking food - AP News",
      "pubDate": "Mon, 30 Jun 2025 17:42:00 GMT"
    },
    {
      "title": "Israel launches waves of Gaza airstrikes after new displacement orders - The Guardian",
      "pubDate": "Mon, 30 Jun 2025 22:31:00 GMT"
    },
    {
      "title": "Israel kills 95 Palestinians, bombing across Gaza amid new ceasefire push - Al Jazeera",
      "pubDate": "Mon, 30 Jun 2025 16:13:05 GMT"
    },
    {
      "title": "Live: Gaza death toll surges as Hamas accuses Israel of stalling ceasefire - Al Jazeera",
      "pubDate": "Tue, 01 Jul 2025 06:36:55 GMT"
    },
    {
      "title": "Israel strikes pound Gaza, killing 60, ahead of US talks on ceasefire - Reuters",
      "pubDate": "Tue, 01 Jul 2025 01:14:00 GMT"
    },
    {
      "title": "Saudi-Israel Talks Depend On End Of Gaza War, PA Taking Over For Hamas - i24NEWS",
      "pubDate": "Tue, 01 Jul 2025 15:42:32 GMT"
    },
    {
      "title": "Israel-Gaza war live: Trump says Israel has agreed terms for 60-day ceasefire, urges Hamas to accept deal - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 01:00:57 GMT"
    },
    {
      "title": "Trump claims Israel ready for Gaza peace deal in bid to boost Hamas ceasefire talks - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 02:13:00 GMT"
    },
    {
      "title": "LIVE: Israeli attacks kill 78; Hamas says considering ceasefire proposal - Al Jazeera",
      "pubDate": "Wed, 02 Jul 2025 12:15:47 GMT"
    },
    {
      "title": "Hamas studying new ceasefire proposals, calls for end to Gaza war - Al Jazeera",
      "pubDate": "Wed, 02 Jul 2025 17:32:16 GMT"
    },
    {
      "title": "Hamas studies Gaza ceasefire proposal labelled 'final' by Trump - Reuters",
      "pubDate": "Wed, 02 Jul 2025 21:12:00 GMT"
    },
    {
      "title": "Hamas Issues Warning to Arab Countries as It Mulls Trump Ceasefire Deal - Newsweek",
      "pubDate": "Wed, 02 Jul 2025 17:05:13 GMT"
    },
    {
      "title": "Hamas reportedly won’t hold hostage handover ceremonies during Gaza ceasefire - The Times of Israel",
      "pubDate": "Wed, 02 Jul 2025 23:49:47 GMT"
    },
    {
      "title": "82 Palestinians killed in Gaza, including 38 people waiting for aid, authorities say - AP News",
      "pubDate": "Thu, 03 Jul 2025 07:21:00 GMT"
    },
    {
      "title": "Israel hits Gaza with heavy strikes; 82 reported dead since midnight, ministry says - Haaretz",
      "pubDate": "Thu, 03 Jul 2025 08:15:00 GMT"
    },
    {
      "title": "Israel Pushes to Gain Ground in Gaza as Hamas Weighs Ceasefire - Bloomberg",
      "pubDate": "Thu, 03 Jul 2025 13:17:55 GMT"
    },
    {
      "title": "Scores killed in Gaza as Israel intensifies strikes - CNN",
      "pubDate": "Thu, 03 Jul 2025 14:10:00 GMT"
    },
    {
      "title": "Hamas seeks ceasefire guarantees as scores more are killed in Gaza - Reuters",
      "pubDate": "Thu, 03 Jul 2025 19:38:31 GMT"
    },
    {
      "title": "Hamas warns Palestinians against cooperating with U.S.-backed Gaza Humanitarian Foundation - Reuters",
      "pubDate": "Thu, 03 Jul 2025 16:13:31 GMT"
    },
    {
      "title": "Hamas Has a New Leader in Gaza. His Next Test: Cease-Fire Talks. - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 21:07:04 GMT"
    },
    {
      "title": "LIVE: Israel intensifies Gaza attacks; Hamas seeks ceasefire guarantees - Al Jazeera",
      "pubDate": "Fri, 04 Jul 2025 05:26:43 GMT"
    },
    {
      "title": "As sides await Hamas response to truce deal, Trump said to offer personal pledge to end war - The Times of Israel",
      "pubDate": "Fri, 04 Jul 2025 05:37:30 GMT"
    },
    {
      "title": "LIVE: Israel expands Gaza no-go zones, kills 138 in a day - Al Jazeera",
      "pubDate": "Fri, 04 Jul 2025 15:39:40 GMT"
    },
    {
      "title": "Hamas to Submit Response to Gaza Cease-fire, Hostage Proposal Later Friday, Diplomatic Source Estimates - Haaretz",
      "pubDate": "Fri, 04 Jul 2025 18:43:00 GMT"
    }
  ],
  "federal_reserve": [
    {
      "title": "Fed rate cut in July? Inside the US central bank, few takers - Reuters",
      "pubDate": "Thu, 26 Jun 2025 20:24:08 GMT"
    },
    {
      "title": "Trump says he won't appoint anyone to Fed who doesn't back rate cuts - Reuters",
      "pubDate": "Fri, 27 Jun 2025 23:17:20 GMT"
    },
    {
      "title": "The US Federal Reserve’s Trump problem - Financial Times",
      "pubDate": "Sun, 29 Jun 2025 10:00:09 GMT"
    },
    {
      "title": "Trump Adds Pressure on Fed's Powell to Lower Rates - Newsmax",
      "pubDate": "Mon, 30 Jun 2025 18:06:01 GMT"
    },
    {
      "title": "Federal Reserve Chair Powell is speaking on Tuesday, July 1, 2025 - Forexlive | Forex News, Technical Analysis & Trading Tools",
      "pubDate": "Tue, 01 Jul 2025 02:03:45 GMT"
    },
    {
      "title": "Federal Reserve Chair Powell responds to personal attacks from Trump - Baltimore Sun",
      "pubDate": "Wed, 02 Jul 2025 13:30:53 GMT"
    },
    {
      "title": "US rate futures raise easing bets for July, fully prices in September cut - Reuters",
      "pubDate": "Wed, 02 Jul 2025 12:49:37 GMT"
    },
    {
      "title": "Trump says Powell should ‘resign immediately’ - The Hill",
      "pubDate": "Wed, 02 Jul 2025 22:24:00 GMT"
    },
    {
      "title": "Trump calls on Powell to resign in frustration over interest rates - KIMA",
      "pubDate": "Thu, 03 Jul 2025 19:19:07 GMT"
    }
  ],
  "earthquakes": [
    {
      "title": "Over 470 earthquakes rattle Japanese island chain with active volcanoes - Mint",
      "pubDate": "Thu, 26 Jun 2025 23:42:48 GMT"
    },
    {
      "title": "Santorini earthquakes traced to sideways magma movement in crust, not traditional volcanic centers - Phys.org",
      "pubDate": "Mon, 30 Jun 2025 13:10:12 GMT"
    },
    {
      "title": "Why Redding has earthquakes: Here's what happens in Shasta Cascade region - Yahoo",
      "pubDate": "Mon, 30 Jun 2025 11:01:49 GMT"
    },
    {
      "title": "Scientists detect a rare slow-motion earthquake along Japan’s tsunami fault - Earth.com",
      "pubDate": "Tue, 01 Jul 2025 18:10:51 GMT"
    },
    {
      "title": "Hundreds of Small Earthquakes Rattle Remote Islands in Japan - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 14:39:12 GMT"
    },
    {
      "title": "Japan’s Tokara islands hit by 900 earthquakes in two weeks - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 01:43:04 GMT"
    }
  ],
  "elon_musk": [
    {
      "title": "Elon Musk claims Tesla delivered its first car fully autonomously from factory to customer - Electrek",
      "pubDate": "Fri, 27 Jun 2025 22:23:00 GMT"
    },
    {
      "title": "Musk condemns latest Senate bill that would 'destroy millions of jobs,' raise taxes on wind, solar projects - Fox Business",
      "pubDate": "Sat, 28 Jun 2025 22:28:00 GMT"
    },
    {
      "title": "Musk Wades Back Into Politics, Slamming Trump’s Domestic Policy Bill - The New York Times",
      "pubDate": "Sat, 28 Jun 2025 23:23:23 GMT"
    },
    {
      "title": "Elon Musk rips into 'utterly insane' Trump-backed megabill - CNBC",
      "pubDate": "Sat, 28 Jun 2025 22:12:32 GMT"
    },
    {
      "title": "Musk renews attacks on Trump's \"big, beautiful bill,\" says it will \"destroy million of jobs\" - CBS News",
      "pubDate": "Sun, 29 Jun 2025 02:05:51 GMT"
    },
    {
      "title": "Musk Lieutenants Depart Tesla and Leave Leadership Void - Bloomberg.com",
      "pubDate": "Mon, 30 Jun 2025 11:02:27 GMT"
    },
    {
      "title": "Elon Musk Calls Republicans Pigs, Calls for New Political Party - vanityfair.com",
      "pubDate": "Tue, 01 Jul 2025 00:20:31 GMT"
    },
    {
      "title": "Elon Musk just made his starkest political threat since the election - CNN",
      "pubDate": "Mon, 30 Jun 2025 23:19:00 GMT"
    },
    {
      "title": "Tesla Sales Fall as Elon Musk Focuses on Self-Driving Cars - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 13:05:34 GMT"
    },
    {
      "title": "Tesla EV sales plunge again after Elon Musk backlash - Axios",
      "pubDate": "Wed, 02 Jul 2025 16:14:42 GMT"
    },
    {
      "title": "Despite Protests, Elon Musk Secures Air Permit for xAI - WIRED",
      "pubDate": "Wed, 02 Jul 2025 23:41:33 GMT"
    },
    {
      "title": "Tesla Is in Disarray. Musk Has Already Moved Beyond Caring About Cars. - WSJ",
      "pubDate": "Thu, 03 Jul 2025 05:17:25 GMT"
    }
  ],
  "cancer": [
    {
      "title": "People dying early of cancer costs UK economy £10.3bn a year, study finds - The Guardian",
      "pubDate": "Thu, 26 Jun 2025 23:01:00 GMT"
    },
    {
      "title": "Hundreds of neighbors rally to give a 9-year-old with cancer one last Christmas - The Washington Post",
      "pubDate": "Mon, 30 Jun 2025 02:15:32 GMT"
    },
    {
      "title": "New blood test detects cancers 3 years before typical diagnosis, study hints - Live Science",
      "pubDate": "Mon, 30 Jun 2025 17:05:00 GMT"
    },
    {
      "title": "Thousands of cancer patients fear disruptions in care due to insurance contract dispute - CNN",
      "pubDate": "Tue, 01 Jul 2025 11:30:00 GMT"
    },
    {
      "title": "Women over 65 still at risk from cancer from HPV and should be offered cervical screening – study - The Guardian",
      "pubDate": "Tue, 01 Jul 2025 22:30:00 GMT"
    },
    {
      "title": "Regeneron Gets Accelerated FDA OK of Lynozyfic for Blood Cancer Treatment - WSJ",
      "pubDate": "Wed, 02 Jul 2025 15:45:00 GMT"
    },
    {
      "title": "Certain type of hormone therapy increases breast cancer risk, study finds - CBS News",
      "pubDate": "Wed, 02 Jul 2025 16:30:29 GMT"
    },
    {
      "title": "The fatal mutation that lets cancer outsmart the human immune system - ScienceDaily",
      "pubDate": "Thu, 03 Jul 2025 03:17:03 GMT"
    }
  ],
  "atlantic_ocean": [
    {
      "title": "A Mysterious Blob of Cold Water Defies Ocean Heat – Now We Know Why - ScienceAlert",
      "pubDate": "Sun, 29 Jun 2025 15:00:29 GMT"
    }
  ],
  "space_exploration": [
    {
      "title": "Nozzle explodes off rocket booster during engine test for NASA's Artemis program (video) - Space",
      "pubDate": "Fri, 27 Jun 2025 18:41:30 GMT"
    },
    {
      "title": "Is the US forfeiting its Red Planet leadership to China's Mars Sample Return plan? - Space",
      "pubDate": "Sun, 29 Jun 2025 10:00:00 GMT"
    }
  ],
  "health_care": [
    {
      "title": "Newsom Signs Budget That Includes Health Care Cuts for Undocumented Immigrants - The New York Times",
      "pubDate": "Sat, 28 Jun 2025 03:50:01 GMT"
    },
    {
      "title": "Inside Operation Gold Rush, largest health care fraud bust in U.S. history - The Washington Post",
      "pubDate": "Mon, 30 Jun 2025 15:17:04 GMT"
    },
    {
      "title": "More than 300 charged in $14.6 billion health care fraud schemes takedown, Justice Department says - AP News",
      "pubDate": "Mon, 30 Jun 2025 17:34:00 GMT"
    },
    {
      "title": "DOJ announces a record-breaking takedown of health care fraud schemes - NPR",
      "pubDate": "Mon, 30 Jun 2025 20:39:35 GMT"
    },
    {
      "title": "Who would be affected by health care cuts in Senate version of Trump’s budget bill - PBS",
      "pubDate": "Mon, 30 Jun 2025 22:35:48 GMT"
    },
    {
      "title": "Map Shows How Many Could Lose Health Care in Each State Under Tax Bill - Newsweek",
      "pubDate": "Tue, 01 Jul 2025 16:33:44 GMT"
    },
    {
      "title": "Centene shares plunge after health insurer withdraws forecast over Obamacare concerns - Reuters",
      "pubDate": "Wed, 02 Jul 2025 20:40:17 GMT"
    },
    {
      "title": "House nears finish line on health cuts - The Hill",
      "pubDate": "Wed, 02 Jul 2025 23:01:00 GMT"
    },
    {
      "title": "House passes 'Big Beautiful Bill': Here's what it means for health care - Healio",
      "pubDate": "Thu, 03 Jul 2025 19:45:11 GMT"
    },
    {
      "title": "How Medicaid Cuts Will Cost Some 12 Million People Health Coverage - Bloomberg.com",
      "pubDate": "Thu, 03 Jul 2025 20:27:40 GMT"
    },
    {
      "title": "How the record cuts coming to Medicaid could devastate California health care - San Francisco Chronicle",
      "pubDate": "Thu, 03 Jul 2025 23:08:13 GMT"
    },
    {
      "title": "How the tax-cut bill that’s headed to Trump’s desk would upend health care - STAT",
      "pubDate": "Thu, 03 Jul 2025 18:51:17 GMT"
    }
  ],
  "world_economy": [
    {
      "title": "World economy faces 'pivotal moment', central bank body BIS says - Reuters",
      "pubDate": "Sun, 29 Jun 2025 09:02:56 GMT"
    }
  ],
  "renewable_energy": [
    {
      "title": "Solar manufacturing is booming. Advocates say it could go bust without incentives - NPR",
      "pubDate": "Fri, 27 Jun 2025 09:50:00 GMT"
    },
    {
      "title": "GOP is on verge of sweeping victory in bid to gut clean energy economy - The Washington Post",
      "pubDate": "Sat, 28 Jun 2025 18:53:26 GMT"
    },
    {
      "title": "Senate’s tax bill seeks to gut clean energy; Musk calls it ‘utterly insane’ - The Washington Post",
      "pubDate": "Sun, 29 Jun 2025 02:18:44 GMT"
    },
    {
      "title": "Senate bill hastens end of wind, solar tax credits and imposes new tax - Reuters",
      "pubDate": "Sat, 28 Jun 2025 23:34:17 GMT"
    },
    {
      "title": "80% Of Registered Voters Support Funding Renewable Energy, New Yale-GMU Study - Forbes",
      "pubDate": "Sat, 28 Jun 2025 21:30:42 GMT"
    },
    {
      "title": "G.O.P. Bill Adds Surprise Tax That Could Cripple Wind and Solar Power - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 16:00:40 GMT"
    },
    {
      "title": "Senate Megabill Stuns the Clean Energy Industry With New Tax on Wind and Solar - WSJ",
      "pubDate": "Sun, 29 Jun 2025 20:24:00 GMT"
    },
    {
      "title": "A surprise excise tax sends the clean energy industry into panic - Latitude Media",
      "pubDate": "Mon, 30 Jun 2025 00:47:54 GMT"
    },
    {
      "title": "Clean energy stocks fall as Trump bill taxes components from China, phases out credits - CNBC",
      "pubDate": "Mon, 30 Jun 2025 13:59:04 GMT"
    },
    {
      "title": "Senate GOP tax bill could crush wind and solar power, advocates say - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Mon, 30 Jun 2025 18:39:19 GMT"
    },
    {
      "title": "Senate Republicans push clean energy megabill amendments - E&E News by POLITICO",
      "pubDate": "Mon, 30 Jun 2025 17:29:00 GMT"
    },
    {
      "title": "Senate Version of “Beautiful” Bill Will “Kill” America’s Clean Energy Sector, Experts Say - Mother Jones",
      "pubDate": "Tue, 01 Jul 2025 00:19:27 GMT"
    },
    {
      "title": "Republican senators seek to change Senate bill clean energy tax, improve tax credits - Reuters",
      "pubDate": "Mon, 30 Jun 2025 22:05:46 GMT"
    },
    {
      "title": "GOP fight over clean energy threatens to derail megabill - Politico",
      "pubDate": "Mon, 30 Jun 2025 19:39:34 GMT"
    },
    {
      "title": "US startup Lyten to take over Northvolt's energy storage systems factory in Poland - Reuters",
      "pubDate": "Tue, 01 Jul 2025 07:04:21 GMT"
    },
    {
      "title": "Senate passes megabill that curbs IRA tax credits, drops wind and solar tax - Utility Dive",
      "pubDate": "Tue, 01 Jul 2025 18:57:14 GMT"
    },
    {
      "title": "Clean energy stocks jump after tax on solar and wind projects is removed from Trump's big bill - CNBC",
      "pubDate": "Tue, 01 Jul 2025 17:28:57 GMT"
    },
    {
      "title": "Senate removes excise tax on renewable energy industry from Trump domestic policy bill - CBS News",
      "pubDate": "Tue, 01 Jul 2025 22:17:20 GMT"
    },
    {
      "title": "The GOP’s big spending bill could kill renewable energy projects - The Verge",
      "pubDate": "Tue, 01 Jul 2025 20:03:51 GMT"
    },
    {
      "title": "Senate GOP bets softer clean energy cuts won’t come back to bite them - Politico",
      "pubDate": "Wed, 02 Jul 2025 10:28:00 GMT"
    },
    {
      "title": "Trump's budget bill boosts fossil fuels, hits renewable energy - Reuters",
      "pubDate": "Wed, 02 Jul 2025 21:31:45 GMT"
    },
    {
      "title": "Poland’s clean energy usage overtakes coal for first time - Financial Times",
      "pubDate": "Thu, 03 Jul 2025 04:00:24 GMT"
    },
    {
      "title": "Trump megabill gives the oil industry everything it wants and ends key support for solar and wind - CNBC",
      "pubDate": "Thu, 03 Jul 2025 18:55:21 GMT"
    },
    {
      "title": "How the G.O.P. Bill Will Reshape America’s Energy Landscape - The New York Times",
      "pubDate": "Thu, 03 Jul 2025 19:00:54 GMT"
    },
    {
      "title": "Trump’s Tax Package Curbs Renewable Energy Just as AI’s Power Needs Soar - Bloomberg.com",
      "pubDate": "Fri, 04 Jul 2025 11:42:09 GMT"
    },
    {
      "title": "Renewables face setback under sweeping federal spending bill - Virginia Mercury",
      "pubDate": "Fri, 04 Jul 2025 09:21:15 GMT"
    }
  ],
  "cryptocurrency": [
    {
      "title": "Online hacks to offline heists: crypto leaders on edge amid increasing attacks - The Guardian",
      "pubDate": "Sat, 28 Jun 2025 12:01:00 GMT"
    },
    {
      "title": "Bybit Ethereum Heist Propels Record $2.1 Billion in Crypto Stolen by Hackers So Far in 2025 - Decrypt",
      "pubDate": "Sat, 28 Jun 2025 17:31:02 GMT"
    },
    {
      "title": "USDG Stablecoin Expands to Europe - PYMNTS.com",
      "pubDate": "Wed, 02 Jul 2025 09:51:04 GMT"
    },
    {
      "title": "Belgian court sentences three in kidnapping of crypto investor’s wife - Cointelegraph",
      "pubDate": "Fri, 04 Jul 2025 09:39:25 GMT"
    }
  ],
  "national_security": [
    {
      "title": "Trump terminates satellite data considered crucial to storm forecasting - E&E News by POLITICO",
      "pubDate": "Fri, 27 Jun 2025 10:47:00 GMT"
    },
    {
      "title": "Hurricane forecast accuracy at risk as Pentagon cuts satellite data - NewsNation",
      "pubDate": "Fri, 27 Jun 2025 11:31:28 GMT"
    }
  ],
  "military_intelligence": [
    {
      "title": "Pentagon Unveils $33.6 Billion Military Intelligence Budget For 2026 - Dallas Express",
      "pubDate": "Thu, 26 Jun 2025 20:46:25 GMT"
    }
  ],
  "taxes": [
    {
      "title": "Updated megabill includes key compromises on taxes and Medicaid - Politico",
      "pubDate": "Sat, 28 Jun 2025 13:39:47 GMT"
    },
    {
      "title": "Trump celebrates legislative victory with $4.5 trillion tax cut bill - 13wham.com",
      "pubDate": "Fri, 04 Jul 2025 00:49:13 GMT"
    }
  ],
  "tesla": [
    {
      "title": "Tesla's first fully autonomous car drove itself to its new Texas owner, doing 72 mph on the highway, an engineer says - Business Insider",
      "pubDate": "Sat, 28 Jun 2025 00:56:00 GMT"
    },
    {
      "title": "Tesla silences FSD critics by posting full video of Model Y delivering itself to customer - Teslarati",
      "pubDate": "Sat, 28 Jun 2025 11:19:23 GMT"
    },
    {
      "title": "Tesla shares drop on Musk, Trump feud ahead of Q2 deliveries - CNBC",
      "pubDate": "Wed, 02 Jul 2025 00:29:00 GMT"
    },
    {
      "title": "Tesla delivers 384,122 cars globally in Q2, falling further behind BYD - CnEVPost",
      "pubDate": "Wed, 02 Jul 2025 13:08:43 GMT"
    },
    {
      "title": "Tesla sales continue to slide amid competition and backlash against Elon Musk - Los Angeles Times",
      "pubDate": "Wed, 02 Jul 2025 20:26:56 GMT"
    },
    {
      "title": "Tesla sales plunge again as anti-Musk boycott shows staying power and rivals pounce on the weakness - AP News",
      "pubDate": "Wed, 02 Jul 2025 21:44:00 GMT"
    },
    {
      "title": "Tesla’s Global Vehicle Deliveries Plunged in Second Quarter - WSJ",
      "pubDate": "Wed, 02 Jul 2025 18:09:00 GMT"
    },
    {
      "title": "Tesla deliveries slump, Musk's EV maker stares at second year of falling sales - Reuters",
      "pubDate": "Wed, 02 Jul 2025 17:49:41 GMT"
    },
    {
      "title": "Tesla's German car sales continue to fall in June - Reuters",
      "pubDate": "Fri, 04 Jul 2025 06:48:00 GMT"
    },
    {
      "title": "Trump's Tax Bill Could Be A Boost For Tesla-Rivals Rivian, Lucid Amid EV Slowdown, Says BNP Paribas - Benzinga",
      "pubDate": "Fri, 04 Jul 2025 10:21:58 GMT"
    }
  ],
  "us_supreme_court": [
    {
      "title": "Supreme Court decision on birthright citizenship broadens Trump's power - BBC",
      "pubDate": "Fri, 27 Jun 2025 16:50:48 GMT"
    },
    {
      "title": "Supreme Court in birthright case limits judges' power to block presidential policies - Reuters",
      "pubDate": "Fri, 27 Jun 2025 21:51:22 GMT"
    },
    {
      "title": "Supreme Court limits nationwide injunctions, but fate of Trump birthright citizenship order unclear - AP News",
      "pubDate": "Fri, 27 Jun 2025 20:04:00 GMT"
    },
    {
      "title": "‘Explosive’: US Supreme Court deals blow to those challenging Trump’s power - Al Jazeera",
      "pubDate": "Fri, 27 Jun 2025 21:56:15 GMT"
    },
    {
      "title": "Initially wary of Trump, Roberts and Barrett offer the president his biggest win of the Supreme Court term - CNN",
      "pubDate": "Sat, 28 Jun 2025 12:23:00 GMT"
    },
    {
      "title": "US Supreme Court Dealt Blows to EPA and Environmental Protections - U.S. News & World Report",
      "pubDate": "Tue, 01 Jul 2025 10:05:00 GMT"
    }
  ],
  "inflation": [
    {
      "title": "The Trump tariffs aren't causing U.S. prices to spike. Here's why. - CBS News",
      "pubDate": "Tue, 01 Jul 2025 14:11:37 GMT"
    },
    {
      "title": "Here’s where groceries cost more (and less) over the past year - The Hill",
      "pubDate": "Tue, 01 Jul 2025 12:18:00 GMT"
    },
    {
      "title": "Fourth of July cookout: Food prices increase because of Trump tariffs, report finds - Axios",
      "pubDate": "Fri, 04 Jul 2025 13:11:34 GMT"
    }
  ],
  "nasa": [
    {
      "title": "White House Could Jeopardize Mars Missions By Slashing NASA’s Funding - Forbes",
      "pubDate": "Sat, 28 Jun 2025 20:50:24 GMT"
    }
  ],
  "asteroids": [
    {
      "title": "Rubin Observatory’s Stunning Result Proves It’s a 'Game Changer' for Spotting Dangerous Asteroids - Gizmodo",
      "pubDate": "Sat, 28 Jun 2025 10:00:05 GMT"
    },
    {
      "title": "Surprise Discovery In Ryugu Asteroid Is Making Scientists Repurpose Their Theories - Mashable India",
      "pubDate": "Wed, 02 Jul 2025 06:50:26 GMT"
    }
  ],
  "spacex": [
    {
      "title": "SpaceX Seeks Return of Debris After Mexico Pollution Complaint - Bloomberg",
      "pubDate": "Thu, 26 Jun 2025 22:49:57 GMT"
    },
    {
      "title": "Mexico investigating contamination from SpaceX explosion debris - The Hill",
      "pubDate": "Fri, 27 Jun 2025 02:23:00 GMT"
    }
  ],
  "data_breach": [
    {
      "title": "Ahold Delhaize Data Breach Impacts 2.2 Million People - SecurityWeek",
      "pubDate": "Mon, 30 Jun 2025 07:04:38 GMT"
    },
    {
      "title": "Massive Ahold Delhaize data breach sees 2.2 million people's data exposed in ransomware attacks against major U.S. food retailer - PC Gamer",
      "pubDate": "Tue, 01 Jul 2025 04:21:18 GMT"
    },
    {
      "title": "Data breach at rental company Hertz exposes customers' personal information - USA Today",
      "pubDate": "Tue, 01 Jul 2025 00:49:50 GMT"
    },
    {
      "title": "Qantas data breach to impact 6 million airline customers - BBC",
      "pubDate": "Wed, 02 Jul 2025 01:34:59 GMT"
    },
    {
      "title": "Qantas says 'significant' portion of 6m customers' data likely stolen - Australian Broadcasting Corporation",
      "pubDate": "Tue, 01 Jul 2025 23:49:28 GMT"
    },
    {
      "title": "Qantas confirms cyber-attack exposed records of up to 6 million customers - The Guardian",
      "pubDate": "Tue, 01 Jul 2025 23:59:00 GMT"
    },
    {
      "title": "Medicare data breach may have compromised personal information of 100,000 Americans - USA Today",
      "pubDate": "Wed, 02 Jul 2025 01:41:45 GMT"
    },
    {
      "title": "Qantas cyber hack could have stolen ‘significant’ amount of data from six million customers - CNN",
      "pubDate": "Wed, 02 Jul 2025 04:08:00 GMT"
    },
    {
      "title": "Australia's Qantas says 6 million customer accounts accessed in cyber hack - Reuters",
      "pubDate": "Wed, 02 Jul 2025 08:04:38 GMT"
    },
    {
      "title": "Qantas data breach exposes personal details of millions of customers - AppleInsider",
      "pubDate": "Wed, 02 Jul 2025 13:23:21 GMT"
    },
    {
      "title": "Qantas hit by 'significant' cyberattack, data breach of 6 million customers days after FBI warning to airlines - Fast Company",
      "pubDate": "Wed, 02 Jul 2025 18:05:29 GMT"
    },
    {
      "title": "Qantas cyber-attack: what data was taken and what should I do if I’m affected? - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 05:59:00 GMT"
    },
    {
      "title": "Qantas cyber attack: What we know about the 'significant' customer data breach - SBS Australia",
      "pubDate": "Thu, 03 Jul 2025 13:30:38 GMT"
    }
  ],
  "technology": [
    {
      "title": "New electric car battery breakthrough, and its not from China: American carmaker GM forging ahead with game-changing cells that could make electric car and utes way more affordable - CarsGuide",
      "pubDate": "Fri, 27 Jun 2025 17:00:00 GMT"
    },
    {
      "title": "Scientists make stunning breakthrough that could solve dangerous issue with modern batteries: 'Offering a built-in safeguard' - The Cool Down",
      "pubDate": "Sat, 28 Jun 2025 14:30:00 GMT"
    },
    {
      "title": "OpenAI Loses 4 Key Researchers to Meta - WIRED",
      "pubDate": "Sat, 28 Jun 2025 20:16:10 GMT"
    },
    {
      "title": "CoreWeave is the first cloud provider to deploy Nvidia's latest AI chips - CNBC",
      "pubDate": "Thu, 03 Jul 2025 16:30:06 GMT"
    }
  ],
  "quantum_computer": [
    {
      "title": "Scientists achieve teleportation between quantum computers for the first time ever - Earth.com",
      "pubDate": "Sat, 28 Jun 2025 17:50:41 GMT"
    },
    {
      "title": "Quantum computers just beat classical ones — Exponentially and unconditionally - ScienceDaily",
      "pubDate": "Mon, 30 Jun 2025 06:32:47 GMT"
    },
    {
      "title": "Quantum computer simulates spontaneous symmetry breaking at zero temperature - Phys.org",
      "pubDate": "Wed, 02 Jul 2025 20:17:04 GMT"
    },
    {
      "title": "Scientists just simulated the “impossible” — fault-tolerant quantum code cracked at last - ScienceDaily",
      "pubDate": "Thu, 03 Jul 2025 12:18:14 GMT"
    }
  ],
  "republican_party": [
    {
      "title": "Senate Republicans put megabill on track for likely Monday passage - Politico",
      "pubDate": "Sun, 29 Jun 2025 04:10:32 GMT"
    },
    {
      "title": "Musk slams Trump megabill: ‘Political suicide for the Republican Party’ - The Hill",
      "pubDate": "Sun, 29 Jun 2025 13:11:00 GMT"
    },
    {
      "title": "Thom Tillis won’t seek re-election after clash with Trump over ‘big beautiful bill’ - The Guardian",
      "pubDate": "Sun, 29 Jun 2025 14:32:00 GMT"
    },
    {
      "title": "Conservatives: Trump won our megabill votes by promising crackdown on renewable energy credits - Politico",
      "pubDate": "Thu, 03 Jul 2025 14:50:02 GMT"
    }
  ],
  "bitcoin": [
    {
      "title": "Few Bitcoin treasury companies will survive 'death spiral': VC Report - Cointelegraph",
      "pubDate": "Sat, 28 Jun 2025 20:30:49 GMT"
    },
    {
      "title": "Bitcoin Surges 10% to $108,000 Amid Geopolitical Tensions - AInvest",
      "pubDate": "Sun, 29 Jun 2025 10:11:18 GMT"
    },
    {
      "title": "Bitcoin Rallies 74% in 2025, Stabilizes Near $105,000 Amid Institutional Demand - AInvest",
      "pubDate": "Sun, 29 Jun 2025 15:11:18 GMT"
    },
    {
      "title": "Bitcoin Consolidating Below $108,000 But Eyes $115,000 Target - TradingView",
      "pubDate": "Sun, 29 Jun 2025 13:00:37 GMT"
    },
    {
      "title": "Bitcoin Soars, Altcoins Fade in $300 Billion Crypto Shakeout - Bloomberg.com",
      "pubDate": "Mon, 30 Jun 2025 05:00:00 GMT"
    },
    {
      "title": "BTC, ETH, SOL News: Bitcoin Carries Crypto Markets in 2025's First Half as Altcoins Crumble - CoinDesk",
      "pubDate": "Mon, 30 Jun 2025 20:11:46 GMT"
    },
    {
      "title": "Bitcoin sets record monthly close at $107K as analyst tips 9% rally - Cointelegraph",
      "pubDate": "Tue, 01 Jul 2025 05:22:25 GMT"
    },
    {
      "title": "Mysterious $20k Bitcoin transfer to Satoshi Nakamoto's untouched wallet adds to its $117 billion frozen since creator's disappearance in 2011 - Boing Boing",
      "pubDate": "Tue, 01 Jul 2025 21:06:46 GMT"
    },
    {
      "title": "Bitcoin Braced For A Surprise $22 Trillion Fed Price Earthquake - Forbes",
      "pubDate": "Wed, 02 Jul 2025 14:23:00 GMT"
    },
    {
      "title": "BlackRock’s Bitcoin ETF Generating More Revenue Than Its Flagship S&P 500 Fund - CoinDesk",
      "pubDate": "Wed, 02 Jul 2025 17:32:51 GMT"
    },
    {
      "title": "Why can't Bitcoin price break $112K all-time highs? BTC analysts explain - Cointelegraph",
      "pubDate": "Thu, 03 Jul 2025 12:31:59 GMT"
    },
    {
      "title": "Bitcoin must hold above $108K or risk a bearish spiral - Cointelegraph",
      "pubDate": "Fri, 04 Jul 2025 03:36:12 GMT"
    },
    {
      "title": "Bitcoin price today: steady near 109k as tariff, rate jitters offset ’crypto week’ - Investing.com",
      "pubDate": "Fri, 04 Jul 2025 05:23:56 GMT"
    },
    {
      "title": "Bitcoin bull run could peter out in 2-3 months, says analyst - Cointelegraph",
      "pubDate": "Fri, 04 Jul 2025 05:29:32 GMT"
    },
    {
      "title": "Mysterious Bitcoin Whale Moves $8 Billion in 'Largest Daily' Transfer of Old BTC in History - Decrypt",
      "pubDate": "Fri, 04 Jul 2025 16:12:04 GMT"
    }
  ],
  "us_congress": [
    {
      "title": "Senate blocks attempt to curb Trump’s power to use military force - The Times",
      "pubDate": "Fri, 27 Jun 2025 23:55:00 GMT"
    },
    {
      "title": "Senate Republicans release updated text for most of their megabill - Politico",
      "pubDate": "Sat, 28 Jun 2025 04:16:48 GMT"
    },
    {
      "title": "House passes Senate version of megabill, sending it to Trump’s desk - Utility Dive",
      "pubDate": "Thu, 03 Jul 2025 18:37:58 GMT"
    }
  ],
  "central_intelligence_agency": [
    {
      "title": "Iran’s nuclear programme severely damaged, CIA Director confirms - Defence Industry Europe",
      "pubDate": "Thu, 26 Jun 2025 22:25:57 GMT"
    },
    {
      "title": "CIA declassifies review of intelligence report on 2016 Russia election interference - NBC News",
      "pubDate": "Thu, 03 Jul 2025 00:18:00 GMT"
    }
  ],
  "astronomy": [
    {
      "title": "A mysterious mineral in asteroid Ryugu may rewrite planetary history - ScienceDaily",
      "pubDate": "Sat, 28 Jun 2025 06:30:15 GMT"
    }
  ],
  "fusion_power": [
    {
      "title": "Researchers make crucial discovery on journey toward limitless energy machine: 'A much more reliable method' - The Cool Down",
      "pubDate": "Fri, 27 Jun 2025 21:15:00 GMT"
    },
    {
      "title": "French fusion reactor stuns world by sustaining nuclear reaction for 22 minutes in breakthrough energy milestone - Glass Almanac",
      "pubDate": "Sat, 28 Jun 2025 14:30:15 GMT"
    },
    {
      "title": "Google makes first foray into fusion in venture with MIT spinoff Commonwealth Fusion Systems - CNBC",
      "pubDate": "Mon, 30 Jun 2025 13:00:01 GMT"
    },
    {
      "title": "Google strikes deal to buy fusion power from MIT spinoff Commonwealth - Reuters",
      "pubDate": "Mon, 30 Jun 2025 15:30:22 GMT"
    },
    {
      "title": "Google just pre-ordered 200 megawatts of fusion energy for the 2030s - New Atlas",
      "pubDate": "Tue, 01 Jul 2025 07:12:13 GMT"
    },
    {
      "title": "Record-Breaking Results Bring Fusion Power Closer to Reality - Scientific American",
      "pubDate": "Thu, 03 Jul 2025 12:00:00 GMT"
    }
  ],
  "us_senate": [
    {
      "title": "Senate votes down measure restricting Trump from further military action in Iran - CBS News",
      "pubDate": "Sat, 28 Jun 2025 01:30:21 GMT"
    },
    {
      "title": "Senate rejects resolution to curb Trump's use of military in Iran - USA Today",
      "pubDate": "Fri, 27 Jun 2025 23:01:16 GMT"
    },
    {
      "title": "Live updates: It's go time for Senate on Trump's megabill. Do they have the votes? - USA Today",
      "pubDate": "Sat, 28 Jun 2025 21:39:17 GMT"
    },
    {
      "title": "Senate ekes out late-night win on Trump's \"big, beautiful bill\" - Axios",
      "pubDate": "Sun, 29 Jun 2025 05:25:54 GMT"
    },
    {
      "title": "Senate GOP tax bill includes largest cut to U.S. safety net in decades - The Washington Post",
      "pubDate": "Sun, 29 Jun 2025 16:41:33 GMT"
    },
    {
      "title": "Senate moves toward final vote on big budget bill, with Alaska at the forefront - Alaska Beacon",
      "pubDate": "Tue, 01 Jul 2025 01:21:06 GMT"
    }
  ],
  "new_york_city": [
    {
      "title": "Second Teenage Boy Shot and Killed in New York City in 2 Days - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 18:57:26 GMT"
    },
    {
      "title": "NYC Pride March Arrives Amid Growing National Backlash - The New York Times",
      "pubDate": "Sun, 29 Jun 2025 07:00:05 GMT"
    },
    {
      "title": "NYC Pride March draws more than 1 million to Manhattan to express joy, love, and defiance - CBS News",
      "pubDate": "Sun, 29 Jun 2025 22:43:00 GMT"
    },
    {
      "title": "Zohran Mamdani Wins N.Y.C. Mayoral Primary in Decisive 12-Point Victory - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 03:46:41 GMT"
    }
  ],
  "nvidia": [
    {
      "title": "Nvidia Becomes World's Most Valuable Company - Bloomberg.com",
      "pubDate": "Thu, 26 Jun 2025 20:51:18 GMT"
    },
    {
      "title": "Nvidia executives cash out $1bn worth of shares - Financial Times",
      "pubDate": "Sun, 29 Jun 2025 04:00:28 GMT"
    },
    {
      "title": "Microsoft and Nvidia Are the Odd $4 Trillion Power Couple - WSJ",
      "pubDate": "Fri, 04 Jul 2025 09:30:00 GMT"
    }
  ],
  "earth_science": [
    {
      "title": "Scientists say they have identified Earth’s oldest rocks. It could reveal an unknown chapter in our planet’s history - CNN",
      "pubDate": "Fri, 27 Jun 2025 11:58:00 GMT"
    },
    {
      "title": "Scientists Detect Deep, Rhythmic Pulse Coming From Inside the Earth - Futurism",
      "pubDate": "Sun, 29 Jun 2025 19:00:30 GMT"
    }
  ],
  "research": [
    {
      "title": "Trump Is Gutting LGBTQ+ Research. It’s Going to Cost Us All. - Slate",
      "pubDate": "Fri, 27 Jun 2025 09:45:00 GMT"
    }
  ],
  "hurricanes": [
    {
      "title": "Critical Hurricane Monitoring Data Is Going Offline - The New York Times",
      "pubDate": "Fri, 27 Jun 2025 15:54:31 GMT"
    },
    {
      "title": "Sudden loss of key US satellite data could send hurricane forecasting back ‘decades’ - The Guardian",
      "pubDate": "Sat, 28 Jun 2025 11:00:00 GMT"
    },
    {
      "title": "Hurricane season is here and meteorologists are losing a vital tool for forecasting them - ABC News - Breaking News, Latest News and Videos",
      "pubDate": "Sat, 28 Jun 2025 21:13:26 GMT"
    },
    {
      "title": "Hurricane center keeps eyes on tropical system that could target Florida while Tropical Storm Barry strikes Mexico - Orlando Sentinel",
      "pubDate": "Mon, 30 Jun 2025 08:15:00 GMT"
    }
  ],
  "computers": [
    {
      "title": "American Airlines operations returning to normal after widespread computer outage - CNN",
      "pubDate": "Fri, 27 Jun 2025 19:19:00 GMT"
    }
  ],
  "amazon": [
    {
      "title": "Amazon, Google, Meta, and Uber slapped with $2 billion retroactive tax bill as Trump suspends Canada trade talks - Fortune",
      "pubDate": "Sat, 28 Jun 2025 00:17:00 GMT"
    },
    {
      "title": "Analyst sees an unpleasant change coming to Amazon Prime - TheStreet",
      "pubDate": "Sun, 29 Jun 2025 13:47:09 GMT"
    },
    {
      "title": "Amazon CEO Jassy says AI will lead to 'fewer people doing some of the jobs' that get automated - CNBC",
      "pubDate": "Tue, 01 Jul 2025 00:01:00 GMT"
    }
  ],
  "vladimir_putin": [
    {
      "title": "Putin publicly admits economic troubles, says defense spending will be cut - MSN",
      "pubDate": "Sun, 29 Jun 2025 09:11:20 GMT"
    },
    {
      "title": "Ukraine Kills Top Russian Navy Commander Who Putin Just Promoted - Newsweek",
      "pubDate": "Thu, 03 Jul 2025 11:58:59 GMT"
    }
  ],
  "atmospheric_science": [
    {
      "title": "Scientists analyse first samples from ancient Antarctic ice core - Australian Broadcasting Corporation",
      "pubDate": "Sat, 28 Jun 2025 22:48:46 GMT"
    },
    {
      "title": "Trump’s NOAA budget proposes eliminating funding for six Colorado climate and science labs - Boulder Daily Camera",
      "pubDate": "Wed, 02 Jul 2025 17:58:09 GMT"
    }
  ],
  "chris_murphy": [
    {
      "title": "Sen. Chris Murphy says it's 'clear' Trump's strikes on Iran are 'illegal' - NBC News",
      "pubDate": "Sun, 29 Jun 2025 14:39:10 GMT"
    }
  ],
  "openai": [
    {
      "title": "Meta's AI Talent War: A Strategic Gamble with Implications for Investors - AInvest",
      "pubDate": "Sun, 29 Jun 2025 21:34:39 GMT"
    },
    {
      "title": "Why OpenAI and Anthropic Are the Best Bets in Artificial Intelligence - The Information",
      "pubDate": "Fri, 04 Jul 2025 18:00:00 GMT"
    }
  ],
  "large_language_model": [
    {
      "title": "Exploring how AI has changed daily life - AI News",
      "pubDate": "Mon, 30 Jun 2025 08:49:53 GMT"
    },
    {
      "title": "OpenAI rejects Robinhood’s unauthorised tokenised shares - AI News",
      "pubDate": "Thu, 03 Jul 2025 15:56:26 GMT"
    }
  ],
  "environment": [
    {
      "title": "Mysterious Samurai in Dark Fantasy Japanese 3D Environment Made in Blender - 80 Level",
      "pubDate": "Mon, 30 Jun 2025 16:13:22 GMT"
    },
    {
      "title": "California Rolls Back Its Landmark Environmental Law - The New York Times",
      "pubDate": "Tue, 01 Jul 2025 03:51:25 GMT"
    }
  ],
  "public_health": [
    {
      "title": "Why Can’t Americans Sleep? - The Atlantic",
      "pubDate": "Mon, 30 Jun 2025 10:00:00 GMT"
    },
    {
      "title": "Millions are at risk under federal healthcare cuts. California must step up | Opinion - Sacramento Bee",
      "pubDate": "Tue, 01 Jul 2025 12:00:00 GMT"
    }
  ],
  "blockchain": [
    {
      "title": "Robinhood Launches Stock Tokens, Reveals Layer 2 Blockchain, and Expands Crypto Suite in EU and US with Perpetual Futures and Staking - Robinhood Newsroom",
      "pubDate": "Mon, 30 Jun 2025 15:02:25 GMT"
    }
  ],
  "political_corruption": [
    {
      "title": "Massive healthcare fraud takedown - KVOA",
      "pubDate": "Tue, 01 Jul 2025 00:52:00 GMT"
    }
  ],
  "pollution": [
    {
      "title": "US power pollution climbs on higher coal use - Reuters",
      "pubDate": "Tue, 01 Jul 2025 12:00:00 GMT"
    },
    {
      "title": "Air pollution linked to lung cancer-driving DNA mutations, study finds - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 18:36:00 GMT"
    },
    {
      "title": "Air pollution may be raising risk of lung cancer in ‘never-smokers’: Study - The Hill",
      "pubDate": "Wed, 02 Jul 2025 15:05:00 GMT"
    },
    {
      "title": "Landmark US study reveals sewage sludge and wastewater plants tied to Pfas pollution - The Guardian",
      "pubDate": "Fri, 04 Jul 2025 11:02:00 GMT"
    }
  ],
  "military_and_defense": [
    {
      "title": "Senate passes Republicans’ domestic policy bill with $150B extra for Pentagon - Stars and Stripes",
      "pubDate": "Tue, 01 Jul 2025 16:52:35 GMT"
    }
  ],
  "google": [
    {
      "title": "Google ordered to pay over $314 million to Android users in California for ‘stealing’ mobile data - Mint",
      "pubDate": "Wed, 02 Jul 2025 02:04:38 GMT"
    },
    {
      "title": "Google Owes $314 Million for Misusing Android Cell Phone Data - Bloomberg",
      "pubDate": "Tue, 01 Jul 2025 22:04:04 GMT"
    },
    {
      "title": "Google Ends Recipe Pilot That Left Creators Fearing Web-Traffic Hit - Bloomberg.com",
      "pubDate": "Tue, 01 Jul 2025 22:35:37 GMT"
    },
    {
      "title": "Google undercounts its carbon emissions, report finds - The Guardian",
      "pubDate": "Wed, 02 Jul 2025 20:11:00 GMT"
    }
  ],
  "microsoft": [
    {
      "title": "Microsoft laying off about 9,000 employees in latest round of cuts - CNBC",
      "pubDate": "Wed, 02 Jul 2025 13:07:08 GMT"
    },
    {
      "title": "Microsoft to lay off around 9,000 workers in its largest cuts since 2023 - CNN",
      "pubDate": "Wed, 02 Jul 2025 15:45:00 GMT"
    },
    {
      "title": "Microsoft to Lay Off About 9,000 Employees - The New York Times",
      "pubDate": "Wed, 02 Jul 2025 16:55:33 GMT"
    },
    {
      "title": "Microsoft Layoffs To Hit 9,000 Employees, Including Salespeople: Report - CRN Magazine",
      "pubDate": "Wed, 02 Jul 2025 14:38:00 GMT"
    },
    {
      "title": "Microsoft cuts deeper into its workforce with another major round of layoffs - Business Insider",
      "pubDate": "Wed, 02 Jul 2025 16:58:00 GMT"
    },
    {
      "title": "Microsoft to cut up to 9,000 jobs as it invests in AI - BBC",
      "pubDate": "Thu, 03 Jul 2025 03:09:37 GMT"
    },
    {
      "title": "Microsoft cuts 9,000 jobs in latest round of layoffs amid restructuring push - The Indian Express",
      "pubDate": "Thu, 03 Jul 2025 06:44:00 GMT"
    }
  ],
  "self-driving_cars": [
    {
      "title": "He ran circles around a Waymo. And proved they'll never work in big cities | Opinion - The Arizona Republic",
      "pubDate": "Wed, 02 Jul 2025 13:05:12 GMT"
    }
  ],
  "fbi": [
    {
      "title": "Military veteran gets a life sentence for plotting an FBI attack after his Jan. 6 arrest - AP News",
      "pubDate": "Wed, 02 Jul 2025 20:57:00 GMT"
    },
    {
      "title": "FBI, DHS warn of ‘lone wolf’ July 4 attacks - NewsNation",
      "pubDate": "Thu, 03 Jul 2025 22:04:29 GMT"
    }
  ],
  "science": [
    {
      "title": "Scientists warn US will lose a generation of talent because of Trump cuts - The Guardian",
      "pubDate": "Thu, 03 Jul 2025 18:25:00 GMT"
    }
  ],
  "battery_electric_vehicle": [
    {
      "title": "June EV sales in the UK: one in four buyers goes electric - Electric Cars Report",
      "pubDate": "Fri, 04 Jul 2025 13:39:42 GMT"
    }
  ]
}